[
  {
    "url": "https://www.bbc.com/news",
    "domain": "www.bbc.com",
    "publish_date": "2025-11-01T11:11:09.293Z",
    "language": "en-GB",
    "title": "BBC News - Breaking news, video and the latest top stories from the U.S. and around the world",
    "description": "Visit BBC News for the latest news, breaking news, video, audio and analysis. BBC News provides trusted World, U.S. and U.K. news as well as local and regional perspectives. Also entertainment, climate, business, science, technology and health news.",
    "text": "BBC News - Breaking news, video and the latest top stories from the U.S. and around the world\nAdvertisement\nAndrew should answer Epstein questions in US, Democrats say\nMembers of a panel investigating late sex offender Jeffrey Epstein say the former prince should \"come clean\".\n21 mins ago\nUK\nWhy Sarah Ferguson, Beatrice and Eugenie can't escape the taint of family scandal\nThe scandal engulfing Andrew is of his own making but has had a profound impact on his immediate family.\n2 hrs ago\nUK\nHalloween 2025: All the celebrity costumes at Heidi Klum's party\nStars showed out in their Halloween best at Heidi Klum's annual party.\n6 hrs ago\nCulture\nShe's a pop star, he's a former PM - why Katy Perry and Justin Trudeau just might work\nBoth the former Canadian prime minister and the California Girl singer have been through high and lows of public opinion. \n3 hrs ago\nUS & Canada\nNarrow Dodgers win sets up World Series decider\nThe Los Angeles Dodgers bounce back to beat the Toronto Blue Jays 3-1 and set up a deciding seventh game in the World Series after tying the series at 3-3.\n7 hrs ago\nBaseball\nWhy Sarah Ferguson, Beatrice and Eugenie can't escape the taint of family scandal\nThe scandal engulfing Andrew is of his own making but has had a profound impact on his immediate family.\n2 hrs ago\nUK\n'We need food, we have no food' - desperation takes hold in Jamaica after hurricane\nPeople in Black River have not seen any aid, telling the BBC that they are fighting to survive.\n9 hrs ago\nWorld\nSamia wins Tanzania election as hundreds feared dead in unrest\nDemonstrations continued on Friday as young protesters denounced the election as unfair. \n1 hr ago\nAfrica\nCruise cancelled following death of woman left behind on island\nThe Coral Adventurer was just two days into a 60-day voyage at the time of Suzanne Rees' death.\n6 hrs ago\nAustralia\nHalloween 2025: All the celebrity costumes at Heidi Klum's party\nStars showed out in their Halloween best at Heidi Klum's annual party.\n6 hrs ago\nCulture\nEgypt's Grand Museum opens, displaying Tutankhamun tomb in full for first time\nChina to loosen chip export ban to Europe after Netherlands row\nMore than 60,000 flee Sudanese city after its capture by RSF militia, says UN\nTchéky Karyo, star of Nikita and The Missing, dies at 72\nDutch centrist Rob Jetten claims victory in neck-and-neck election race\nAndrew stripped of 'prince' title\nThe King is expected to fund Andrew's move - but where does he get his money?\nThe language of Buckingham Palace's statement is \"very brutal\", royal historian Kelly Swaby tells the BBC.\nHow will Andrew's titles be removed and what happens next?\nThe language of Buckingham Palace's statement is \"very brutal\", royal historian Kelly Swaby tells the BBC.\nThe houses on the sprawling Sandringham Estate that could become Andrew's next home\nThe sprawling Norfolk estate is home to several properties - here is a look at where Andrew might be moving in.\nIs this finally rock bottom for Mr Andrew Mountbatten Windsor?\nStripping Andrew of the title 'prince' is colossal, says the BBC's royal correspondent Sean Coughlan.\nMore to explore\nHand of Moscow? The men jailed for vandalism in French hybrid warfare case\nThree Bulgarians are jailed for painting red hands on France's Holocaust Memorial in a suspected case of Russian \"destabilisation\".\n11 hrs ago\nEurope\n'I was accused of spying and beaten' - a boy's escape from captured Sudan city\nA 12-year-old tells the BBC that in the chaos he lost contact with his family and is now on his own at a camp.\n10 hrs ago\nAfrica\nRussia's new nuclear weapons - real threat or Putin bluster?\nThis week alone, the Russian president unveiled two nuclear-capable weapons - but their value may be more symbolic than military.\n1 day ago\nEurope\nAt 21, I was crushed by a stranger's joke about going bald. Then the way I looked at myself changed\nThere are multiple ways for men to combat hair loss now, but should they have to? \n10 hrs ago\nHealth\nThe American adoptees who fear deportation to a country they can't remember\nThousands of US adoptees do not have citizenship despite being brought to the country as babies decades ago. Now many fear deportation.\n1 day ago\nUS & Canada\n'I was accused of spying and beaten' - a boy's escape from captured Sudan city\nA 12-year-old tells the BBC that in the chaos he lost contact with his family and is now on his own at a camp.\n10 hrs ago\nAfrica\nShe's a pop star, he's a former PM - why Katy Perry and Justin Trudeau just might work\nBoth the former Canadian prime minister and the California Girl singer have been through high and lows of public opinion. \n3 hrs ago\nUS & Canada\nWhy the Indian passport is falling in global ranking\nIndians can travel to more visa-free destinations than a decade ago, but India's passport ranking has declined.\n10 hrs ago\nAsia\nRussia's new nuclear weapons - real threat or Putin bluster?\nThis week alone, the Russian president unveiled two nuclear-capable weapons - but their value may be more symbolic than military.\n1 day ago\nEurope\nMost watched\n1\n'No inch here was spared': Hurricane Melissa destroys Jamaica town\n2\nWatch: Heidi Klum slithers into Halloween as Medusa\n3\nPeople at Sandringham react to Andrew's move there\n4\nWatch: Train smashes into truck at Dutch level crossing\n5\nWatch: Pet monkey gets loose inside US Halloween store\nAlso in news\nUS judge blocks Trump administration from halting food benefits\nA federal judge said the plan to suspend Snap food aid to millions of Americans during the ongoing US government shutdown is likely unlawful.\n15 hrs ago\nUS & Canada\nPolice seize €1.3bn from Campari owner over alleged tax evasion\nThe spirit manufacturer's parent firm is accused of failing to declare a similar amount in tax during a merger.\n1 hr ago\nEurope\nHow two brothers helped propel grime into the mainstream\nThey changed the face of British music when they formed the label after their rap crew disbanded.\n9 hrs ago\nLondon\nMeet the 'silver influencers' taking TikTok and Instagram by storm\nOlder women are carving out a niche online for people who want authentic content.\n4 hrs ago\nWales\nFrance hit by second major heist as thieves target gold refinery\nThieves used explosives to break into a precious metals refinery before making off with a €12m loot. \n14 hrs ago\nEurope\nPolice seize €1.3bn from Campari owner over alleged tax evasion\nThe spirit manufacturer's parent firm is accused of failing to declare a similar amount in tax during a merger.\n1 hr ago\nEurope\nNumber of Irish citizens deported from US rises by more than 50%\nNew figures show more Irish citizens are being deported from the US, amid a crackdown by immigration officials. \n5 hrs ago\nUS & Canada\nTurkish football officials suspended in betting probe\nThe Turkish Football Federation (TFF) suspends 149 referees and assistant referees for allegedly betting on matches.\n4 hrs ago\nEuropean Football\nHow two brothers helped propel grime into the mainstream\nThey changed the face of British music when they formed the label after their rap crew disbanded.\n9 hrs ago\nLondon\nMost read\n1\nShe's a pop star, he's a former PM - why Katy Perry and Justin Trudeau just might work\n2\nHalloween 2025: All the celebrity costumes at Heidi Klum's party\n3\nCruise cancelled following death of woman left behind on island\n4\nWhy Sarah Ferguson, Beatrice and Eugenie can't escape the taint of family scandal\n5\nAndrew should answer Epstein questions in US, Democrats say\n6\nNumber of Irish citizens deported from US rises by more than 50%\n7\nEgypt's Grand Museum opens, displaying Tutankhamun tomb in full for first time\n8\n'We need food, we have no food' - desperation takes hold in Jamaica after hurricane\n9\nFourteen police officers among 20 arrested in Mississippi drug bribery sting\n10\nSamia wins Tanzania election as hundreds feared dead in unrest\nSport\nBatting costs England again as NZ seal 3-0 sweep\nNew Zealand seal a 3-0 series sweep by edging to a two-wicket win in the third one-day international in Wellington, following another England top-order collapse.\n2 hrs ago\nCricket\nNarrow Dodgers win sets up World Series decider\nThe Los Angeles Dodgers bounce back to beat the Toronto Blue Jays 3-1 and set up a deciding seventh game in the World Series after tying the series at 3-3.\n7 hrs ago\nBaseball\n'From black and white football to full colour' - Emery's three years at Villa\nAs Unai Emery marks three years at Aston Villa, Guillem Balague looks at his journey to Villa Park and his bid to \"awaken the giant\".\n4 hrs ago\nAston Villa\nHead coach Vieira leaves bottom club Genoa\nPatrick Vieira leaves his role as Genoa head coach by mutual consent after they fail to win in nine Serie A games this season.\n26 mins ago\nFootball\nIreland and All Blacks primed for Chicago reunion\nIreland and New Zealand are poised for their highly anticipated Soldier Field sequel, nine years on from a historic Irish win at the Chicago venue.\n5 hrs ago\nIreland\nNarrow Dodgers win sets up World Series decider\nThe Los Angeles Dodgers bounce back to beat the Toronto Blue Jays 3-1 and set up a deciding seventh game in the World Series after tying the series at 3-3.\n7 hrs ago\nBaseball\n149 Turkish officials suspended in betting probe\nThe Turkish Football Federation (TFF) suspends 149 referees and assistant referees for allegedly betting on matches.\n4 hrs ago\nEuropean Football\nPickford on England records, World Cup dream & love of motocross\nJordan Pickford sits down with Kelly Somers to discuss life at Everton, keeping clean sheets for England, a World Cup dream and a love of motocross.\n5 hrs ago\nPremier League\n'From black and white football to full colour' - Emery's three years at Villa\nAs Unai Emery marks three years at Aston Villa, Guillem Balague looks at his journey to Villa Park and his bid to \"awaken the giant\".\n4 hrs ago\nAston Villa",
    "keywords": null
  },
  {
    "url": "https://www.reuters.com/world/",
    "domain": "www.reuters.com",
    "publish_date": "2025-11-01T11:11:18.753Z",
    "language": "en",
    "title": "World News | Latest Top Stories | Reuters",
    "description": "Follow the latest international and world news, breaking stories and global current events from your trusted online news source.",
    "text": "World News | Latest Top Stories\nMisleading The ad contains deceptive or false claims. \nOffensive The ad includes hateful, violent, or discriminatory content. \nAdult Content Sexually explicit or age-inappropriate material. \nUnwanted Product or Service Spammy or irrelevant content. \nSecurity Concern The ad appears unsafe, malicious, or a scam. \nOther Something else not listed above.",
    "keywords": ""
  },
  {
    "url": "https://www.bbc.com/news/articles/cwy5lzq94gqo",
    "domain": "www.bbc.com",
    "publish_date": "2021-06-23T23:42:16.000Z",
    "language": "en-GB",
    "title": "Royal finances: Where does the King get his money?",
    "description": "The language of Buckingham Palace's statement is \"very brutal\", royal historian Kelly Swaby tells the BBC.",
    "text": "Where does the King get his money?\nGetty Images\nAndrew Mountbatten Windsor is expected to be dependent on his brother, King Charles III, for his home and money after being stripped of his \"prince\" title and asked to leave his mansion.\nThe King is understood to be funding Andrew's new accommodation himself and to be making \"appropriate private provision\" as he moves from Royal Lodge.\nThe Royal Family receives tens of millions of pounds each year from the Sovereign Grant and uses it to cover the cost of official duties, but this is not the King's only source of income.\nHow much public money does the Royal Family get?\nA report by the House of Commons Library said much of the increase had been driven by the Buckingham Palace project.\nA Palace spokesperson said: \"It has always been anticipated that the level of the Sovereign Grant will drop once the project is completed.\" \nHow is the Sovereign Grant worked out?\nProfits of the Crown Estate - a property business owned by the monarch but run independently - go to the Treasury. \nThe level of profit is used to calculate the funding given by the government to the Royal Family.\nThe Crown Estate had assets worth £15bn in 2023-24, with billions of pounds worth of properties in London, including Regent Street, as well as nearly half the land along the coast of England, Wales and Northern Ireland.\nThe estate is not the King's private property - it merely belongs to the monarch for the duration of their reign. The King cannot sell its assets or keep any profits for himself.\nThe Sovereign Grant was initially worth 15% of the Crown Estate profits generated two years previously. That increased to 25% in 2017-18, to help pay for the Buckingham Palace repairs, before reducing to 12% since 2024-25.\nHowever, soaring profits from the Crown Estate due to six new offshore wind farms still led to the £45m increase in the Sovereign Grant in 2025-26.\nUnder the Sovereign Grant Act 2011, if the Crown Estate's profits fall, the monarch still receives the same amount as the previous year, with the government making up the difference.\nThe UK government said that over the last 10 years, the revenue received from the Crown Estate was £5bn, which was used for public spending.\nWhat is the Sovereign Grant spent on?\nThe King and other working members of the Royal Family use the money to pay for expenses related to their official duties.\nThe vast majority is spent on the upkeep of properties and staffing, but it also covers costs such as travel to royal engagements.\nMembers of the Royal Family carried out 1,900 engagements across the UK and abroad during 2024-25.\nMore than 93,000 guests attended 828 events at official Royal palaces, including receptions, award investitures and garden parties.\nWhat does the King do?\nWhy did Harry and Meghan leave the Royal Family?\nHow else does the Royal Family receive money?\nThe King also receives money from a private estate called the Duchy of Lancaster, which is passed down from monarch to monarch.\nIt covers more than 18,000 hectares of land in areas such as Lancashire and Yorkshire, as well as property in central London. \nAt the end of March 2025, it was worth £679m and had made £24.4m in annual profits.\nWhoever holds the title of Duke of Cornwall (currently the Prince of Wales) benefits from the Duchy of Cornwall.\nIt mainly covers land in south-west England. In the year to the end of March 2025 it had assets worth £1.1bn and had made annual profits of £22.9m.\nThe King and Prince William receive the profits from the duchies personally, and can spend them as they wish. However, they are not entitled to any proceeds from the sale of any estate assets, which must be reinvested.\nGetty Images\nAndrew will be relocated to a property on the Sandringham estate in Norfolk\nThe monarch also owns the royal palaces (which are not part of the Crown Estate) and part of the Royal Collection of art, but these do not generate income.\nSome palaces are looked after and funded by the Royal Family itself. Others - such as the Tower of London - are managed by Historic Royal Palaces, an independent charity.\nThe King also privately owns properties such as Balmoral and Sandringham.\nIt is understood Andrew will be relocated to the Sandringham estate in Norfolk, which covers approximately 8,100 hectares.\nIn addition, some Royal Family members have private art, jewellery and stamp collections which they can sell or use to generate income as they wish.\nDo members of the Royal Family pay tax?\nIn 1992, Elizabeth II volunteered to pay income tax and capital gains tax on her personal income, and the King does the same.\nThe two duchies are exempt from corporation tax, but the King and Prince William voluntarily pay income tax on the revenue they generate. However, the amount of tax they pay is not made public.\nThey do not pay capital gains tax because they do not benefit personally from any increase in the duchies' assets.\nMembers of the Royal Family pay tax on any income generated from privately-owned assets.\nKing Charles does not have to pay inheritance tax on the money he received when the late queen died, under the \"sovereign to sovereign\" exemption agreed in 1993 by then Prime Minister John Major.\nGetty Images\nWhat about security and other costs?\nThe Sovereign Grant does not cover the Royal Family's security arrangements, which are usually paid for by the Metropolitan Police, although the cost is not disclosed.\nSome major events are also not included. The late queen's funeral in 2022 cost the government an estimated £162m.\nThe Coronation of the King cost taxpayers £72m, including £22m for policing.\nRepublic, a group campaigning for an elected head of state, has argued that factors such as security need to be included in the cost of the Royal Family.\nThe group claims that the total cost of the monarchy is about £510m per year.",
    "keywords": null
  },
  {
    "url": "https://www.bbc.com/news/articles/c5ylk9r336zo",
    "domain": "www.bbc.com",
    "publish_date": "2025-10-30T21:20:33.965Z",
    "language": "en-GB",
    "title": "What we know about Prince Andrew losing his titles and Royal Lodge",
    "description": "The language of Buckingham Palace's statement is \"very brutal\", royal historian Kelly Swaby tells the BBC.",
    "text": "What we know about Prince Andrew losing his titles and Royal Lodge\nHow will Andrew's titles be removed and what happens next?\nPA Media\nPrince Andrew has been stripped of his \"prince\" title and will leave his Windsor mansion, Royal Lodge, Buckingham Palace has announced. \nThe King has \"initiated a formal process\" to remove his titles, it said, and Andrew will now be known as Andrew Mountbatten Windsor. \nAndrew, 65 - the King's younger brother - has continued to face more questions about his private life in recent months.\nHis links to paedophile financier Jeffrey Epstein have caused problems for the Royal Family. The prince, who relinquished his titles this month, has always strongly denied any wrongdoing.\nThe dramatic fall from grace affects not just him but his ex-wife Sarah Ferguson and their children, Beatrice and Eugenie. \nWhat did Buckingham Palace say?\n\"His Majesty has today initiated a formal process to remove the Style, Titles and Honours of Prince Andrew,\" Buckingham Palace said in a statement on Thursday evening.\n\"Prince Andrew will now be known as Andrew Mountbatten Windsor.\"\nIt also addressed the place where he lives, Royal Lodge.\n\"His lease on Royal Lodge has, to date, provided him with legal protection to continue in residence. \n\"Formal notice has now been served to surrender the lease and he will move to alternative private accommodation. These censures are deemed necessary, notwithstanding the fact that he continues to deny the allegations against him.\n\"Their Majesties wish to make clear that their thoughts and utmost sympathies have been, and will remain with, the victims and survivors of any and all forms of abuse.\"\nReuters\nAndrew is understood not to have objected to the King's decision to remove his titles\nThe language of Buckingham Palace's statement was \"very brutal,\" royal historian Kelly Swaby told the BBC.\n\"Ordinary people don't care about the semantics, they want to see punishment, and public opinion is very much against Andrew, the Palace knows that, and the language very much reflects that\".\nThe decision was made, and action taken, due to serious lapses in Andrew's judgement, it is understood. \nIt is also understood that the wider Royal Family and the government was consulted, and made clear it supports the decision.\nThe BBC's former royal correspondent Jennie Bond said she thought the Prince of Wales had pushed for the recent action.\n\"I think this line had to be drawn and William was probably pushing for the King to do so,\" she said.\n\"William is about to go to Brazil on a very important tour - and the recent tour by the King and Queen to the Vatican was very nearly overshadowed by what was going on with Andrew, and that could not be allowed to continue.\"\nReuters\nThe BBC's former royal correspondent suggests Prince William urged his father to take action against Andrew\nWhere will he live?\nGetty Images\nAndrew will be relocated to a property on the Sandringham estate in Norfolk\nIt is understood Andrew will be relocated to the Sandringham estate in Norfolk, but details about his specific housing have not been released. \nThe wider Sandringham estate covers approximately 20,000 acres (8,100 hectares) with 600 acres (242 hectares) of gardens - and the Palace has not said which property he will stay in.\nIt is understood that Andrew is unlikely to move into Sandringham's Wood Farm, his late father's former home.\nFormal notice was given to surrender the lease at the Royal Lodge on Thursday and it is understood that Andrew's move to Sandringham will take place \"as soon as practicable\".\nWhere might Andrew live on the Sandringham estate?\nWhat will happen to Sarah Ferguson, Beatrice and Eugenie?\nGetty Images\nAndrew's ex-wife Sarah Ferguson, 66, will also move out of Royal Lodge and make her own living arrangements, it is understood.\nShe lost her courtesy royal divorcee title as a duchess in early October, when Andrew lost the use of his Duke of York title - reverting to her maiden name.\nThough the public had long referred to her as \"Fergie\", royal commentator Richard Palmer told the BBC at the time the title change would \"no doubt\" have an impact.\n\"She will have lost a bit of cachet over this,\" he said. \"She certainly does use the title.\"\nFor their daughters - Beatrice, 37 and Eugenie, 35 - there is no formal change.\nThey will still be princesses because they are the daughters of the son of a sovereign - in line with King George V's Letters Patent of 1917.\nTheir places in the line of succession will also stay the same.\nAndrew remains eighth in line to the throne despite losing his titles - followed by Beatrice and Eugenie in ninth and twelfth place.\nBut their positions in the family are \"low down\" and will likely slip further with time, royal commentator Victoria Murphy said previously - adding that she could not see them, as non-working royals, step into official duties any time soon.\nThere was an \"appreciation of the fact that this scandal doesn't involve them,\" she also said, \"and it's not fair for it to impact them directly in the independent lives they are carving out for themselves\".\nWhy Sarah Ferguson, Beatrice and Eugenie can't escape the taint of family scandal\nWill he get money from the King? \nReuters\nIt is understood Andrew's accommodation will be privately funded by the King.\nAnd the King will make \"appropriate private provision\" for his brother as he moves out of his home.\nRoyal sources have previously said the King has tried to apply pressure, and last year cut off Andrew's funding.\nAndrew also cultivated his own independent sources of funding since leaving public life, including business connections with China, the Gulf States and a recently curtailed project with a Dutch start-up company.\nEarlier this week, Parliament's spending watchdog, the Public Accounts Committee wrote a letter detailing the \"considerable and understandable public interest in the spending of public money\" relating to Andrew. \nThe letter asked what the Crown Estate's plan was to ensure value for money in any future agreements with Andrew. \nWhere does the King get his money?\nHow will Andrew's titles be removed? \nAndrew is understood not to have objected to the King's decision to remove his titles.\nHis birth certificate does not need to be changed and the title change will not apply retrospectively.\nThe titles being stripped are: Prince, Duke of York, Earl of Inverness, Baron Killyleagh. And he will no longer have the right to be called His Royal Highness. The honours of Order of the Garter and Knight Grand Cross of the Victorian Order will also be removed.\nTo remove the titles, the King will send Royal warrants to the Lord Chancellor - who is David Lammy - to officially remove them.\nIt comes just weeks after Andrew voluntarily gave up his other royal titles, including the Duke of York.\nOn 17 October, Andrew said he would stop using the titles because the \"continued accusations about me distract from the work of His Majesty and the Royal Family\". \"I vigorously deny the accusations against me,\" he said.\nUntil this month, Ferguson kept the title Sarah, Duchess of York - but she reverted to her maiden name of Ferguson after Andrew was stripped of his Duke of York title.\nWhere does the name Mountbatten Windsor come from?\nThe surname Mountbatten Windsor was created in 1960, and combines the surnames of the late Queen Elizabeth II and Prince Philip when they married.\nIn 1917, fearful of the anti-German sentiment in the UK the reigning monarch, George V, adopted the name Windsor to replace the original Germanic sounding house of Saxe-Coburg and Gotha dynasty.\nHe renamed the lineage Windsor, after the castle. \nMountbatten is an anglicised version of Battenberg. The Duke of Edinburgh's mother was Princess Alice of Battenberg, but during the First World War the family opted to change it to Mountbatten, again to avoid more anti-German sentiment. \nThe double-barrelled name was a concession to the Duke of Edinburgh, who was said to have complained that his children would not bear his name.\nCould Andrew face further investigation?\nAndrew is already not invited to attend royal public events, and his recent appearances have been limited to private, family events, such as funerals or memorials.\nThis fiasco will continue to dog the Royal Family, says historian and author Andrew Lownie.\n\"They're finally getting ahead of the story, but this isn't the end of it,\" Lownie told the BBC.\nThe Palace is \"finally taking some decisive action\" - but it \"won't completely satisfy the public disquiet\".\nCampaigners against the monarchy say there should be a wider investigation into what the Royal Family might have known about Prince Andrew's links to Epstein.\nThe Metropolitan Police has said it is \"actively\" looking into media reports that then Prince Andrew tried to obtain personal information about his accuser Virginia Giuffre through his police protection.\nAndrew has always denied any wrongdoing and has not faced any charges, but large sections of the media will continue digging into the case.\nWhat led up to this? \nWatch: The events leading up to tonight's statement\nAndrew's links to convicted sex offender Jeffrey Epstein are at the centre of this latest announcement. \nIn recent weeks, pressure has increased on the monarchy to resolve the issue of Charles's brother, with the King heckled earlier this week by a protester.\nAlthough Andrew denies the accusations, the Royal Family considers there have been \"serious lapses of judgement\" in his behaviour. \nEarlier this month, emails from 2011 re-emerged, showing Andrew in contact with sex offender Jeffrey Epstein months after he claimed their friendship ended. \nIn her posthumous memoir, Nobody's Girl Virginia Giuffre repeated allegations that, as a teenager, she was forced to have sex with Andrew on three separate occasions – claims he has always denied. \n1999/2000\nMs Giuffre starts working at the spa in Donald Trump’s Mar-a-Lago resort in Florida\nSummer 2000\nUnder the guise of training to be a massage therapist, Ghislaine Maxwell takes the 16-year-old Ms Giuffre to meet Jeffrey Epstein at his home near the resort, where she says she was raped\n2000\nStill 16, Ms Giuffre leaves Mar-a-Lago under pressure from Epstein, who hires her as a massage therapist. He allegedly subjects her to regular abuse and trafficks her to other men\nMarch 2001\nEpstein and Maxwell take Ms Giuffre to London to meet Andrew. Ms Giuffre later says Maxwell pressures her into sex with the prince. Andrew has always denied the claims\n2001 – 2002\nMs Giuffre is forced to have sex with Andrew two more times, she later claims, at Epstein’s New York mansion and private Caribbean island, allegations the prince again denies\nFebruary 2011\nThe Mail on Sunday publishes a photo of Ms Giuffre’s first meeting with Andrew. He later says he has no recollection of it being taken\nDecember 2014\nIn a Florida court filing, Ms Giuffre describes being trafficked by Epstein to Andrew and forced to have sex with him and other men. The judge later throws the claims out as “immaterial and impertinent” to the case against Epstein\nNovember 2019\nAndrew denies having sexual contact with Ms Giuffre in a now-infamous interview on BBC Newsnight\n9 August 2021\nMs Giuffre files a civil lawsuit in New York accusing Andrew of sexual abuse when she was 16 and 17\n8 March 2022\nAndrew pays a financial settlement to Ms Giuffre to end the civil court case, denying any wrongdoing\n25 April 2025\nMs Giuffre dies by suicide in Neergabby, Western Australia\nOctober 2025\nMs Giuffre’s memoir details her experiences with Epstein, Maxwell, and the then-Prince Andrew, who is subsequently stripped of his titles and privileges to become Andrew Mountbatten Windsor",
    "keywords": null
  },
  {
    "url": "https://www.bbc.com/news/articles/c201zvrpvw9o",
    "domain": "www.bbc.com",
    "publish_date": "2025-10-31T11:39:38.454Z",
    "language": "en-GB",
    "title": "Where might Andrew live on the Sandringham estate?",
    "description": "The sprawling Norfolk estate is home to several properties - here is a look at where Andrew might be moving in.",
    "text": "Where might Andrew live on the Sandringham estate?\nGetty Images, York Cottage, Alamy, Oliver's Travels\nAnmer Hall, York Cottage, Park House and Gardens House are all on the estate - but not all of them are available \nNewly stripped of his \"prince\" title, Andrew is moving from his Windsor mansion, Royal Lodge, to the Sandringham estate in Norfolk, it is understood.\nFormal notice was given to surrender the lease at the Royal Lodge on Thursday, and the move will take place as soon as possible.\nThe historic, sprawling estate spans approximately 31 sq miles (80 sq km) of gardens - making it around the same size as Nottingham or Brighton and Hove.\nIt was bought as a private country retreat for the future Edward VII when he was Albert, Prince of Wales in 1862, and has since been passed down from monarch to monarch.\nThe estate itself covers several residential villages and hamlets, and includes 15 sq miles (40 sq km) of farmland.\nThe main building - Sandringham House - is thought to have more than a hundred rooms, including a ballroom.\nIt remains a country retreat for the Royal Family and is where they traditionally gather at Christmas.\nAndrew will be moving some 140 miles (225km) north-east of his Windsor mansion - and away from senior royals like King Charles III and Queen Camilla, who reside in London, and the Prince and Princess of Wales in Windsor.\nSome assumed Andrew would move from Royal Lodge to another property on the Windsor estate, Frogmore Cottage for example, royal biographer Robert Hardman told the BBC.\n\"But no,\" he said, \"he's off the estate, he's out of Windsor, he's out of royal Berkshire - he's been sent up the M11 to the royal equivalent of Siberia to sit in Sandringham for the rest of his life.\"\n\"This is - some might say brutal, others might say definitive.\"\nSandringham is a private estate - not an official royal residence - and it is understood the King will be privately funding Andrew's accommodation there, and that it will not be directly funded by the taxpayer.\nThe Palace has not yet said exactly where on the estate Andrew will live, or when he could move.\nBut royal sources have said it will not be immediate, and instead be \"as soon as possible and practicable\". \nHere is a look at some of the options on the estate.\nYork Cottage\nAlamy\nOriginally known as Bachelor's Cottage, York Cottage is about a quarter of a mile from the main house.\nIt has its own set of stables and kennel buildings, according to Historic England, and overlooks one of two man-made lakes on the estate.\nThere were reports ahead of Prince Harry's marriage to the Duchess of Sussex that the pair might have been gifted the use of York Cottage by Elizabeth II for use as a country home, but no such plan was ever confirmed and the move never materialised.\nIt has reportedly been used as an office and accommodation for staff in recent years.\nEverything we know about Andrew losing titles and Windsor mansion\nVirginia Giuffre's family speak to BBC: \"She'd be so proud\nWhere does the King get his money?\nPark House\nBrendan Beirne/Shutterstock\nThe birthplace of Diana, Princess of Wales and her childhood home, Park House was rented by the Spencer family for many years.\nIn 1983 it was gifted to Leonard Cheshire, a disability charity, which used it to run a 16-bedroom hotel for the disabled, their carers and family.\nThe charity planned a £2.3m refurbishment before the pandemic hit, but announced in 2020 it would not go ahead with the proposal and said instead that it was working with the Sandringham estate to exit the lease.\nGardens House\nOliver's Travels\nGardens House was put on the market as a holiday let over the summer\nAnother option is the Gardens House, which was once the residence of the head gardener on the Sandringham estate.\nThe Edwardian house has six bedrooms and three bathrooms, is dog-friendly and is one of two properties on the estate available to the general public as a holiday let.\nIts grounds hold a working sawmill and organic farm.\nIt was put on the market in July at a weekly price of £4,110. It is not unusual for royal residences to rent out property to holidaymakers - with eight cottages and lodges available for hire at Balmoral Castle in Scotland.\nThe Folly\nAnother possibility is The Folly - a three-bedroom, two-bathroom lodge built in the 1800s.\nComplete with a turret and a wraparound balcony, it has been used as a hunting lodge and a place to take afternoon tea.\nAlso listed as a holiday let to the public, it is said to have room for six guests - a change from the 30-room Windsor mansion Andrew will be vacating.\nGiven the lodge's \"grandeur\", Majesty Magazine's managing editor Joe Little told the BBC earlier this year, there is a \"a heightened awareness that the privately owned royal estates are actively striving to bolster\" the Royal Family's revenue streams.\nWood Farm\nShutterstock\nThis is one option that is understood to have been ruled out.\nThe farmhouse, described as \"small and intimate\" by former housekeeper Teresa Thompson, has strong associations with Andrew's parents.\nHis father, the late Duke of Edinburgh, chose the secluded property as his permanent home when he retired from public life in 2017.\nHe and the late Queen already regularly stayed there in preference to opening up Sandringham House when it was just the two of them.\nAnmer Hall\nGetty Images\nAnmer Hall was gifted to the Prince of Wales and Catherine, Princess of Wales as a wedding present by the late queen in 2013 - so this may be an unlikely choice.\nThey spend much of the school holidays in the 10-bedroom, Grade II*-listed house, which is about 2 miles (3km) east of the main Sandringham house.\nThe Georgian property dates back to about 1802, but some parts are much older - and it has formed part of the Sandringham estate since 1898.",
    "keywords": null
  },
  {
    "url": "https://www.bbc.com/news/articles/c62elnjnqqxo",
    "domain": "www.bbc.com",
    "publish_date": "2025-10-30T23:10:01.706Z",
    "language": "en-GB",
    "title": "Is this finally rock bottom for Mr Andrew Mountbatten Windsor?",
    "description": "Stripping Andrew of the title 'prince' is colossal, says the BBC's royal correspondent Sean Coughlan.",
    "text": "Is this finally rock bottom for Mr Andrew Mountbatten Windsor?\nSean CoughlanRoyal correspondent\nAFP via Getty Images\nAfter weeks, months, years and even decades of scandals, all the titles and privileges of the former Prince Andrew have been completely removed. \nThere are no modern precedents for such a colossal loss of royal status.\nUnlike the previous statement on his future, this was from Buckingham Palace rather than Andrew himself. \nIt's a ripping off the bandage moment, which the Palace will hope will finally draw a line under the endless oil slick of bad news stories about Andrew.\nFollow live updates on this story\nThe sliver of dignity given to him, that he was voluntarily choosing not to use his titles, has been taken away.\nTitles such as Duke of York, the Earl of Inverness and Baron Killyleagh will be forcibly removed.\nAll that remains is his place in the line of succession, and new guidance from the House of Commons Library has shown that too could be removed by Parliament, if Commonwealth realms give their consent.\nAfter more than a year of pressure, the so-called Siege of Royal Lodge is over, with Andrew losing his independent lease and moving to the King's estate in Sandringham. It's not revealed where exactly, but it's not Wood Farm.\nSandringham is privately owned by the King, ending any reliance on a Crown Estate property.\nHis ex-wife Sarah Ferguson is said to be making her own separate arrangements, not currently expected to be with Andrew in Norfolk.\nIt makes Andrew dependent on the King for his home and his money. And also it has to be said, a duty of care for his brother's welfare.\nThis announcement might head off the immediate threat of Parliament taking matters into its own hands and voting to strip Andrew of his titles. MPs had become increasingly vocal about debating the scandal and the Public Accounts Committee had been flexing its muscles over protecting public funding.\nBut it's going to be much harder for the Palace to settle an authentic feeling of public outrage. The sense of unchecked privilege surrounding Andrew has genuinely irritated the public and it will take more than taking away his titles to dispel the sense of ugly entitlement.\nPolling by YouGov published on Thursday showed Andrew now has the worst ever popularity ratings for a royal, with 91% holding a negative view of him.\nAnd the King heard that unhappiness first hand from a heckler in Lichfield this week, who shouted: \"How long have you known about Andrew and Epstein?\"\nWatch: Moment King gets heckled about Prince Andrew\nFor the Palace, there will be questions about why such longstanding problems around Andrew weren't dealt with before now. So much of this has been known for so many years - the unsuitable business links, the unexplained funding, the connections with sex offender Jeffrey Epstein. The cast list changes - alleged Chinese spies or dictators' wealthy relatives - but the story has remained the same.\nThe unsavoury link with Epstein was being widely discussed 14 years ago when Andrew was stripped of his role as trade representative.\nAndrew has been losing jobs but continuing to live in a royal style for many years now and it's stretched public patience. It felt arrogant and out of touch.\nA few clicks on Google will find decades of stories raising doubts about his suitability, often accompanied by pictures of Andrew in a top hat, like a renegade Monopoly piece.\nBBC Newsnight\nPrince Andrew pictured during his Newsnight interview in 2019\nThere might be some public fatigue around this Andrew story. People might feel they've heard enough and are sick of it. But there was also an angry public mood that expected a clearer sense of accountability.\nWhat remains to be seen now is whether a wider can of worms has been opened.\nWho knew what and when at the Palace about Andrew and Epstein? Do we need more transparency around royal property and finance? How many houses do they have up their sleeve in Windsor? And what fresh scandals about Andrew could still emerge?\nBut this scorched earth approach to Andrew's future might also show an unexpectedly steely side to the King. \nWhile other members of the Royal Family were part of the decision, including Prince William, it's understood that it was the King who made this big call on his brother's future. Whatever the grandstanding of pundits, it can't have been an easy decision.\nThere seemed to have been an irrevocable change of attitude when an email from Andrew to Epstein emerged, showing their continued contact. It seemed to destroy Andrew's promises in the Newsnight interview to have cut ties.\nIt no longer seemed tenable that Andrew should have the honour of being a prince and living in some splendour among the royals in Windsor.\nInstead the King highlighted the victims of abuse, whose stories lie at the dark heart of Epstein's circle.\nIt's not long since Prince Andrew, the Duke of York, was grinning on the Buckingham Palace balcony, waving to the crowds. He'll wake up tomorrow morning for the first time in his life as Mr Mountbatten Windsor, private citizen.",
    "keywords": null
  },
  {
    "url": "https://www.bbc.com/news/articles/c891d43l8pyo",
    "domain": "www.bbc.com",
    "publish_date": "2025-11-01T00:36:56.941Z",
    "language": "en-GB",
    "title": "Hand of Moscow? The men jailed for vandalism in French hybrid warfare case",
    "description": "Three Bulgarians are jailed for painting red hands on France's Holocaust Memorial in a suspected case of Russian \"destabilisation\".",
    "text": "Hand of Moscow? The men jailed for vandalism in French hybrid warfare case\nAndrew HardingParis correspondent, Paris\nThis week's trial of three undercover operatives, accused of helping the Kremlin to wage a hybrid warfare campaign to \"destabilise\" France, sounds like a surefire recipe for drama, sophistication, and intrigue.\nIf only.\nOver the course of three days, in a spacious, pine-panelled courtroom on the northern edge of Paris, the case against three seemingly unremarkable Bulgarian men, seated behind glass and shadowed by three police officers who seemed absorbed with their own mobile phones, unfolded with all the panache and excitement of a half-whispered lecture in a library.\n\"I had absolutely no idea where we were.\"\n\"I did it for the money.\"\n\"In the future I plan to get involved in charity work.\"\nThese few lines from the men's testimony may help convey the general tone.\nAll three were jailed on Friday for two to four years.\nBut to bemoan the barely audible banality of it all – the dull motives, the mumbled attempts to shift blame, the sullen complaints about prison life and unsatisfactory psychiatric evaluations - is to miss the truth.\nThe banality is the whole point.\nLike the cheap drones that both Russia and Ukraine now use to patrol their front lines, the three men on trial in courtroom 2.01 at the Palais de Justice in Paris represent a low-budget evolution of modern hybrid warfare.\nImprovised and startlingly effective.\nRising in turn inside their glass cage, Georgi Filipov, Nikolay Ivanov and Kiril Milushev admitted carrying out the acts, but denied working for a foreign power as well as antisemitism.\nEarly one morning in May 2024, on the banks of the River Seine in the heart of Paris, the three men conspired to spray red paint - and filmed themselves doing so - on the Wall of the Righteous, a monument to those who saved French Jews from the Holocaust during World War Two. \nThirty-five red handprints were left on the Shoah memorial. Five hundred more were painted elsewhere.\nIt was the first in a series of symbolic attacks in France: pigs' heads placed outside mosques (an act blamed on a group of Serbians); coffins left ominously by the Eiffel Tower; Stars of David painted around the capital.\nNews of each event was swiftly broadcast around the world – not just by regular media outlets, but by the automated army of Russian social media trolls which, according to the French agency monitoring such activity, routinely seeks to weaponise each sliver of news that might raise doubts about the stability of French society, and the strength of Europe's democracies, its institutions, and its values.\nFrance is seen as a particularly tempting target for the Kremlin, given its current political and social divisions, its often ambiguous attitude to Nato, its large Muslim and Jewish populations, the increasing popularity of the far right, and a history of close ties to Moscow on both extremes of the political spectrum.\nIn another era, the Kremlin might have used its own deep undercover agents to carry out acts of sabotage or vandalism. \nBut – to make the drone warfare comparison again – why rely solely on valuable assets like highly trained spies, giant ballistic missiles, or submarines used to cut undersea cables, when for a few thousand euros you can, through discreet and easily deniable channels, recruit your own disaffected army of petty criminals, or unemployed wannabe fascists?\n\"I had absolutely no idea where we were,\" said Georgi Filipov, as he tried to play down his alleged role in the \"red hands\" operation, arguing that he had travelled from Bulgaria simply to make a little money to help with child support payments for his nine-year-old son. \nHe was allegedly paid €1,000 (£875) plus travel expenses.\nIn the dock, Filipov, 36, cut a gaunt but muscular figure, twitching slightly like a boxer before a fight as he attempted to defuse awkward questions about his tattoos. In particular, the swastika on his chest and the social media photos showing him giving a Nazi salute and wearing a t-shirt that claimed Hitler \"was right\".\n\"I made bad choices in the past,\" Filipov explained, and pointed out that he had already removed several tattoos. \nThe Paris criminal court sentenced him to two years in jail.\nHaving been successfully extradited from Bulgaria and Croatia to face trial in France, the men all sought to place the blame on a fourth man, Mircho Angelov, who remains at large but is alleged to have links to a Russian intelligence officer. He was given a three-year term in absentia.\nThe second defendant, Kiril Milushev, 28, said he had only come to France because he had broken up with his partner, was struggling with a bipolar disorder, and wanted to keep his friend, Mircho, company. He was given two years.\nSeated beside Milushev, Nikolay Ivanov creased his forehead as he denied any links with Russia. \nHe spoke of his grandparents' role in saving Jews during World War Two and said his ambition now was to obtain a master's degree in law, and to be reunited with his girlfriend - if she'd still have him, when all this was over.\nConsidered the mastermind behind the plot, he was given the heaviest jail term of four years.\nAs for Russia's alleged role in the red-hands affair, even the defence lawyers openly admitted that \"we suspect\" Moscow's hand. \nBut they insisted, as did their clients, that they were unwitting pawns, proxies – one might even say \"drones\" – in a shadow war against the West.",
    "keywords": null
  },
  {
    "url": "https://www.bbc.com/news/articles/c993ygv9g25o",
    "domain": "www.bbc.com",
    "publish_date": "2025-11-01T00:52:35.386Z",
    "language": "en-GB",
    "title": "Hair transplants, finasteride and hair systems: Welcome to the world of hair restoration",
    "description": "There are multiple ways for men to combat hair loss now, but should they have to? ",
    "text": "Hair transplants, finasteride and hair systems: Welcome to the world of hair restoration\nAt 21, I was crushed by a stranger's joke about going bald. Then the way I looked at myself changed\nBBC\n​​I'm bald, and that bothered me for a long time. ​​\nIt bothered me that I was bothered. But just one swipe down my Instagram feed reveals I'm not the only man who is self-conscious about his hair.\nI'm greeted with videos and posts offering me hair transplants, regrowth tablets, thickening sprays, powders that fill gaps, and hair systems (once known as wigs or toupees).\nThese products promise to restore my \"lost confidence\" and stop my lack of hair from \"holding back\" my life.\nBut does the wealth of treatment options on offer mean attitudes towards hair loss have shifted? Is what was once viewed as something to be resigned to now seen as reversible, albeit at a cost?\nAccording to the International Society of Hair Restoration Surgery (ISHRS), hair transplants are becoming more common around the world - and the people having them are getting younger.\nThis global collective of surgeons, doctors and experts found 95% of its members' patients sought hair restoration surgery between the ages of 20 and 35 - and that's something hair-loss surgeon Dr Nilofer Farjo confirms is mirrored in the UK.\nWhen my hair first began to recede in my early 20s, I tried my best to cover it up, tactically styling and positioning it in a way that hid the new patches of scalp I hadn't seen before.\nThen, while out for my brother's stag do in a Liverpool nightclub, something happened that I haven't been able to forget since. \nI had suggested we wear white t-shirts and carry permanent markers so people we met could leave funny messages on our shirts.\n\"Best man? Best comb-over,\" one woman wrote.\nI laughed it off at the time, but inside, I was crushed. It was clear my hair loss was now noticeable to other people. And from then on, I became more and more self-conscious about my thinning hair. \nWhy did I think this was a good idea...?\nWhen I was younger, bald men were often the butt of jokes - but taking steps to regain lost hair seemed to be viewed as effeminate and vain. Still, I began to wonder if a hair transplant was my only option. Was that a possibility for someone like me? In my mind, they were only for rich people, and celebrities like Elton John.\nFast forward ten years, and social media and dating apps have made us all more aware of how we look, says Dr Farjo, and seeing celebrities and influencers being more open about hair transplants has normalised the procedure.\nShe says more and more young men are now choosing to treat their hair loss, and what might have once been deemed \"vanity\" is now considered \"routine self-care\".\nWhen I started considering having a hair transplant, I had just finished university, had little money, and no real idea how much the procedure might actually cost.\nI began to do some research and discovered a nearby transplant clinic offering free consultations and monthly payment plans.\n\"You're still quite young,\" I remember the hair transplant consultant telling me, as he drew on my scalp with a felt-tip pin. \"After this transplant, your hair could recede further. But you can just come and get it filled in.\"\nDespite the payment plan, I realised I couldn't afford a hair transplant - especially if I'd have to come and get a top-up later in life.\nSince my own consultation in Cardiff in 2014, I've heard about men travelling abroad in increasing numbers to countries like Turkey to have hair transplants. Dr Farjo says this is down to costs being \"a fraction\" of what they are in the UK.\nBut while the price may be attractive, she says there are concerns about industry practices, with limited regulations in place. Dr Farjo also warns that cheap, unregulated procedures, not only in Turkey, can sometimes lead to people needing \"costly corrective surgery\" to deal with scarring and \"poor hairline design\".\nBut hair transplants in Turkey remain popular and there are many happy customers - including content creator, Ben Placito.\nAfter jokey comments from his barber, Ben decided to consider having a hair transplant. And after months of research, he discovered it would be cheaper to have the procedure carried out in Turkey than in the UK.\nSome quotes from Turkish clinics were \"crazy cheap\", Ben says, offering surgery for around £1,500. But the 31-year-old chose not to go with the cheapest hair transplant on offer and instead selected a \"premium\" option.\nBen felt reassured about his chosen clinic after speaking to other men who had been there and had good experiences. Ben travelled to Turkey in 2022 to have the procedure, sharing his experience on his TikTok account.\n\"People have said to me 'it's the best thing you've done,'\" Ben says. \"I'm really happy I did it.\"\nBen Placito\nBen's hair before and after his transplant\nAbout a year after I gave up on the idea of surgery, I came across an advert for a clinic offering non-surgical treatments, like finasteride tablets and minoxidil cream, which can be used to stimulate hair growth.\nFinasteride is one of the most common pills for hair loss, taken by tens of thousands of men in the UK. It is only available by private prescription.\nIt works by preventing testosterone turning into another hormone called dihydrotestosterone (DHT) that can stop hair growing.\nMinoxidil, originally a blood pressure medication, has hair growth as a side effect and is commonly sold in the form of a daily cream applied directly to the hair and scalp.\nI paid several hundred pounds for a combined course of minoxidil and finasteride but the treatment requires consistent daily use, and I often forgot doses. Eventually, I realised I couldn't justify the cost - or trust myself to stick with it. Health concerns also weighed on me, something the clinic had made clear.\nAccording to a 2024 report by the Medicines and Healthcare products Regulatory Agency (MHRA), finasteride is linked to psychiatric issues like depression and suicidal thoughts, and can have side effects affecting sexual function.\nThe MHRA advises users to monitor symptoms and stop using the drug if adverse effects occur.\nMy experience was a decade ago, but the market for hair-loss medication has since exploded. Superdrug's private online doctor service says it has seen a 68% increase in new patients requesting hair-loss services in the last three months versus the equivalent period last year. \nThree methods men who aren't comfortable with hair loss might recognise\nHaving given up on medication, I relied on hats and carefully positioned sunglasses that would \"hide\" my receding hair. If I was taking a photo with family or friends, I'd position the camera so it cropped out the top of my head.\nThen in 2019, I began to see adverts for hair systems. These seamless-looking hair pieces are glued to a shaved scalp and blended with existing hair, with regular clinic visits for maintenance. This seemed like a side-effect-free, instant solution.\nBut I couldn't shake the thought of suddenly appearing at work or family events with a full head of hair - everyone knew I was balding. I also questioned the legitimacy of the adverts. Were the results real? Or just the result of clever lighting and angles?\nI had seen some people with systems telling their social media followers they could start peeling off in the middle of the day - and I dreaded that.\nHowever, for 36-year-old Adam Lomax, who has male pattern baldness and trichotillomania (a mental health disorder where you can't resist pulling out your own hair), a hair system was \"life changing\".\nAdam had already tried finasteride, which left him feeling anxious, depressed and low in libido.\n\"People have been really positive,\" Adam says of the reception to his new hair. \"The conversation around men's hair loss has shifted massively - but you still get the odd troll on TikTok.\"\nAdam Lomax\nAdam Lomax has been wearing a hair system for six years\nIt's clear there are plenty of options for men facing hair loss, but not every bald man sees losing their hair as something that needs to be fixed or prevented.\n\"The narrative around hair loss needs to change both socially and commercially,\" says Tariq Kazemi, co-founder and CEO of skincare company Bld Bro, a brand which began life as a support group for bald men.\nTariq recalls a colleague poking fun at his bald spot during a shopping trip, and describing that as \"like an ice pick to my heart\".\nTariq later shaved his head and noticed that jokes about his hair loss stopped. He chose not to pursue any form of hair restoration.\n\"Those industries prey on the fear and anxiety of young men,\" he says. \"We've been told it's our identity, our confidence and our attractiveness that will all disappear with the hair on our head.\"\nI remember this photo making me feel very insecure about they way I looked\nIn 2020, when the world went into coronavirus lockdown many people grew out their hair or attempted to cut it themselves.\nBy this time, the only remaining hair I had was around the back of my head and in a thin patch on the top of my forehead. I took the plunge and decided to shave my head. There was a freedom in skipping to the end stage of the balding process, and I've continued to shave my head ever since.\nThere's so much social media noise around hair loss, and money to be made from men's worries about it. But after speaking to different men about their hair loss experiences, it's clear there is no single right way to feel happy with your appearance. \nThe anxiety I felt while I was losing my hair has gradually ebbed away and I feel more accepting of the way I look. I've come to terms with my baldness now and I prefer to be bald than balding.",
    "keywords": null
  },
  {
    "url": "https://www.bbc.com/news/articles/cn40w7g2d2zo",
    "domain": "www.bbc.com",
    "publish_date": "2025-10-31T08:00:12.577Z",
    "language": "en-GB",
    "title": "Russia's new nuclear weapons - do they work or is it Putin bluster?",
    "description": "This week alone, the Russian president unveiled two nuclear-capable weapons - but their value may be more symbolic than military.",
    "text": "Russia's new nuclear weapons - do they work or is it Putin bluster?\nOn Wednesday, over tea and cakes with veterans of the Ukraine war, President Vladimir Putin announced Russia had tested a new weapon.\n\"There is nothing like this,\" the Russian leader said of the Poseidon - a nuclear-powered, nuclear-capable underwater drone that can be fired like a torpedo and which a senior Russian MP said could \"put entire states out of operation\". \nWhen it was first unveiled in 2018, Russian media said the Poseidon would be able to achieve a speed of 200km/h (120mph) and travel in a \"constantly changing route\" that would make it impossible to intercept.\nPutin's claim came only days after the announcement that Moscow had conducted a test of its \"unlimited-range\" Burevestnik nuclear-powered cruise missile. \nIt's \"a unique product, unmatched in the world\", Putin said of the Burevestnik, noting the missile was so new \"we are yet to identify what it is, what class of weapons [it] belongs to\".\nIt is not unusual for Russia to test and flaunt weapons.\nAnd, despite the boisterous nature of Russian announcements, their military value is ambiguous.\n\"They are basically Armageddon weapons - too powerful to be used unless you're happy to destroy the world,\" Mark Galeotti, a Russia scholar and long-time observer of Russian politics, told the BBC.\nBoth the Poseidon and the Burevestnik are second-strike, retaliatory weapons, Mr Galeotti added - and not even the most rabid Kremlin propagandists are suggesting anyone is preparing to launch strikes on Russia. \nIt is also unclear whether the weapons are actually viable. \nIn 2019, five Russian nuclear engineers died in a rocket engine explosion which some Russian and Western experts said was linked to the Burevestnik.\nTwo years later, the International Institute of Strategic Studies (IISS) - a London-based think tank specialising in global conflict and security - noted that Russia faced \"considerable technical challenges\" in ensuring \"the reliable performance of the nuclear-propulsion unit\" of the missile.\nNeither the Poseidon nor the Burevestnik were entirely novel - both had first been presented to the world in 2018 as part of a new array of weapons that Putin called \"invincible\".\nSo it is the timing of the announcements - rather than their contents - which could be noteworthy. \nAfter a whirlwind few months of tentative diplomacy by US President Donald Trump to try and bring Russia and Ukraine to the negotiating table, Trump appears to have cooled off on the endeavour to end the war. \nLast week, the White House cancelled a summit between Trump and Putin, apparently after US Secretary of State Marco Rubio realised the gulf between Moscow and Washington's positions was too great for a high-level meeting to achieve meaningful results.\nNot only is there no suggestion of any further talks, but soon after the meeting was cancelled, Trump imposed sanctions on two of Russia's biggest oil producers as punishment for Moscow's failure to agree on a peace deal in Ukraine.\nAnd while his relationship with Ukrainian President Volodymyr Zelensky seems to still be fraught, it appears Trump is growing irritated with Moscow's intractability.\nSo Putin may be vying for Trump's attention. \n\"In the face of Trump blowing hot and cold with his support for Ukraine or sympathy to Russia, here is an element in which Moscow has bigger cards than Kyiv,\" Mr Galeotti argued. \n\"So in that context [successful weapons tests] are more about keeping him thinking Russia is indeed powerful.\"\nAnother clue could come from the battlefield in Ukraine. \nThree-and-a-half years after Russia launched its full-scale invasion of its neighbour, its troops continue to merely grind on - at great cost in human life and resources - with no obvious breakthrough likely any time soon.\n\"We are getting towards the end of summer fighting season in Ukraine and it has not gone very well for the Russians,\" said David Heathcote, head of intelligence at McKenzie Intelligence Services.\nThe announcements about the Burevestnik and the Poseidon should be seen as a reflection of the weakness of their conventional forces, Mr Heathcote told the BBC. \nRussia is not formally part of any military alliances that would serve as a deterrent if it is on the back foot, and its army is tied up and under pressure in Ukraine. \nIn these cases, Mr Heathcote says, \"the Russians always react with unnecessary and overexaggerated sabre rattling\".\nWhile Moscow's decision to publicly announce the Burevestnik and Poseidon tests may have been influenced by this, it seems the claim has already had the tangible effect of provoking Trump into instructing its military to resume nuclear weapons testing.\nTrump justified the move as a way of keeping pace with other countries such as Russia and China. \n\"With others doing testing, I think it's appropriate that we do also,\" Trump said - although it will likely take several months for the US to restart nuclear tests after a 33-year pause.\nThe Kremlin's reaction to Trump's statement was quick\nPutin spokesman Dmitry Peskov questioned whether the US president had been correctly informed. The Russian tests \"cannot in any way be interpreted as a nuclear test\", Peskov said. \nTrump did not elaborate on the kind of tests he wanted the US to resume.\nIt was likely, said IISS Head of Strategy, Technology and Arms Control Dr Alexander Bollfrass, that Trump's decision was a direct response to the Russian test of the Burevestnik and that the US could be planning to conduct similar flight tests of US Intercontinental Ballistic Missiles.",
    "keywords": null
  },
  {
    "url": "https://www.bbc.com/news/articles/clyk1nq6v4lo",
    "domain": "www.bbc.com",
    "publish_date": "2025-11-01T01:02:54.391Z",
    "language": "en-GB",
    "title": "Sudan war: A boy's escape from el-Fasher amid accusations of spying",
    "description": "A 12-year-old tells the BBC that in the chaos he lost contact with his family and is now on his own at a camp.",
    "text": "A boy's escape from el-Fasher amid accusations of spying\n'I was accused of spying and beaten' - a boy's escape from captured Sudan city\nBushra Mohamed and \nAkisa Wandera,BBC Africa\nAFP via Getty Images\nPeople are arriving in Tawila after having travelled on foot for three days\nTwelve-year-old Abdiwahab - not his real name - sobs as he recounts what happened to him as he escaped from the western Sudanese city of el-Fasher.\nThe young boy left el-Fasher on Sunday as it fell to the paramilitary Rapid Support Forces (RSF), the paramilitary group that has been fighting a two-and-a-half-year civil war against the army.\nIn a video received by the BBC, his face reflects deep sorrow and fatigue, his voice low as he describes being assaulted \"many times\" by RSF fighters. \nFearing reprisal attacks from RSF fighters, Abdiwahab had joined a wave of people - including some of his family - trying to get out.\nThe UN estimates that 60,000 have managed to get out of el-Fasher with many narrating horrendous stories of atrocities, including rape.\n'We saw people murdered in front of us' - siege survivors speak to the BBC\nNew videos show executions after RSF militia takes key Sudan city\nA simple guide to what is happening in Sudan\nAfter three days of walking Abdiwahab reached the relative safety of Tawila - an 80km (50-mile) journey - but he arrived on his own.\n''I left the city with my father and siblings but because of the chaos we were separated, I came to Tawila alone,\" he says on the video.\nHe was assaulted on the way and accused of being involved in espionage.\n\"I walked along the road, and on the road, [the RSF] caught me, many times. They beat me and hit me, saying, 'this little boy is a spy'.\"\nThis chimes with other accounts of how men and boys are especially at risk as they face arbitrary arrest, violence and summary execution.\nAbdiwahab says that RSF fighters had already taken his mother and one of his sisters about a month ago, and he does not know if they are still alive.\nAli, not his real name, who is now a volunteer aid worker after fleeing el-Fasher himself a fortnight ago, was the one who filmed Abdiwahab's account.\nHe is stationed at the entrance to Tawila where a temporary camp has been established and where new arrivals gather before being relocated to permanent camps inside the town.\nIn a voice note to the BBC explaining the context, Ali's words were almost drowned out by the noise and chaos at the camp.\n\"[Abdiwahab] keeps asking me about his parents. I decided to take him home until we found them,\" Ali says.\nHe noticed how the boy was traumatised, fearing that any light appearing at night was an RSF vehicle coming to get him.\n\"He saw a light in the distance and held me tight, screaming. He froze.\"\nReuters\nAid agencies are overwhelmed by the number of people who need help\nAli says each new arrival to the camp carries a story of survival and despair.\nThere are many unaccompanied minors, including children who lost their parents on the road, coming in every day.\n\"Just yesterday, twin children around 10 years old arrived with a woman who said their parents had died on the way,\" the volunteer aid worker says.\n\"The situation is terrifying. People continue arriving with many conditions, some with injuries and malnutrition. Those who arrived are begging us to go and save the people on the road, because many are dying trying to come to Tawila,\" Ali says.\nSurvivors spoke of \"passing dead bodies scattered along the road and hearing the cries of the wounded calling for help\".\nBut even relief work has become deadly.\nAli says the organisations operating in Tawila are afraid to leave the town after five Red Crescent volunteers were killed in another state earlier this week.\n\"They are waiting for assurances and confirmation that the situation is safe,\" he says.\nMany mothers arriving in Tawila are in desperate need of food, water and medical help, according to the charity Save the Children.\nSome women reported being attacked by armed men on motorbikes and robbed as they fled.\n\"Women who managed to escape with their children as fighting raged made it to Tawila without food or water. They are now entirely dependent on already stretched humanitarian assistance,\" the aid agency said in a statement.\nThe UN's refugee agency has said it was struggling to find enough shelter and food for civilians seeking refuge in the town.\nBut not everyone is making it out of el-Fasher, where there have been reports of mass killings.\nThis week, RSF leader Gen Mohamed Hamdan Dagalo admitted to \"violations\" in the city and said they would be investigated. A senior UN official has said that the RSF had given notice that they had arrested some suspects.\nEstimates vary as to how many civilians are still strapped in the city.\nSave the Children puts it at more than 260,000 people, including an estimated 130,000 children, who have to contend with famine-like conditions, the collapse of health services and no safe route out.\nMore BBC stories on the conflict:\nReports of mass killings in Sudan have echoes of its dark past\nMy son's whole body is full of shrapnel\nRare footage shows plight of civilians in besieged Sudan city\nLast surgeons standing in city's only hospital\nBBC smuggles in phones to reveal hunger and fear\nGetty Images/BBC",
    "keywords": null
  },
  {
    "url": "https://www.bbc.com/news/articles/cwy1n438dk4o",
    "domain": "www.bbc.com",
    "publish_date": "2025-10-31T00:33:07.377Z",
    "language": "en-GB",
    "title": "The American adoptees who fear deportation to a country they can't remember",
    "description": "Thousands of US adoptees do not have citizenship despite being brought to the country as babies decades ago. Now many fear deportation.",
    "text": "The American adoptees who fear deportation to a country they can't remember\nBBC\nShirley Chung, right, and an adoptee from Iran who requested anonymity\nShirley Chung was just a year old when she was adopted by a US family in 1966.\nBorn in South Korea, her birthfather was a member of the American military, who returned home soon after Shirley was born. Unable to cope, her birth mother placed her in an orphanage in the South Korean capital, Seoul.\n\"He abandoned us, is the nicest way I can put it,\" says Shirley, now 61.\nAfter around a year, Shirley was adopted by a US couple, who took her back to Texas.\nShirley grew up living a life similar to that of many young Americans. She went to school, got her driving licence and worked as a bartender.\n\"I moved and breathed and got in trouble like many teenage Americans of the 80s. I'm a child of the 80s,\" Shirley says.\nShirley had children, got married and became a piano teacher. Life carried on for decades with no reason to doubt her American identity.\nBut then in 2012, her world came crashing down.\nShe lost her Social Security card and needed a replacement. But when she went to her local Social Security office, Shirley was told she needed to prove her status in the country. Eventually she found out she did not have US citizenship.\n\"I had a little mental breakdown after finding out I wasn't a citizen,\" she says.\nShirley Chung\nShirley had an upbringing similar to that of many young Americans\nShirley is not alone. Estimates of how many American adoptees lack citizenship range from 18,000 to 75,000. Some intercountry adoptees may not even know they lack US citizenship.\nDozens of adoptees have been deported to their countries of birth in recent years, according to the Adoptee Rights Law Center. A man born in South Korea and adopted as a child by an American family - only to be deported to his country of birth because of a criminal record - took his own life in 2017.\nThe reasons why so many US adoptees do not have citizenship are varied. Shirley blames her parents for failing to finalise the correct paperwork when she came to the US. She also blames the school system and the government for not highlighting that she did not have citizenship.\n\"I blame all the adults in my life that literally just dropped the ball and said: 'She's here in America now, she's going to be fine.'\"\n\"Well, am I? Am I going to be fine?\"\nPhoto supplied\nAn adoptee from Iran, who requested anonymity, seen here bottom left as a child in the US Midwest\nAnother woman, who requested anonymity for fear of attracting the attention of authorities, was adopted by an American couple from Iran in 1973 when she was two years old.\nGrowing up in the US Midwest, she encountered some racism but generally had a happy upbringing. \n\"I settled into my life, always understanding that I was an American citizen. That's what I was told. I still believe that today,\" she says.\nBut that changed when she tried to get a passport at the age of 38 and discovered immigration authorities had lost critical documents that supported her claim to citizenship.\nThis has further complicated her feelings surrounding identity.\n\"I personally don't categorise myself as an immigrant. I didn't come here as an immigrant with a second language, a different culture, family members, ties to a country that I was born in… my culture was erased,\" she says.\n\"You are told that you have these rights as an American - to vote and to participate in democracy, to work, to go to school, to raise your family, to have freedoms - all these things that Americans have.\n\"And then all of a sudden they started pushing us into a category of immigrants, simply because they cut us from legislation. We should have all equally had citizenship rights because that was promised through adoption policies.\"\nAFP via Getty Images\nMany of the adoptees fear immigration raids despite arriving in the US as children\nFor decades, intercountry adoptions approved by courts and government agencies did not automatically guarantee US citizenship. Adoptive parents sometimes failed to secure legal status or naturalised citizenship for their children.\nThe Child Citizenship Act of 2000 made some headway in rectifying this, granting automatic citizenship to international adoptees. But the law only covered future adoptees or those born after February 1983. Those who arrived before then were not granted citizenship, leaving tens of thousands in limbo.\nAdvocates have been pushing for Congress to remove the age cut-off but these bills have failed to make it past the House.\nSome, like Debbie, whose two adopted children have special needs and requested that her full name not be used, have spent decades trying to secure citizenship for their dependents.\nShe adopted two children from an orphanage in Romania in the 1990s after watching them on Shame of a Nation - a documentary about the neglect of children in orphanages following the 1989 Romanian Revolution, that sent shockwaves around the world when it aired.\nThe most recent rejection of citizenship came in May, and was followed by a notice stating that if the decision was not appealed in 30 days, she would have to turn in her daughter to Homeland Security, she said.\n\"We'll just be lucky if they don't get picked up and deported to another country that isn't even their country of origin,\" she said.\nReuters\nDeportations have been a central theme of Donald Trump's second presidency\nThose fears for adoptees and their families have risen even further since President Donald Trump returned to the White House, with a vow to remove \"promptly all aliens who enter or remain in violation of federal law\".\nLast month, the Trump administration said \"two million illegal aliens have left the United States in less than 250 days, including an estimated 1.6 million who have voluntarily self-deported and more than 400,000 deportations\".\nWhile many Americans support deportations of illegal migrants, there has been uproar over some incidents.\nIn one case, 238 Venezuelans were deported by the US to a maximum-security prison in El Salvador. They were accused of being members of the Tren de Aragua gang despite most of them having no criminal records.\nLast month, US officials detained 475 people - more than 300 of them South Korean nationals - who they said were working illegally at Hyundai's battery facility, one of the largest foreign investment projects in Georgia. The workers were taken away in handcuffs and chains to be detained, sparking outrage in their home country.\nAdoptee rights groups say they have been flooded with requests for help since Trump's return and some adoptees have gone into hiding.\n\"When the election results came in, it started to really cascade with requests for help,\" said Greg Luce, an attorney and founder of the Adoptee Rights Law Center, adding he's had more than 275 requests for help.\nThe adoptee who arrived from Iran in the 1970s said she has started avoiding certain areas, like her local Iranian supermarket, and shares an app with her friends so they always have access to her location, in case she is \"swept up\".\n\"At the end of the day, they don't care about your back story. They don't care that you're legally here and it's just a paperwork error. I always tell people this one single piece of paper has essentially just ruined my life,\" she said.\n\"As far as I'm concerned right now, I feel stateless.\"\nThe Department of Homeland Security did not respond to a request for comment.\nShirley Chung\nShirley, now in her 60s, urges the president to help finally grant her, and others like her, citizenship\nDespite adoptees being left in limbo for decades, Emily Howe, a civil and human rights attorney who has worked with adoptees across the US, believes it is just a case of political will that should unite people from across the political spectrum.\n\"It should be a straightforward fix: adopted children should be equal to their biological siblings of parents who were US citizens at the time of birth,\" Ms Howe said.\n\"The applicants have two, three, or four US citizen parents, and are now in their 40s, 50s, and 60s. We're talking about babies and toddlers who were shipped overseas through no fault of their own and lawfully admitted under US policy,\" she added.\n\"These are people who literally were promised that they were going to be Americans when they were two years old.\"\nShirley wishes she could get the US president into a room, so she and others like her could explain their stories.\n\"I would ask him to please have some compassion. We're not illegal aliens,\" she said.\n\"We were put on planes as little itty-bitty babies. Just please hear our story and please follow through with the promise that America gave each one of the babies that got on those planes: American citizenship.\"",
    "keywords": null
  },
  {
    "url": "https://www.bbc.com/news/articles/c3ep1epqjkpo",
    "domain": "www.bbc.com",
    "publish_date": "2025-11-01T01:10:03.703Z",
    "language": "en-GB",
    "title": "Henley Passport Index: Why Indian passport is falling in global ranking",
    "description": "Indians can travel to more visa-free destinations than a decade ago, but India's passport ranking has declined.",
    "text": "Why Indian passport is falling in global ranking\nCherylann MollanBBC News, Mumbai\nGetty Images\nIndia's passport ranks 85th out of 199 countries on the Henley Passport Index\nEarlier this year, a video by an Indian travel influencer complaining about India's weak passport went viral on social media.\nHe said that while neighbouring countries like Bhutan and Sri Lanka were more welcoming of Indian tourists, getting visas to travel to most Western and European countries remained a challenge.\nHis dissatisfaction with India's poor passport strength was reflected in the latest Henley Passport Index - a ranking system of the world's passports based on visa-free travel - which placed India in the 85th spot out of 199 countries, five spots lower than last year.\nThe Indian government has not commented on the report yet. The BBC has reached out to the ministry of external affairs.\nCountries like Rwanda, Ghana and Azerbaijan with much smaller economies than India - which is the fifth-largest economy globally - are ranked higher on the index at the 78th, 74th and 72nd spots, respectively.\nIn fact, India's rank in the past decade has hovered in the 80s, even dipping to the 90th spot in 2021. These rankings are dismal compared to Asian nations like Japan, South Korea and Singapore, which have consistently held top positions.\nThis year, like the last, Singapore topped the index with visa-free travel to 193 countries. South Korea came in second with 190 visa-free destinations and Japan ranked third with 189 countries.\nMeanwhile, Indian passport holders have visa-free entry to 57 countries, just like the citizens of the African country Mauritania, which shares the 85th rank with India. \nGetty Images\nIndian passport holders have visa-free entry to 57 countries\nPassport strength reflects a nation's soft power and global influence. It also translates into better mobility for its citizens, boosting business and learning opportunities. A weak passport means more paperwork, higher visa costs, fewer travel privileges and longer waiting times for travel.\nBut despite the decline in the rank, the number of countries offering visa-free access to Indians has actually increased in the past decade or so.\nFor example, in 2014 - the year Prime Minister Narendra Modi's Bharatiya Janata Party (BJP) came to power - 52 countries offered visa-free travel to Indians and its passport ranked 76th on the index.\nA year later, it tumbled to the 85th position, then rose to 80th in 2023 and 2024, dropping again to the 85th position this year. Meanwhile, visa-free destinations for Indians increased from 52 in 2015 to 60 in 2023 and 62 in 2024. \nThe number of visa-free destinations in 2025 (57) is higher than what it was in 2015 (52), yet India's rank for both these years is 85. So, why is that?\nExperts say that a major reason is the increasingly competitive landscape in global mobility - meaning countries are entering into more travel partnerships to benefit their citizens and their economies. According to a 2025 report by Henley & Partners, the global average number of destinations travellers are able to access visa-free has nearly doubled from 58 in 2006 to 109 in 2025.\nFor example, China has increased the number of visa-free destinations its citizens can travel to from 50 to 82 in the past decade. Consequently, its rank on the index has improved from 94th to 60th during the same time period.\nMeanwhile, India - which was ranked 77th on the index in July (the Henley Passport Index is updated quarterly to reflect changes in global visa policies) as it enjoyed visa-free access to 59 countries - dropped to the 85th position in October after losing access to two countries.\nGetty Images\nSingapore's passport is the most powerful in the world\nAchal Malhotra, former Indian ambassador to Armenia, says there are other factors that affect the strength of a country's passport, like its economic and political stability as well as its openness to welcoming citizens from other countries.\nFor example, the US passport has dropped out of the top 10 and now occupies the 12th position - a historic low - because of its increasingly insular stance in world politics, the report says. \nMr Malhotra recalls how in the 1970s, Indians enjoyed visa-free travel to many Western and European countries, but that changed after the Khalistan movement in the 1980s, which called for an independent homeland for Sikhs in India and caused internal turmoil. Subsequent political upheavals have further chipped away at India's image as a stable, democratic country.\n\"Many countries are also becoming increasingly wary of immigrants,\" Mr Malhotra says. \"India has a high number of people migrating to other countries or overstaying their visas and that interferes with the country's reputation.\"\nFactors such as how secure a country's passport is and its immigration procedures also play a role in gaining visa-free access to other countries, Mr Malhotra says.\nIndia's passport remains vulnerable to security threats. In 2024, the Delhi police arrested 203 people for alleged visa and passport fraud. India is also known for having cumbersome immigration procedures and a slow pace of visa processing.\nMr Malhotra says that technological advances, like India's recently-launched electronic passport or e-passport, can improve security and ease the immigration process. The e-passport includes a small chip that stores biometric information, making it harder to forge or tamper with the document.\nBut more diplomatic outreach and travel agreements remain key to boosting the global mobility of Indians and, by extension, India's passport ranking.\nFollow BBC News India on Instagram, YouTube, X and Facebook.",
    "keywords": null
  },
  {
    "url": "https://www.bbc.com/news/videos/ce3xxzg09gro",
    "domain": "www.bbc.com",
    "publish_date": "2025-11-01T11:13:02.020Z",
    "language": "en-GB",
    "title": "'No inch here was spared': Hurricane Melissa destroys Jamaica town",
    "description": "The BBC’s Nada Tawfik reports from Black River, where the strongest storm to hit the country in modern history has left scenes of desperation.",
    "text": "'No inch here was spared': Hurricane Melissa destroys Jamaica town\nSlow-motion footage reveals secrets of snake bites\nScientists working out of a venom laboratory in Paris studied which snakes strike their prey fastest.\nWorld\nPen pals from Canada and Singapore meet for the first time after 43 years\nThe two women began exchanging letters in 1983 through a school project and finally met in Newfoundland this week.\nWorld\nTrump to Australian ambassador: 'I don't like you either'\nIn 2020, Kevin Rudd wrote on social media that he believed Trump was the 'most destructive' president in US history. \nWorld\nWatch: Brits row from Peru to Australia in tiny boat\nJess Rowe and Miriam Payne told the BBC how they made the six-month journey unsupported, catching fish and growing their own vegetables.\nWorld\nHow would US Tomahawk missiles change the Ukraine-Russia war?\nThe BBC's Jonathan Beale explains what impact the weapons might have if the US decides to send them to Ukraine.\nWorld\nPolice fire tear gas at crowds mourning former Kenyan prime minister\nThousands of mourners fill the streets of Nairobi from the airport to the Kasarani Stadium to pay their respects.\nWorld\nWatch: Security guard saves woman from being hit by tram\nFootage released by the Turkish city of Kayseri's transport operator shows the last-minute rescue.\nWorld\nThe US presidents who claimed Middle East breakthroughs before Trump\nAn assassination derailed Bill Clinton's peace plan, while other hopeful moments in history melted away.\nWorld\nWatch: Netanyahu responds to Trump remark that he's not 'the easiest' to work with\nCBS News, the BBC's US partner, conducted an exclusive interview with the Israeli prime minister in a hospital tending to freed hostages.\nWorld\nTrump: 'I'm talking about rebuilding Gaza'\nOnboard Air Force One, the BBC's Tom Bateman pressed President Donald Trump on whether his negotiated ceasefire would stay intact.\nWorld\n'Peace in the Middle East': Trump signs ceasefire deal in Egypt\nThe US president and other world leaders signed the first phase of the Gaza ceasefire deal in Sharm el-Sheik.\nWorld\nWatch: How Trump's relationships helped pull off a Gaza deal\nThe BBC's Anthony Zurcher breaks down how the US president's connections have brought about a breakthrough moment for the Middle East.\nWorld\nWhat's behind Morocco's Gen Z protests?\nYoung protesters in Morocco are protesting against corruption and for better health and education.\nWorld\nWatch: Trump and Netanyahu outline peace plan to end war in Gaza\nThe deal proposes an end to military operations, a release of Israeli hostages by Hamas and the immediate delivery of aid to Gaza.\nWorld\nIs the US-China TikTok deal done? Here's what you need to know\nDonald Trump says a deal on the future of TikTok in the US has been made, but it’s not been confirmed by China or the app’s owner ByteDance.\nWorld\nSomalia's president: They tried to kill me five times\nSomalia's President Hassan Sheikh Mohamud says he is a prime target of the Islamist group al-Shabab. \nWorld\nMacron calls Trump after motorcade blocks his car\nMacron and Trump were in New York for the 80th UN General Assembly \nWorld\nBBC's Steve Rosenberg attends 'Russia's answer to Eurovision' \nVietnam was among 23 countries competing in a glitzy Russian song contest, revived three years after Russia was banned from Eurovision.\nWorld\nWatch: Mexico and Canada are meeting without Trump - here's why\nPresident Claudia Sheinbaum and Prime Minister Mark Carney's meeting is meant to kickstart a new economic bilateral relationship.\nWorld\nWatch: Moment avalanche is triggered by explosives in New Zealand\nAuthorities started the controlled avalanche to reduce the risk for drivers to the popular tourist destination Milford Sound.\nWorld",
    "keywords": null
  },
  {
    "url": "https://www.bbc.com/news/videos/c8911dwekdno",
    "domain": "www.bbc.com",
    "publish_date": "2025-11-01T11:13:11.965Z",
    "language": "en-GB",
    "title": "Watch: Heidi Klum slithers into Halloween as Medusa",
    "description": "Stars turn out in their best Halloween costumes at Heidi Klum's annual party.",
    "text": "Watch: Heidi Klum slithers into Halloween as Medusa\nCelebrities donned weird and wonderful outfits for Heidi Klum's annual Halloween party in New York.\nThe supermodel has cemented her place as the official queen of spooky season thanks to her wild, weird and wonderful costumes.\nShe appeared as Medusa this year, complete with several moving snakes in an intricate headpiece, and was accompanied by her husband Tom Kaulitz, who was a man turned to stone.",
    "keywords": null
  },
  {
    "url": "https://www.bbc.com/news/videos/c8dr7d47zq5o",
    "domain": "www.bbc.com",
    "publish_date": "2025-11-01T11:13:22.197Z",
    "language": "en-GB",
    "title": "People at Sandringham estate in Norfolk react to Andrew's move",
    "description": "People outside the royal estate in Norfolk say they are surprised at the news he is to move there.",
    "text": "People at Sandringham estate in Norfolk react to Andrew's move\nPeople at Sandringham have been giving their reaction to news the former Prince Andrew is to move there. \nHe is to live at a property in the Norfolk estate after being stripped of his \"prince\" title on Thursday evening and told he must leave his royal mansion in Windsor. \nIt follows months of pressure over his private life.\nIt is not known when the move will take place but royal sources suggest it might be delayed until the new year.",
    "keywords": null
  },
  {
    "url": "https://www.bbc.com/news/videos/ced65d0gl2eo",
    "domain": "www.bbc.com",
    "publish_date": "2025-11-01T11:13:32.718Z",
    "language": "en-GB",
    "title": "Watch: Train smashes into truck at Dutch level crossing",
    "description": "Five people sustained minor injuries but nobody was seriously hurt in the incident in Meteren.",
    "text": "Watch: Train smashes into truck at Dutch level crossing\nCCTV footage shows the dramatic moment a train crashed into a truck at a level crossing in the Netherlands.\nThe vehicle can be seem manoeuvring forwards and backwards on the railway line before the barriers descend. It is then hit at speed.\nFive people sustained minor injuries but nobody was seriously hurt in the incident in Meteren, train operator Prorail said.\n22 hours ago\nExplore More",
    "keywords": null
  },
  {
    "url": "https://www.bbc.com/news/videos/c70jj362x9yo",
    "domain": "www.bbc.com",
    "publish_date": "2025-11-01T11:13:43.475Z",
    "language": "en-GB",
    "title": "Watch: Pet monkey gets loose inside US Halloween store",
    "description": "The owner of the acrobatic primate told police her pet ran off after being frightened by a store display.",
    "text": "Watch: Pet monkey gets loose inside US Halloween store\nThe monkey was seen on police body cam video swinging from the ceiling of the Plano, Texas Spirit Halloween store.\nThe owner reunited with her pet shortly after police arrived. She explained to officers how the primate ran away after it was frightened by a display in the store.\nPolice said the monkey was not injured and posed no threat to anyone.\n19 hours ago\nExplore More",
    "keywords": null
  },
  {
    "url": "https://www.bbc.com/news/articles/cr433x9zqq4o",
    "domain": "www.bbc.com",
    "publish_date": "2025-10-31T18:32:44.079Z",
    "language": "en-GB",
    "title": "US judges say Trump administration must keep paying Snap food benefits during US shutdown ",
    "description": "In two separate rulings, US judges said the plan to cut off Snap food benefits for millions of Americans is likely unlawful.",
    "text": "US judges say Trump administration must keep paying Snap food benefits during US shutdown\nUniversal Images Group via Getty Images\nThe Trump administration cannot suspend food aid used by more than 40 million low-income Americans amid the ongoing US government shutdown, two federal judges have ruled. \nThe decisions, issued within moments of each other on Friday by judges in Rhode Island and Massachusetts, said the government must pay for the Supplemental Nutrition Assistance Program, or Snap, benefits using emergency funds.\nThe Snap programme works by giving people reloadable debit cards that they can use to buy essential grocery items.\nThe US Department of Agriculture (USDA) announced this week it would not distribute food assistance funds in November due to the shutdown, saying \"the well has run dry\". \nA family of four on average receives $715 (£540) per month, which breaks down to a little less than $6 (£4.50) per day, per person.\nThe states administer the benefits, using money from the federal government, which has been unfunded and shut down since 1 October. \nSeveral states have pledged to use their own funds to cover any shortfall, however the federal government has warned that they will not be reimbursed.\nHalf of US states had sued the Trump administration over its plans to halt funding, hoping to force it to use a roughly $6bn (£4.5bn) emergency contingency fund for Snap, also known as food stamps.\nThe Massachusetts judge said the administration must access the contingency funding to pay the benefits and had until Monday to report back to the court on whether they will authorise at least partial benefits for November.\nMassachusetts US District Judge Indira Talwani wrote in her decision that the states who sued are likely to win in court on their claim that \"Congress intended the funding of SNAP benefits, at a reduced rate if necessary, when appropriated funds prove insufficient\".\nJudge Talwani also wrote that the Trump administration \"erred in concluding\" that the USDA is blocked by law from tapping the emergency reserves in the contingency fund when there is a lapse in federal funding.\nThe USDA had said those reserves were insufficient to pay full benefits, which cost $8.5bn to $9bn each month. Agriculture Secretary Brooke Rollins had said she would only use the fund for an emergency such as a natural disaster.\nEven if the government turns to the contingency fund, it would only be able to cover about 60% of beneficiaries in a single month, according to the Center on Budget and Policy Priorities (CBPP), a think-tank focused on policies that help low-income families.\nJudge Talwani has asked the administration to report on Monday whether it will use the fund to pay reduced benefits or if it will pay full benefits for the month by moving money from other programmes, similar to the administration transferring military research funds earlier this month to pay members of the armed forces.\nSeparately in Rhode Island, a lawsuit was brought by a number of US cities and NGOs who sued over what they called the \"unlawful suspension\" of the programme.\n\"There is no doubt and it is beyond argument that irreparable harm will begin to occur if it hasn't already occurred in the terror it has caused some people about the availability of funding for food, for their family,\" US District Judge John McConnell said.\nThe White House and the USDA did not comment on the decisions. The BBC has also contacted the Office of Management and Budget for comment.\nAt a news conference before the rulings were issued, Rollins said \"we're looking at all the options\" when asked whether the administration would comply if courts required it to release funds. \nOn Friday, the group behind the lawsuit filed in Rhode Island said in a statement that the ruling \"is a lifeline for millions of families, seniors, and veterans who depend on SNAP to put food on the table\".\n\"It reaffirms a fundamental principle: no administration can use hunger as a political weapon.\"\nRepublicans and Democrats have traded blame for the federal shutdown, which will soon enter its second month, and there has not been any meaningful progress toward a deal.",
    "keywords": null
  },
  {
    "url": "https://www.bbc.com/news/articles/cpq11v5d1rno",
    "domain": "www.bbc.com",
    "publish_date": "2025-11-01T09:48:06.988Z",
    "language": "en-GB",
    "title": "Campari shares worth €1.3bn seized by police over alleged tax evasion",
    "description": "The spirit manufacturer's parent firm is accused of failing to declare a similar amount in tax during a merger.",
    "text": "Campari shares worth €1.3bn seized by police over alleged tax evasion\nPolice seize €1.3bn from Campari owner over alleged tax evasion\nGetty Images\nShares worth €1.3bn (£1.1bn; $1.5bn) have been seized from the company that controls the manufacturer of Campari over alleged tax evasion, Italian police have said.\nOfficials ordered the confiscation of the Campari Group shares from Luxembourg-based Lagfin as part of a year-long investigation into how it absorbed its Italian arm.\nIt is accused of failing to pay a similar figure to that of the shares seized in taxes during that merger. The company previously said it had always fulfilled its tax obligations.\nCampari - which also produces alcohol brands including Aperol, Grand Marnier and Courvoisier - said neither it nor its subsidiaries were involved in the case. \nHowever, chair Luca Garavoglia is among those under investigation, local media reports.\nThe BBC approached Lagfin - which owns more than 50% of Campari shares and has 80% of voting rights - for comment.\nIt previously said in a statement issued on the investigation last year that it had \"always fulfilled its tax obligations with the utmost scruples in all the jurisdictions where it operates\" and considers any claims to the contrary \"devoid of any basis\".\nProsecutors in Milan launched a probe into the company last year. Financial police on Friday said they allegedly found €5.3bn of undeclared capital gains between 2018 and 2020 on which it had not paid a so-called \"exit tax\", levied on firms that transfer their headquarters abroad.\nIt is also accused of transferring its Italian assets into foreign ownership solely for tax purposes, according to Italian financial newspaper Il Sole 24 Ore.\nMr Garavoglia, the billionaire who inherited ownership of Campari from his late mother, is implicated alongside Giovanni Berto, the head of Campari's Italian branch, local media reports.\nOne of the largest global producers of spirits, Campari is valued at around €7bn on the Milan Stock Exchange.\nThe company has its roots in 1860, when Gaspare Campari's homemade bitter liqueur became a popular tipple among patrons of his Milan bar. \nIt became so successful that, in 1904, his family began manufacturing it commercially, and from the 1990s onwards the firm began acquiring other alcohol brands.",
    "keywords": null
  },
  {
    "url": "https://www.bbc.com/news/articles/clykwk9vwryo",
    "domain": "www.bbc.com",
    "publish_date": "2025-10-31T22:51:40.456Z",
    "language": "en-GB",
    "title": "The 'silver influencers' taking TikTok and Instagram by storm",
    "description": "Older women are carving out a niche online for people who want authentic content.",
    "text": "The 'silver influencers' taking TikTok and Instagram by storm\nViv Truran says social media \"is a welcoming space\" for more mature people now\nEighty-one-year-old Viv Truran is very particular about how she takes her photos.\n\"We do it in portrait for social,\" she says, matter-of-factly.\nViv is embracing life as an online fashion content creator who regularly goes viral and is part of a growing number of women in later life turning to Instagram and TikTok to express themselves.\n\"I don't mind being called a 'silver surfer' or a 'silver influencer'. I'll take that,\" she said. \n\"Can you believe over five million people have seen me? I just can't get over it.\"\nWith almost 300,000 followers on Instagram, the content creator, who was born and raised in Cardiff, shares daily videos of her outfits and styling tips.\nHer followers are from across the globe and she said they varied in age from people in their 20s to over-65s.\n\"I love the youngsters because they want me to be their grandma.\" \nViv said it was only when she got comments on her posts asking where her outfits were from that she became \"for the want of a better word, an influencer\".\nAfter a career involving stints in the civil service and British Telecom, Viv became \"Del Boy on legs\" as a \"wheeling and dealing\" antique dealer in her late 40s.\nBut what does she think is at the heart of her success in her \"third career\"?\n\"I think people want authenticity and I think, I hope, I'm authentic. What you see is what you get.\" \nVivian Truran\nViv \"thoroughly enjoys\" sharing her life with her hundreds of thousands of followers \nSherry Grossi, 81, from North Carolina in the US, tries to \"give a lot of encouragement\" to her almost 130,000 followers on Instagram and 30,000 on TikTok.\n\"I find that women, as they age, get booked into a certain category and you're supposed to slow down and you're not supposed to do this or that and, to me, that's totally wrong.\"\nThe businesswoman, mother and grandmother is pleased to see social media embracing people in later life and is determined to prove to older people that they shouldn't allow anyone to put them into categories.\n\"I see a lot more older influencers. People are thinking that 80 is the new 60, and 60 is the new 40.\n\"If I can do it at 80 years old, anybody can do it.\"\nAlexandra Dean Grossi\nSherry Grossi bought herself a ring light and started making reels from home\nThe Office for National Statistics estimates the number of people aged 65 and over increased across the whole of the UK, in the year to mid-2024.\nProf Eleri Rosier from Cardiff University Business School said it was no surprise to see the changing demographics reflected on social media, adding that there had been a \"massively noticeable shift\" of the age of the people shaping fashion and beauty content online.\n\"For a long time, social media has been dominated by younger creators but now, a lot more, we're seeing older influencers,\" she said.\nShe added that they were popular because they created content they know their followers enjoy.\nRhian Davies\nRhian Davies says women can start to feel invisible as they get older \nRhian Davies, 58, from Cwmbran, Torfaen, said she was once told of the idea that when many women hit middle age they become \"invisible\" and admits she \"felt that\".\nBut when the mum-of-two started sharing her outfits on TikTok, she racked up more than 170,000 followers.\n\"It is really important to me to show other women my age that it's still OK to take up space, it's still OK to want to look after yourself and do the best that you can.\"\nHer most successful videos are when she's \"showing the reality\" of life and recording herself with no make up and natural hair. \n\"From very early on I realised that most women wanted to see themselves represented, not this perfectly groomed woman with the Aga in the background and the kitchen island. \n\"They wanted to see somebody that looked like them.\n\"When you're in your 50s, you don't always want to watch the ones in their 20s doing their makeup, because what works for them doesn't work for my age group.\"\nDora Paphides\nWelsh beauty writer Sali Hughes says more brands are realising the value of older customers now \nSali Hughes, beauty columnist for The Guardian, isn't surprised to see the rise of \"silver influencers\" as brands have spent years \"marketing aggressively at young people who don't have any money\" to buy their products.\nBut now they are waking up to the fact that age diversity is essential for success as older people, generally, have more money than young consumers.\n\"If you obsess so much on youth that will bite you on the bum, unfortunately.\"\nValerie Mackay\nValerie was able to leave her role in the NHS as a result of her success online \nWhen Valerie Mackay, 62, joined Instagram, she found it tricky to find fashion content creators who looked like her so she \"just started posting my outfits.\"\nEight years on and with more than one million followers under her belt, the mother-of-two from the Highlands of Scotland is regularly invited to work with high-end brands such as Armani and L'Oréal. \nShe said: \"With social media, it doesn't matter how old you are, where you live, the opportunity's there if you want to go for it.\"",
    "keywords": null
  },
  {
    "url": "https://www.bbc.com/news/articles/c3w9x86p9ndo",
    "domain": "www.bbc.com",
    "publish_date": "2025-11-01T01:57:56.742Z",
    "language": "en-GB",
    "title": "Skepta and JME: How two brothers helped propel grime into the mainstream",
    "description": "They changed the face of British music when they formed the label after their rap crew disbanded.",
    "text": "How two brothers helped propel grime into the mainstream\nSimone Joyner/Getty Images\nBoy Better Know performing at this year's Wireless Festival \nIn 2005, brothers Joseph and Jamie Adenuga were facing uncertainty in the wake of their rap crew disbanding. \nWhile other members started to re-organise themselves, the Tottenham-based siblings decided to pursue music on their own terms - a move that would come to define their careers. \nThe brothers are now better known as Skepta and JME, and the label they formed was Boy Better Know (BBK). \n\"They were so influential for rapping in the UK, they showed us we can,\" Lewisham-based artist Shaybo tells the BBC. \nAt this time, grime was still a young and developing genre of music that was emerging out of the electronic dance scene.\nUp-and-coming British rappers were being signed to major labels to make what the industry considered to be more commercially viable songs. \nIn other words - not grime. \nBut the ethos of BBK was to stay independent and stay true to who you are. \n\"They are incredibly headstrong people and probably saw the pitfalls of signing deals,\" says RWD magazine founder Dacre Bracey, who has covered grime since its inception.\nThere are other members of the label - such as Frisco, Jammer and Shorty - but \"the genius of BBK is the Adenuga family,\" he explains. \nTristan Fewings/Getty Images\nJME (far left) and Skepta (third from right) are the \"genius\" of BBK, says Dacre Bracey\nAn early sign of this genius was their T-shirts printed with the Boy Better Know logo. \nDesigned by JME - who would go on to graduate from the University of Greenwich with a degree in 3D digital design - they were sold all over the capital and helped fund the label in the early days, says Bracey. \n\"Everyone would wear their T-shirts at school,\" Shaybo adds. \n\"BBK gave you the confidence to be unapologetically yourself. I could listen to music I really related to.\"\nAnother artist who felt the influence while still a teenager was rapper Capo Lee. \nHe attended Winchmore School in north London, the same as the Adenuga brothers, although is a few years younger. \n\"When you're drowning in negativity it's hard to get out of it,\" he tells the BBC. \n\"They gave us a lot of hope that things were possible.\n\"I started as a DJ in secondary school, when I was 13. My friends would come round and we'd try to recreate their vibe in my room.\"\nJohn Rahim/ Shutterstock\nSkepta (pictured) and JME attended Winchmore School in north London\nThings were really starting to grow for the label in the late 2000s.\nThey'd released dozens of well-received mixtapes, culminating in the track Too Many Man, which broke into the UK singles charts. \nBut by 2010, the world of grime looked very different. \n\"The excitement had petered out,\" Bracey says. \n\"The police really drew down on the live event aspect of grime so you couldn't perform, and the [government] cracked down on pirate radio.\n\"A lot of people retired and moved on, or changed genres.\"\nDizzee Rascal, who once defined the sound of grime with his Mercury Prize-winning debut Boy in da Corner, now made more commercial rap, with songs like Bonkers and Dance Wiv Me. \nBut Capo Lee still sees this commercial breakthrough as a positive for grime. \n\"Music was very different in the 2010s, but [the public] got used to seeing black men on the screen,\" he says.\nDave M. Benett/Getty Images\nJME has remained proudly independent throughout his career\nEven through this quiet period for grime, BBK continued to release music. \n\"JME has always had this very strong spirit of independence, he's never been seduced by the trappings of fame,\" says documentary photographer Simon Wheatley, who has known the Adenuga brothers for many years.\nSkepta temporarily altered course, signing to Universal where he released his third album Doin' It Again to modest commercial success. \nBut his sound was watered down and he left the label, returning to grime with the 2014 hit That's Not Me, a song about rejecting commercial pressure and designer brands to be true to yourself. \nThe music video, which cost £80 to create, scooped a Mobo award - proving Skepta could make it just fine on his own. \nTim P. Whitby/Getty Images\nSkepta won the Mercury Prize for his 2016 album Konnichiwa \nJME's output culminated in his hugely successful 2015 album Integrity, which entered the UK albums chart at number 12. \n\"I think it's a very aptly named album given the way he is,\" Wheatley says. \nThe following year Skepta released his own magnum opus, Konnichiwa. With a sprinkling of Pharrell Williams' production over its undeniable grime core, the album was awarded the Mercury Prize. \nReleased by BBK, it helped cement grime as a genre being driven on its own terms, away from the influence of major label executives. \nIt was this period of the label that \"opened everyone's eyes and ears again\" to grime, Capo Lee tells the BBC. \nWireImage via Getty Images\nShaybo says BBK gave her the confidence to be unapologetically herself\nOther artists would follow - Stormzy, Dave, Bugzy Malone - and take the genre in different directions, but they all began on the independent path forged by BBK. \nEven an artist like Shaybo, who would not describe herself as a grime MC, says BBK has had a huge impact on her.\n\"Grime was my foundation, they gave me the skills to rap and the confidence to embrace my heritage,\" the 29-year-old says. \n\"When people hear BBK they know it's BBK.\"\n\"These things could only have happened in London or the UK, through the melting pot of cultures,\" Bracey adds.\n\"That's why BBK are great and magical and special.\"\nAdditional reporting by Connie Bowker",
    "keywords": null
  },
  {
    "url": "https://www.bbc.com/news/articles/cwykk10053eo",
    "domain": "www.bbc.com",
    "publish_date": "2025-10-31T21:32:21.891Z",
    "language": "en-GB",
    "title": "France hit by second daring heist as thieves target gold refinery",
    "description": "Thieves used explosives to break into a precious metals refinery before making off with a €12m loot. ",
    "text": "France hit by second daring heist as thieves target gold refinery\nAFP via Getty Images\nSix suspects have been arrested near the French city of Lyon in connection with the country's latest brazen heist.\nThieves used explosives to break into a precious metals refinery on Thursday before making off with the loot, which was mostly gold and worth €12m (£10.5m, $13.8m).\nFollowing a chase, police caught the suspects and recovered the haul, officials said. \nThe heist came after five more people were arrested over a theft at the Louvre Museum in Paris earlier this month.\nIn the Lyon incident, footage posted on social media by people living near the facility showed two men near a white van. One could be seen placing a ladder over the company's fence before scaling it.\nAnother video showed a robber carrying a weapon and opening the rear door of the van, while another loaded briefcases into the vehicle.\nAn unnamed neighbour told AFP news agency she heard a big explosion. \"It was really impressive,\" she said.\nFive employees of the firm Pourquery Laboratories suffered minor injuries in the explosion, officials told AFP.\nA woman was among those detained after the chase. Assault rifles and explosives were also seized, police said. \nMeanwhile, the latest arrests over the Louvre heist in Paris bring the number of those detained to seven.\nOn 19 October, four suspects used a mechanical lift to gain access to the museum's Gallery of Apollo in broad daylight. \nThey cracked open display cases housing crown jewels with a disc cutter and made off with items worth €88m (£76m; $102m).\nPolice say those arrested include three of the thieves. Officers are still hunting the fourth.",
    "keywords": null
  },
  {
    "url": "https://www.bbc.com/news/articles/c4g78nj7701o",
    "domain": "www.bbc.com",
    "publish_date": "2025-11-01T00:00:07.288Z",
    "language": "en-GB",
    "title": "Number of Irish citizens deported from US up by more than 50%",
    "description": "New figures show more Irish citizens are being deported from the US, amid a crackdown by immigration officials. ",
    "text": "Number of Irish citizens deported from US up by more than 50%\nAdam MandevilleBBC News NI\nJim Brown\nJim Brown (right), whose wife Donna Hughes-Brown is facing deportation to Ireland, described the recent crackdown as \"insane\"\nThe number of Irish citizens deported from the United States has risen by more than 50% so far in 2025 compared to the previous year, figures released to BBC News NI show.\nBetween January and September 2025, 99 Irish people were deported, according to statistics from the United States Immigration and Customs Enforcement (ICE) unit.\nThis compares to 60 deportations between October 2023 and September 2024. A US immigration lawyer told BBC News NI the number had increased since President Donald Trump's election. \nA spokesperson for ICE said: \"Individuals who are in the US lawfully and have not violated immigration laws or committed crimes have no reason to fear enforcement actions.\"\nClaire Doutre, an immigration attorney with McEntee Law, said many people were now facing more intense enforcement of immigration law, including Irish citizens. \n\"The biggest change is that we are seeing a lot more people without criminal backgrounds, who have been here for years, getting detained,\" she said.\nErin Stefanik Photography\nImmigration lawyer Claire Doutre said she was seeing more people without criminal records being detained\nShe added that many being detained and deported entered the US lawfully but overstayed their visas.\n\"Everybody is at risk right now.\" \nA US Navy veteran whose Irish citizen wife is set to be deported due to two prior convictions for fraud described the recent crackdown as \"insane\".\nJim Brown's wife Donna Hughes-Brown has lived in the US since she was a child but faces deportation for two convictions, which he said stems from writing bad cheques for $49 and $22 more than a decade ago. \n\"They keep talking about all the bad people. Donna is not that person. Yes, she's made mistakes, but who hasn't,\" he told BBC News NI. \nHow many Irish people have been deported from the US?\nIt is believed there are more than 100,000 Irish citizens living in the US. \nFigures released to BBC News NI show that between 1 January this year and 29 September, 99 Irish citizens were deported.\nThis is an increase of more than 50% compared to the 2024 fiscal year - from October 2023 to September 2024 - during which 60 Irish citizens were deported.\nIn previous years the number of deportations per fiscal year were:\n2023: 37\n2022: 17\n2021: 10\n2020: 19\nThe number of Irish citizens in the US who have requested assistance from the Irish Department of Foreign Affairs (DFA) in relation to deportation has also increased in the last few years.\nStatistics provided to BBC News NI from the DFA show that between 1 January and 25 September 2025 there were 51 requests - up from 15 in 2024.\nIn the past five years the next highest number of requests was 18 in 2023, while the figures went as low as five in 2021. \nAccording to information from the United States government, authorities can detain and potentially deport non-citizens who participate in criminality; are considered a threat to public safety; or violate their visa.\n'She was trying to survive'\nJim Brown told BBC News NI his wife has been detained in an ICE facility for 90 days and is due for deportation to Ireland, a country she has not lived in since she was a child, over two fraud convictions.\nMs Hughes-Brown, an Irish citizen, has lived in the US since her parents moved to the country in the 1970s. She has held a green card since she was 18. \nMr Brown said she does not \"deserve\" to be detained as the convictions relate to two bad cheques at \"a grocery store\", written in 2012 and 2015, for $49 and $22.\nHe said the bad cheques were due to Mrs Hughes-Brown being unable to afford to feed her family at the time. \n\"She was trying to survive,\" he said. \nJim Brown\nDonna Hughes-Brown moved to the United States with her parents when she was a child \nICE confirmed the dates and nature of the two convictions, but did not respond when asked to confirm the specific figures. \nMr Brown, who served in the US Navy for 20 years including in the Gulf War, said it is \"not only wrong, but also a waste of money\" that his wife has been jailed for \"such minor\" infractions. \nA spokesperson for ICE said that, when re-entering the US in July, Mrs Hughes-Brown was \"referred to secondary inspection due to her prior criminal history, which includes two convictions for fraud involving the passing of bad checks, one in 2012 and another for 2015\". \n\"Following the inspection, she was arrested and subsequently transferred to ICE custody, where she was placed in removal proceedings.\"\nThe statement added that ICE is \"prioritizing the removal of criminal alien offenders who pose a threat to public safety and the rule of law\".\nThe US government has said it can detain and potentially deport non-citizens who participate in criminality; are considered a threat to public safety; or violate their visa.\nJim Brown\nJim Brown said conditions at his wife's detention facility were \"wrong\"\nMr Brown said the facility in which Mrs Hughes-Brown has been detained is \"awful\", adding that detainees are given unhealthy food and are not having their medical needs met.\n\"The toilet was backed up for a week, and there are 25 women to a toilet. They had to sit there and smell that for a week,\" he said.\n\"It's wrong. It's just wrong.\"\nMr Brown added that authorities at the facility had failed to provide his wife with medication, which he said she needs. \nA senior official at the Department for Homeland Security (DHS) said ICE have \"among the highest detention standards\" in the US. \n\"All detainees are provided with proper meals, medical treatment, and have opportunities to communicate with lawyers and their family members.\"\nThe statement added that ICE provides \"comprehensive medical care from the moment an alien enters ICE custody\", and that \"meals are certified by dieticians\".\n\"Ensuring the safety, security, and wellbeing of individuals in our custody is a top priority at ICE.\"\nGetty Images\nICE have said they are prioritising the removal of non-citizens \"who pose a threat to public safety and the rule of law\"\nMr Brown, who described the government's actions as \"overreach\" and \"egregious\", said he was worried he will be separated from his wife long-term.\nMs Doutre said it had become \"practically impossible\" for those detained by ICE to obtain bail.\n\"If I look at it from an efficiency and monetary side, [the US is] wasting money. It is wild that this is happening,\" she added.\n'No room for error'\nMs Doutre also said detainees are often kept at facilities with \"deplorable\" conditions. \nShe added that she expects ICE enforcement to intensify, and that the advice she and her colleagues offer to clients has changed. \n\"There's no room for error. Every case is so scrutinised that we really need people to go in prepared.\n\"Once you're in detention, it is really hard to work on your case. My advice right now is line up an attorney, prepare your case ahead of time, and get all your evidence ready.\"\nA senior DHS official told BBC News NI that \"lawful permanent residents presenting at a US port of entry with certain criminal convictions may be found inadmissible, placed in removal proceedings, and subject to mandatory detention\".\nA spokesperson for the Irish DFA said: \"Where a citizen does request consular assistance as a result of an impending deportation, the department can assist with providing information on the deportation arrangements, contacting family/friends at the request of the citizen and providing a list of English-speaking lawyers.\"",
    "keywords": null
  },
  {
    "url": "https://www.bbc.com/news/articles/cx2yrd6jrplo",
    "domain": "www.bbc.com",
    "publish_date": "2025-10-31T01:50:50.255Z",
    "language": "en-GB",
    "title": "Mississippi drug bribery sting snares 14 police officers among 20 arrested",
    "description": "Officials investigated after hearing complaints from real drug traffickers about having to pay bribes to officers.",
    "text": "Mississippi drug bribery sting snares 14 police officers among 20 arrested\nGetty Images\nFourteen current and former law-enforcement officers are among 20 defendants charged in Mississippi and Tennessee with accepting bribes from drug traffickers for police protection in what officials called \"a monumental betrayal of public trust\".\nThe arrests follow a years-long investigation by federal agents who posed as narcotics dealers. Two of the defendants were Mississippi sheriffs.\nFederal officials set up the sting after hearing complaints from real drug traffickers about having to pay bribes to officers.\nThe bribery network allegedly extended beyond the Mississippi Delta region into Memphis, Tennessee, and Miami, Florida. \n\"The original complaints that began the investigation were from drug dealers,\" US Attorney Clay Joyner for the Northern District of Mississippi told a news conference on Thursday.\nSome of the officers had received bribes of between $20,000 (£15,000) and $37,000, the prosecutor added.\nThe sting involved undercover federal agents posing as drug dealers with fake narcotics, which the defendants allegedly believed to be 25kg (55lb) of cocaine.\nFBI deputy director Andrew Bailey said the accused officers had \"sold out the public\".\n\"They betrayed the trust that the public placed in them, disgraced the badge and undermined the hard work of good law enforcement officers across this state and region,\" Bailey told the news conference.\nThe arrests come as US officials have embarked on air strikes in South America against alleged drug traffickers.",
    "keywords": null
  },
  {
    "url": "https://www.bbc.com/news/topics/c2vdnvdg6xxt",
    "domain": "www.bbc.com",
    "publish_date": "2025-11-01T11:14:31.466Z",
    "language": "en-GB",
    "title": "Israel Gaza war | Latest News & Updates | BBC News",
    "description": "Follow the latest news on the Israel Gaza war. Get live updates, maps, verified video reports and expert analysis from BBC journalists on the ground.",
    "text": "Israel Gaza war | Latest News & Updates\nSkip to content\nAdvertisement\nWatch Live\nAdvertisement\nIsrael confirms identities of hostages' bodies returned by Hamas\nThe bodies were identified as those of Amiram Cooper and Sahar Baruch, the Israeli prime minister's office said.\n1 day ago\nMiddle East\nCan the Gaza ceasefire deal survive?\nIts prospects depend heavily on the continuing engagement of the Trump White House, writes Frank Gardner.\n3 days ago\nWorld\nFreed Israeli hostage forced to dig own grave is 'growing back to his old self', father says\nEvyatar David's health is \"improving every day\", his father says as his son and two other hostages freed by Hamas are discharged from hospital.\n5 days ago\nMiddle East\nInternational troops won't want to enforce Gaza peace, says King of Jordan\nKing Abdullah tells the BBC there would need to be peace in Gaza before any international forces were deployed.\n5 days ago\nMiddle East\nEgypt and Red Cross join search for hostage bodies in Gaza\nIsrael said the teams have been permitted to search beyond the so-called \"yellow line\" in the area controlled by its forces in Gaza.\n6 days ago\nMiddle East\nCan the Gaza ceasefire deal survive?\nIts prospects depend heavily on the continuing engagement of the Trump White House, writes Frank Gardner.\n3 days ago\nWorld\nIsraeli strikes in Gaza kill 104, health ministry says, after Hamas accused of killing soldier\nUS President Trump says \"nothing\" will jeopardise the two-week-old ceasefire despite the flare-up of violence. \n3 days ago\nMiddle East\nIsrael says coffin from Hamas did not contain another hostage's body\nIsrael accuses Hamas of a \"clear violation\" of the ceasefire deal after tests showed the remains belonged to a person whose body was previously returned.\n4 days ago\nWorld\nFreed Israeli hostage forced to dig own grave is 'growing back to his old self', father says\nEvyatar David's health is \"improving every day\", his father says as his son and two other hostages freed by Hamas are discharged from hospital.\n5 days ago\nMiddle East\nAnalysis\nWatch: UN official says Gaza ruins 'like Hiroshima' \nHumanitarian chief Tom Fletcher talk to the BBC about scenes of despair he witnessed on a recent trip to the costal enclave. \nNew images show Israeli control line deeper into Gaza than expected\nIsrael has placed boundary markers up to 520m deeper inside Gaza than expected under the ceasefire deal with Hamas.\nAid group suspends Gaza operations after ceasefire\nThe US and Israeli-backed GHF group was heavily criticised before it announced a “pause” on its operations.\n'Worse than starting from scratch': How big is the task of rebuilding Gaza?\nBBC Verify investigates the damage done by two years of war, which could take $70bn and decades to repair.\nBowen: Trump's role in Gaza ceasefire was decisive, but not a roadmap to peace\nTrump's Middle East visit was a victory lap - but peace does not emerge just because a president decides it.\nHuman stories\nGaza doctors struggle to investigate 'signs of torture' on unnamed dead returned by Israel\nPhotographs show bodies with multiple signs of injury and wrists tied behind their backs.\nUN's top court says Israel obliged to allow UN aid into Gaza\nThe court also says Israel has not substantiated its allegations against the UN agency for Palestinian refugees.\n'I'm 89 and I saw my homeland rebuilt before - but now I don't believe Gaza has a future'\nOne Palestinian family shares their story of life coming full circle - and what they believe lies ahead as talk turns to rebuilding Gaza\nA lucky cat, a tattered football: The things Gazans kept close during two years of war\nThe BBC speaks to Palestinians about the keepsakes and essentials they have held on to.\n'It's not over,' says son of hostage whose body remains in Gaza\nRotem Cooper, whose father Amiram's body has not been returned, calls on mediators to put pressure on Hamas to release the remaining bodies.\nWatch and listen again on iPlayer and Sounds\nJeremy Bowen: Chances of peace in the Middle East\nThe BBC's International Editor reflects on the ongoing peace efforts\nLatest updates\n1 day ago\nIsrael confirms identities of hostages' bodies returned by Hamas\nThe bodies were identified as those of Amiram Cooper and Sahar Baruch, the Israeli prime minister's office said.\n1 day ago\n1 day ago\nWho are the released hostages?\nThe Israeli military says 20 living hostages have been released by Hamas and have returned to Israel.\n1 day ago\n2 days ago\nUK pledges £4m to clear land mines to help flow of aid in Gaza\nIt will allow a UN body to clear land mines and allow the safe passage of aid to Palestinians.\n2 days ago\n2 days ago\nDependants of some Gazan students can join them in UK, government says\nThe decision is a reversal of the original policy which only supported the evacuation of the students themselves.\n2 days ago\n3 days ago\nCan the Gaza ceasefire deal survive?\nIts prospects depend heavily on the continuing engagement of the Trump White House, writes Frank Gardner.\n3 days ago\n3 days ago\nIsraeli strikes in Gaza kill 104, health ministry says, after Hamas accused of killing soldier\nUS President Trump says \"nothing\" will jeopardise the two-week-old ceasefire despite the flare-up of violence. \n3 days ago\n3 days ago\nBen & Jerry's co-founder says Unilever blocked Palestine-themed ice cream\nBen Cohen says he will independently create the new watermelon flavour in support of \"permanent peace in Palestine\". \n3 days ago\n4 days ago\nTeaching unions criticise education minister's trip to Israel\nNorthern Ireland's education minister is on a visit to Israel for what he calls a \"fact-finding mission\".\n4 days ago\n4 days ago\nIsrael says coffin from Hamas did not contain another hostage's body\nIsrael accuses Hamas of a \"clear violation\" of the ceasefire deal after tests showed the remains belonged to a person whose body was previously returned.\n4 days ago\n...",
    "keywords": null
  },
  {
    "url": "https://www.bbc.com/news/war-in-ukraine",
    "domain": "www.bbc.com",
    "publish_date": "2025-11-01T11:14:40.666Z",
    "language": "en-GB",
    "title": "Ukraine War | Latest News & Updates| BBC News",
    "description": "Follow the latest news about the Russia Ukraine war. Find reports from the ground, verified videos, maps and expert analysis by BBC correspondents across the world.",
    "text": "Ukraine War | Latest News & Updates\nSkip to content\nAdvertisement\nWatch Live\nAdvertisement\nRussian activity increasing around key Ukrainian town, army chief says\nThe capture of Pokrovsk could unlock Russian efforts to seize the rest of the Donetsk region.\n2 days ago\nEurope\nIn Russia's 'blitz' of Ukraine, the question of appeasement is back\nA large gulf remains between the US and European view of how to end the Ukraine war.\n5 days ago\nEurope\nTrump hopes China will help push Russia towards Ukraine peace talks\nStruggling to broker a peace deal in Ukraine, Trump hopes Xi Jinping could influence Vladimir Putin.\n7 days ago\nWorld\nMen jailed over arson attack for Russia on Ukrainian business in London\nRingleader Dylan Earl, 21, was recruited by Russian mercenary group Wagner to attack a London warehouse sending aid to Ukraine. \n8 days ago\nLondon\nUkraine allies pledge to take Russian oil and gas off global market\nA \"coalition of the willing\" meeting in London seeks to increase pressure on Russia to end its war in Ukraine.\n8 days ago\nEurope\nIn Russia's 'blitz' of Ukraine, the question of appeasement is back\nA large gulf remains between the US and European view of how to end the Ukraine war.\n5 days ago\nEurope\nThe 'Heroes of Kharkiv' who saved 48 children from kindergarten hit by Russian drone\nThe story of a dramatic and heroic rescue that has captured the public imagination in Ukraine.\n6 days ago\nEurope\nThree killed in Russian strikes on Kyiv, officials say\nAt least 32 others were injured in the attack, including six children, the city's mayor says.\n6 days ago\nEurope\nTrump hopes China will help push Russia towards Ukraine peace talks\nStruggling to broker a peace deal in Ukraine, Trump hopes Xi Jinping could influence Vladimir Putin.\n7 days ago\nWorld\nAnalysis\nWhat's the significance of US sanctions on Russian oil?\nThe new measures target Moscow's ability to fund its war machine, the US Treasury said.\nRosenberg: Trump abandons carrot and wields stick over Putin in Ukraine talks\nThe BBC's Russia editor says Trump's decision to call off his Putin talks and impose oil sanctions will not go down well in Moscow.\nWhy Trump made breakthrough in Gaza but can't with Putin over Ukraine\nThe leaders' cancelled summit is just the latest twist in Trump's efforts to broker an end to the war, writes Anthony Zurcher. \nHow would US Tomahawk missiles change the Ukraine-Russia war?\nThe BBC's Jonathan Beale explains what impact the weapons might have if the US decides to send them to Ukraine.\nUkraine in maps: Tracking the war with Russia\nHow Russia's gradual gains in the face of fierce Ukrainian opposition have affected the front line in recent months.\nOn the ground\nUkrainian city in total blackout after 'massive' Russian assault\nAcross the wider region, four people are reported to have been killed and 10 others injured.\nRussia intensifies attacks on Ukraine's trains in 'battle for the railways'\nIn the last two months, Russia has hugely upped its attacks on Ukraine's trains and rail network.\nIndian student captured by Ukraine joined Russian army to avoid drug charges, says mother \nGujarat’s Sahil Majothi joined the Russian army to avoid jail over alleged drug charges.\nThe new AI arms race changing the war in Ukraine\nBoth Ukraine and Russia use AI in battle, but removing human decision-making comes with risks.\nHave Russians set up a military base in my childhood home?\nSatellite images show the house where the BBC's Vitaly Shevchenko grew up could now be a Russian base.\nQ&A: Trump's sanctions, Putin's nuclear drills, and Zelensky's poll ratings\nYour questions answered as the US puts new sanctions on Russian oil companies.\nLatest updates\n1 day ago\nRussia's new nuclear weapons - real threat or Putin bluster?\nThis week alone, the Russian president unveiled two nuclear-capable weapons - but their value may be more symbolic than military.\n1 day ago\n1 day ago\nHow teenager gave a street concert and was caught up in Russia's repressive past\nDiana Loginova sang songs critical of the Kremlin. The 18-year-old and her bandmate are now in court.\n1 day ago\n3 days ago\nBritish man arrested in Ukraine accused of spying for Russia\nThe unamed Briton passed information to Russia while working as a military instructor, prosecutors say.\n3 days ago\n4 days ago\nRussian forces gain foothold in strategic Ukrainian town\nUkraine's president confirms Russian soldiers have taken up position inside the town of Pokrovsk.\n4 days ago\n5 days ago\nIn Russia's 'blitz' of Ukraine, the question of appeasement is back\nA large gulf remains between the US and European view of how to end the Ukraine war.\n5 days ago\n6 days ago\nThree killed in Russian strikes on Kyiv, officials say\nAt least 32 others were injured in the attack, including six children, the city's mayor says.\n6 days ago\n6 days ago\nThe 'Heroes of Kharkiv' who saved 48 children from kindergarten hit by Russian drone\nThe story of a dramatic and heroic rescue that has captured the public imagination in Ukraine.\n6 days ago\n7 days ago\nTrump hopes China will help push Russia towards Ukraine peace talks\nStruggling to broker a peace deal in Ukraine, Trump hopes Xi Jinping could influence Vladimir Putin.\n7 days ago\n8 days ago\nMen jailed over arson attack for Russia on Ukrainian business in London\nRingleader Dylan Earl, 21, was recruited by Russian mercenary group Wagner to attack a London warehouse sending aid to Ukraine. \n8 days ago\n...",
    "keywords": null
  },
  {
    "url": "https://www.bbc.com/news/us-canada",
    "domain": "www.bbc.com",
    "publish_date": "2025-11-01T11:14:41.174Z",
    "language": "en-GB",
    "title": "US & Canada | Latest News & Updates | BBC News",
    "description": "Get all the latest news, live updates and content about the US & Canada from across the BBC.",
    "text": "US & Canada | Latest News & Updates\nSkip to content\nAdvertisement\nWatch Live\nAdvertisement\nAndrew should answer Epstein questions in US, Democrats say\nMembers of a panel investigating late sex offender Jeffrey Epstein say the former prince should \"come clean\".\n25 mins ago\nUK\nSouth Africa hits back at US refugee plan to favour white Afrikaners\nPretoria rubbishes claims of a white genocide and quotes prominent Afrikaners who dub Trump's plans racist.\n18 hrs ago\nWorld\nHalloween 2025: All the celebrity costumes at Heidi Klum's party\nStars showed out in their Halloween best at Heidi Klum's annual party.\n6 hrs ago\nCulture\nBusinesses are running out of pennies in the US\nFind a penny, pick it up, then what? Now the US has stopped making pennies, a shortage has emerged and created confusion.\n13 hrs ago\nUS & Canada\nUS judges say Trump administration must continue food aid during US shutdown \nIn two separate rulings, US judges said the plan to cut off Snap food benefits for millions of Americans is likely unlawful.\n15 hrs ago\nUS & Canada\nSouth Africa hits back at US refugee plan to favour white Afrikaners\nPretoria rubbishes claims of a white genocide and quotes prominent Afrikaners who dub Trump's plans racist.\n18 hrs ago\nWorld\nNarrow Dodgers win sets up World Series decider\nThe Los Angeles Dodgers bounce back to beat the Toronto Blue Jays 3-1 and set up a deciding seventh game in the World Series after tying the series at 3-3.\n7 hrs ago\nBaseball\nShe's a pop star, he's a former PM - why Katy Perry and Justin Trudeau just might work\nBoth the former Canadian prime minister and the California Girl singer have been through high and lows of public opinion. \n3 hrs ago\nUS & Canada\nHalloween 2025: All the celebrity costumes at Heidi Klum's party\nStars showed out in their Halloween best at Heidi Klum's annual party.\n6 hrs ago\nCulture\nWatch: Deadly rainfall sets record in New York City\nAt least two people were confirmed dead as the deluge submerged roadways and brought down large trees. \nCanada's Carney to visit Xi in China, marking 'turning point' in relations\nFinding it hard to reach a resolution of its trade dispute with the US after Trump suspended talks, Canada turns to other major economies.\nTop Republican rebuffs Trump calls to axe filibuster rule in shutdown standoff\nEnding the long-standing rule would allow Republicans in the Senate to pass a funding bill without Democratic support.\nThe adopted children who fear deportation to a country they can't remember\nThousands of US adoptees do not have citizenship despite being brought to the country as babies decades ago. Now many fear deportation.\nDisney pulls channels from YouTube TV over fee dispute\nESPN, ABC and other Disney channels will not be available to YouTube TV subscribers.\nWatch/Listen\nWatch: Heidi Klum slithers into Halloween as Medusa\nStars turn out in their best Halloween costumes at Heidi Klum's annual party.\n'Give your money away,' Billie Eilish tells billionaires\nThe singer called on the mega wealthy to donate more to charity, during a speech at the WSJ Awards attended by the likes of Mark Zuckerberg and George Lucas.\nWatch: US and China's different reports of their trade meeting\nThe BBC's Laura Bicker explains how the two nation's have reported on the trade negotiations.\nWhat we know about US strikes targeting alleged drug boats\nThe BBC's Bernd Debusmann looks at video clips of the strikes that have killed at least 57 people in the Caribbean and Pacific.\nHas Trump's 'peace deal' solved the Thailand-Cambodia dispute?\nDonald Trump has claimed to have ended another war, this time between Thailand and Cambodia. But what does this latest agreement actually amount to?\nFeatures\nFive ways the shutdown is hurting Americans\nThe fiscal fight means US troops could go without pay, while millions may lose heat and food aid.\nDoes Trump's nuclear testing raise the stakes - or are we already in an arms race?\nExperts tell the BBC a US resumption of nuclear weapons testing would be a radical shift and spark a nuclear arms race.\nTrump's Asia tour sees deals, knee-bending and a revealing final meeting\nHis five-day tour displayed the power of his presidency - but also, at times, that power's limitations.\nXi and Trump find temporary truce as China plays longer game\nTalks have helped to steady a rocky relationship between the world's top two economies - but the rivalry persists.\n‘I have to get what I need right now’: Americans brace for expiry of critical food benefits\nEssential food assistance for millions may run out this weekend due to the government shutdown.\nLatest updates\n3 hrs ago\nShe's a pop star, he's a former PM - why Katy Perry and Justin Trudeau just might work\nBoth the former Canadian prime minister and the California Girl singer have been through high and lows of public opinion. \n3 hrs ago\n5 hrs ago\nNumber of Irish citizens deported from US rises by more than 50%\nNew figures show more Irish citizens are being deported from the US, amid a crackdown by immigration officials. \n5 hrs ago\n13 hrs ago\nBusinesses are running out of pennies in the US\nFind a penny, pick it up, then what? Now the US has stopped making pennies, a shortage has emerged and created confusion.\n13 hrs ago\n15 hrs ago\nSNAP benefits: When will the US government shutdown halt food stamps?\nThe programme helps 40 million low-income Americans afford groceries - but the government shutdown has funds running dry.\n15 hrs ago\n15 hrs ago\nUS judges say Trump administration must continue food aid during US shutdown \nIn two separate rulings, US judges said the plan to cut off Snap food benefits for millions of Americans is likely unlawful.\n15 hrs ago\n15 hrs ago\nTop Republican rebuffs Trump calls to axe filibuster rule in shutdown standoff\nEnding the long-standing rule would allow Republicans in the Senate to pass a funding bill without Democratic support.\n15 hrs ago\n19 hrs ago\nWatch: Pet monkey gets loose inside US Halloween store\nThe owner of the acrobatic primate told police her pet ran off after being frightened by a store display.\n19 hrs ago\n21 hrs ago\nWatch: Deadly rainfall sets record in New York City\nAt least two people were confirmed dead as the deluge submerged roadways and brought down large trees. \n21 hrs ago\n22 hrs ago\nUS strikes on alleged drug boats violate law, UN human rights chief says\nVolker Türk said the strikes were \"unacceptable\" and urged Washington to halt them immediately.\n22 hrs ago\n...",
    "keywords": null
  },
  {
    "url": "https://www.bbc.com/news/uk",
    "domain": "www.bbc.com",
    "publish_date": "2025-11-01T11:14:51.370Z",
    "language": "en-GB",
    "title": "UK | Latest News & Updates | BBC News",
    "description": "Get all the latest news, live updates and content about the UK from across the BBC.",
    "text": "UK | Latest News & Updates\nSkip to content\nAdvertisement\nWatch Live\nAdvertisement\nAndrew should answer Epstein questions in US, Democrats say\nMembers of a panel investigating late sex offender Jeffrey Epstein say the former prince should \"come clean\".\n25 mins ago\nUK\nSoldier's mum says young women should not join Army\nThe mum of soldier who was sexually assaulted says the Army \"protects themselves\" and not recruits.\n41 mins ago\nEngland\nStrictly pros transform into ghouls for Halloween week - and a Celebrity Traitor guest stars\nIt comes as speculation continues over who will replace presenters Tess Daly and Claudia Winkleman.\n11 hrs ago\nCulture\nEgypt's Grand Museum opens, displaying Tutankhamun tomb in full for first time\nThe launch of the billion-dollar site sees fresh calls for the return of antiquities held in museums overseas.\n10 hrs ago\nWorld\nReeves rebuked by PM over 'regrettable' rental confusion but faces no further action\nThe chancellor has apologised for the failure to obtain the correct licence when renting out her family home.\n1 day ago\nPolitics\nSoldier's mum says young women should not join Army\nThe mum of soldier who was sexually assaulted says the Army \"protects themselves\" and not recruits.\n41 mins ago\nEngland\nHomes without lounges now a reality for renters\nNearly a third of homes advertised on a property sharing website had no living room.\n10 hrs ago\nBusiness\nMan found guilty after stabbing policewoman in face\nDeclan Diedrick's \"determination and violence\" was \"truly horrifying\", a senior detective says.\n5 hrs ago\nEssex\nStrictly pros transform into ghouls for Halloween week - and a Celebrity Traitor guest stars\nIt comes as speculation continues over who will replace presenters Tess Daly and Claudia Winkleman.\n11 hrs ago\nCulture\nAsylum seeker jailed for sex attack on woman\nFawaz Alsamaou is warned he is \"highly likely\" to be deported after serving his sentence.\nMedics got me through cancer but they can't help with my menopause\nWhen Kat Denisi was diagnosed with breast cancer at 32 she was put into a medically induced menopause.\nDouble murderer jailed for stabbing pregnant girlfriend\nShaine March is sentenced to life with a minimum term of 42 years for killing Alana Odysseos.\nFormer England goalkeeper Mary Earps announces 'happy' same-sex relationship\nEarps has been supported and encouraged by her former Lionesses teammates to open up about her sexuality.\nPost Office justice measures could include special stamp for victims\nRestorative justice scheme for subpostmasters will offer face-to-face meetings with Fujitsu and Post Office executives.\nWatch/Listen\nWatch: Question Time audience reacts to Andrew news \nA recording of the programme was interrupted on Thursday as the news broke.\nWatch: The moment gang rip cash machine from shop\nFootage has shown the moment a gang used a telehandler to rip a cash machine out of a Sainsbury’s shop front.\nMoment migrant sex offender arrested in London park\nHadush Kebatu was arrested in Finsbury Park after a two-day manhunt.\nWatch: Met Police release new CCTV footage of Hadush Kebatu after mistaken release\nKebatu was set free weeks after being jailed for sexually assaulting a 14-year-old girl and a woman in Epping, Essex, while staying in a hotel.\nFeatures & analysis\n'Nobody owns the sand': The 12-metre fence dividing an affluent beach town\nResidents in Sandbanks are arguing over access to a beach which has been fenced off by homeowners.\nAt 21, I was crushed by a stranger's joke about going bald. Then the way I looked at myself changed\nThere are multiple ways for men to combat hair loss now, but should they have to? \nHow two brothers helped propel grime into the mainstream\nThey changed the face of British music when they formed the label after their rap crew disbanded.\n'Plan your exit like a celebrity' - why young people are being encouraged to write wills\nAt the start of Will Aid, young people are being encouraged to make their dying wishes known.\nMeet the 'silver influencers' taking TikTok and Instagram by storm\nOlder women are carving out a niche online for people who want authentic content.\nMore from the UK\n'Nobody owns the sand': The 12-metre fence dividing an affluent beach town\nResidents in Sandbanks are arguing over access to a beach which has been fenced off by homeowners.\nHomes without lounges now a reality for renters\nNearly a third of homes advertised on a property sharing website had no living room.\nGlasgow firework ban zones come into force for first time\nFirework Control Zones will be in place in Pollokshields, Govanhill and Broomhouse in a bid to curb disorder.\nAsylum seeker jailed for sex attack on woman\nFawaz Alsamaou is warned he is \"highly likely\" to be deported after serving his sentence.\nLatest updates\n25 mins ago\nAndrew should answer Epstein questions in US, Democrats say\nMembers of a panel investigating late sex offender Jeffrey Epstein say the former prince should \"come clean\".\n25 mins ago\n2 hrs ago\nWhy Sarah Ferguson, Beatrice and Eugenie can't escape the taint of family scandal\nThe scandal engulfing Andrew is of his own making but has had a profound impact on his immediate family.\n2 hrs ago\n4 hrs ago\nChannel Islands news quiz - test your knowledge\nWhat can you remember about what happened in Jersey and Guernsey this week?\n4 hrs ago\n18 hrs ago\nHow will Andrew's titles be removed and what happens next?\nThe language of Buckingham Palace's statement is \"very brutal\", royal historian Kelly Swaby tells the BBC.\n18 hrs ago\n18 hrs ago\nWhere might Andrew live on the Sandringham estate?\nThe sprawling Norfolk estate is home to several properties - here is a look at where Andrew might be moving in.\n18 hrs ago\n21 hrs ago\nWhere does the King get his money?\nThe language of Buckingham Palace's statement is \"very brutal\", royal historian Kelly Swaby tells the BBC.\n21 hrs ago\n21 hrs ago\nLand train reaches end of the line\nIts owners say the outpouring of sympathy towards the train has been \"amazing\".\n21 hrs ago\n1 day ago\nIs this finally rock bottom for Mr Andrew Mountbatten Windsor?\nStripping Andrew of the title 'prince' is colossal, says the BBC's royal correspondent Sean Coughlan.\n1 day ago\n1 day ago\nEmmeline Pankhurst's 'radical' Manx mum remembered\nThe Pankhurst Museum swaps Halloween for the Isle of Man tradition of Hop Tu Naa in honour of Sophia Goulden.\n1 day ago\n...",
    "keywords": null
  },
  {
    "url": "https://www.bbc.com/news/world/africa",
    "domain": "www.bbc.com",
    "publish_date": "2025-11-01T11:14:57.371Z",
    "language": "en-GB",
    "title": "Africa | Latest News & Updates | BBC News",
    "description": "Get all the latest news, live updates and content about Africa from across the BBC.",
    "text": "Africa | Latest News & Updates\nAdvertisement\nSamia wins Tanzania election as hundreds feared dead in unrest\nDemonstrations continued on Friday as young protesters denounced the election as unfair. \n1 hr ago\nAfrica\nTanzania poll protesters defy army chief as concern mounts over casualties\nA diplomatic source tells the BBC there is credible evidence that at least 500 people have been killed.\n12 hrs ago\nAfrica\nEgypt's Grand Museum opens, displaying Tutankhamun tomb in full for first time\nThe launch of the billion-dollar site sees fresh calls for the return of antiquities held in museums overseas.\n10 hrs ago\nWorld\nSouth Africa hits back at US refugee plan to favour white Afrikaners\nPretoria rubbishes claims of a white genocide and quotes prominent Afrikaners who dub Trump's plans racist.\n18 hrs ago\nWorld\nApartheid police assault killed Nobel laureate Luthuli, South Africa court rules\nThe court sets aside the 1967 inquest that found that the anti-apartheid hero was hit by a goods train. \n1 day ago\nAfrica\nTanzania poll protesters defy army chief as concern mounts over casualties\nA diplomatic source tells the BBC there is credible evidence that at least 500 people have been killed.\n12 hrs ago\nAfrica\n'I was accused of spying and beaten' - a boy's escape from captured Sudan city\nA 12-year-old tells the BBC that in the chaos he lost contact with his family and is now on his own at a camp.\n10 hrs ago\nAfrica\nMore than 60,000 flee Sudanese city after its capture by RSF militia - UN\nEl-Fasher is under the control of paramilitaries accused of mass executions and crimes against humanity.\n17 hrs ago\nAfrica\nEgypt's Grand Museum opens, displaying Tutankhamun tomb in full for first time\nThe launch of the billion-dollar site sees fresh calls for the return of antiquities held in museums overseas.\n10 hrs ago\nWorld\nSudan civil war\n'We saw people murdered in front of us' - Sudan siege survivors speak to the BBC\nHarrowing accounts from people who have escaped an RSF assault on the besieged city of el-Fasher.\nReports of mass killings in Sudan have echoes of its dark past\nSome are warning of a genocide unfolding in Darfur - violence that is linked to killings there 20 years ago. \nNew videos show executions after RSF militia takes key Sudan city\nRSF troops executed a number of unarmed people after seizing el-Fasher, videos reviewed by BBC Verify show.\nA simple guide to what is happening in Sudan\nSudan was thrown into disarray in 2023 when its army and a paramilitary group began a power struggle.\n'Our children are dying': Rare footage shows plight of civilians in besieged Sudan city\nParents are struggling to feed their children in war-hit Sudan's Darfur region. \nFeatures and analysis\nA coronation not a contest - Tanzania's first female president faces little opposition\nPresident Samia Suluhu Hassan faces no real competition at the polls amid a climate of self-censorship and fear.\nThe 92-year-old president who never loses\nCameroon's Paul Biya has extended his 43-year rule by winning a heavily disputed election.\nAttacks on people like me happen every time my country has an election\nThe false belief that body parts of people with albinism bring wealth or luck have driven attacks.\n'It became one of the children' - Kenyan family on adopting orphaned cheetah cub\nTheir neighbours, who raise livestock, told the family to get rid of the wild animal.\nSudan's fertile region where food is rotting amid famine and war\nThe Jebel Marra area is neutral in the war but its produce cannot get out to feed a hungry nation.\nFinery and frailty: Africa's top shots\nA selection of the week's best photos from across the African continent and beyond.\nAn ex-first lady, a tycoon and a 'safe pair of hands' vie for power in Ivory Coast\nThe fervour of presidential campaigning belies concerns about the political landscape in a cocoa superpower.\n'I eat 6000 calories a day' – The South African 'Rhino' who became World's Strongest Man\nRayno Nel is the first African to win the prestigious title of World's Strongest Man.\nSport\nHolders Nigeria lead qualifiers for 2026 Wafcon\nReigning champions Nigeria qualify for next year's tournament alongside Cape Verde and Malawi who will make their Women's Africa Cup of Nations debut.\nWafcon expansion offers 'great exposure' - Chawinga\nThe expansion of the Women's Africa Cup of Nations is a \"great boost\" to teams that have never qualified for the finals, says Malawi captain Tabitha Chawinga.\n'Football is life' - The Gambian administrator on a mission\nSainey Mboge was labelled a \"bad influence\" as a child, just for playing football. But now the Gambian is having the last laugh, having built a career in the game.\nMarathon record holder Chepngetich given three-year ban\nWomen's marathon world record holder Ruth Chepngetich is banned for three years after the Kenyan admits to anti-doping rule violations.\nWatch/Listen\nWe will never accept stolen votes, says Cameroon opposition leader\nCameroon opposition leader Issa Tchiroma Bakary is adamant that he's the winner of the presidential election.\nTyson hails Congolese roots on Rumble in the Jungle visit\nMike Tyson was a hit with boxing fans in Kinshasa after embracing his African roots as part of ongoing celebrations for the iconic Rumble in the Jungle.\nThousands of grief-stricken mourners attend Raila Odinga's funeral\nThousands of mourners attend the state funeral of former Prime Minister Raila Odinga in Nairobi.\nThe moment Madagascar's new president was sworn in\nColonel Michael Randrianirina is sworn in as the new president of Madagascar at a ceremony in the capital.\nPolice fire tear gas at crowds mourning former Kenyan prime minister\nThousands of mourners fill the streets of Nairobi from the airport to the Kasarani Stadium to pay their respects.\nProgrammes and podcasts\nLive: World Service for Africa\nFocus on Africa Podcast\nThree essential stories to round off your working day. Explaining the news from Africa.\nThis is Africa\nLatest updates\n1 hr ago\nSamia wins Tanzania election as hundreds feared dead in unrest\nDemonstrations continued on Friday as young protesters denounced the election as unfair. \n1 hr ago\n10 hrs ago\n'I was accused of spying and beaten' - a boy's escape from captured Sudan city\nA 12-year-old tells the BBC that in the chaos he lost contact with his family and is now on his own at a camp.\n10 hrs ago\n12 hrs ago\nTanzania poll protesters defy army chief as concern mounts over casualties\nA diplomatic source tells the BBC there is credible evidence that at least 500 people have been killed.\n12 hrs ago\n17 hrs ago\nMore than 60,000 flee Sudanese city after its capture by RSF militia - UN\nEl-Fasher is under the control of paramilitaries accused of mass executions and crimes against humanity.\n17 hrs ago\n1 day ago\nReports of mass killings in Sudan have echoes of its dark past\nSome are warning of a genocide unfolding in Darfur - violence that is linked to killings there 20 years ago. \n1 day ago\n1 day ago\nApartheid police assault killed Nobel laureate Luthuli, South Africa court rules\nThe court sets aside the 1967 inquest that found that the anti-apartheid hero was hit by a goods train. \n1 day ago\n2 days ago\n'We saw people murdered in front of us' - Sudan siege survivors speak to the BBC\nHarrowing accounts from people who have escaped an RSF assault on the besieged city of el-Fasher.\n2 days ago\n2 days ago\nProtests spread across Tanzania after elections marred by unrest\nOpposition supporters are angry that the president's main challengers are in jail or have been disqualified.\n2 days ago\n2 days ago\nSudan RSF chief promises investigation as anger mounts over el-Fasher killings\nThe announcement comes after growing reports of mass killings, including of patients at a hospital.\n2 days ago\n...",
    "keywords": null
  },
  {
    "url": "https://www.bbc.com/news/world/asia",
    "domain": "www.bbc.com",
    "publish_date": "2025-11-01T11:14:57.463Z",
    "language": "en-GB",
    "title": "Asia | Latest News & Updates | BBC News",
    "description": "Get all the latest news, live updates and content about Asia from across the BBC.",
    "text": "Asia | Latest News & Updates\nSkip to content\nAdvertisement\nWatch Live\nAdvertisement\nCruise cancelled following death of woman left behind on island\nThe Coral Adventurer was just two days into a 60-day voyage at the time of Suzanne Rees' death.\n6 hrs ago\nAustralia\nFrom the fringe to the final - India's phenomenon\nOut of the side two weeks ago, Jemimah Rodrigues brings India within touching distance of creating history and bringing home a third world title.\n18 hrs ago\nWorld\nNvidia strikes bumper AI deals with Asia tech giants\nFresh from $5 trillion valuation, global chips giant Nvidia has signed deals with LG, Hyundai and Samsung\n24 hrs ago\nAsia\nTrump hails 'amazing' meeting with China's Xi but no formal trade deal agreed \nThe US president and his Chinese counterpart met face-to-face for the first time in six years.\n2 days ago\nWorld\nIndia-US sign 10-year defence pact amid tariff turmoil\nThis comes as the two countries try to close a trade deal and tide over tense ties after Trump's 50% tariffs on India.\n1 day ago\nWorld\nFrom the fringe to the final - India's phenomenon\nOut of the side two weeks ago, Jemimah Rodrigues brings India within touching distance of creating history and bringing home a third world title.\n18 hrs ago\nWorld\nWhy the Indian passport is falling in global ranking\nIndians can travel to more visa-free destinations than a decade ago, but India's passport ranking has declined.\n10 hrs ago\nAsia\nChina to loosen chip export ban to Europe after Netherlands row\nEU-China chip disputes alarmed carmakers amid concerns it could halt global car productions\n6 hrs ago\nEurope\nNvidia strikes bumper AI deals with Asia tech giants\nFresh from $5 trillion valuation, global chips giant Nvidia has signed deals with LG, Hyundai and Samsung\n24 hrs ago\nAsia\nJapan plans to hire hunters as bear attacks rise\nTwelve people have died and more than a hundred left injured in bear attacks this year.\nFormer Australian politician jailed for more than five years for sex crimes\nGareth Ward, a former independent member for Kiama in NSW, sexually assaulted two men between 2013 and 2015.\nJapanese series that inspired Power Rangers to end after 50 years - reports\nThe franchise is the inspiration for many other superhero shows that have aired in Asia.\nAustralian influencer family move to UK to avoid social media ban\nBeck and Bec Lea say the move will allow their teenage daughter to keep making content.\nK-pop group NewJeans loses legal battle against agency\nA South Korean court rules that the act's contract with the label, which runs until 2029, is valid.\nFeatures\nWatch: US and China's different reports of their trade meeting\nThe BBC's Laura Bicker explains how the two nation's have reported on the trade negotiations.\nXi and Trump find temporary truce as China plays longer game\nTalks have helped to steady a rocky relationship between the world's top two economies - but the rivalry persists.\n'Can't go back' - families in violence-hit Indian state fear resettlement deadline\nFamilies displaced by the ongoing ethnic conflict are anxious as a government deadline to shut down relief camps nears.\nInvestigation after woman left behind by cruise ship dies on island\nCrew of Coral Adventurer only realised the 80-year-old Australian was missing hours after they left Lizard Island on the Great Barrier Reef.\nShould K-beauty products have to come from South Korea?\nSales of Korean skincare treatments continue to soar, but some are now made by overseas companies.\nLatest updates\n10 hrs ago\nWhy the Indian passport is falling in global ranking\nIndians can travel to more visa-free destinations than a decade ago, but India's passport ranking has declined.\n10 hrs ago\n24 hrs ago\nNvidia strikes bumper AI deals with Asia tech giants\nFresh from $5 trillion valuation, global chips giant Nvidia has signed deals with LG, Hyundai and Samsung\n24 hrs ago\n1 day ago\nJapanese series that inspired Power Rangers to end after 50 years - reports\nThe franchise is the inspiration for many other superhero shows that have aired in Asia.\n1 day ago\n1 day ago\nJapan plans to hire hunters as bear attacks rise\nTwelve people have died and more than a hundred left injured in bear attacks this year.\n1 day ago\n1 day ago\n'Can't go back' - families in violence-hit Indian state fear resettlement deadline\nFamilies displaced by the ongoing ethnic conflict are anxious as a government deadline to shut down relief camps nears.\n1 day ago\n2 days ago\nMumbai police rescue 17 children taken hostage at acting school\nThe children had gathered at the building to take part in an audition.\n2 days ago\n2 days ago\nClimate change intensified India's heatwaves in 2024 - Lancet study\nClimate change caused one-third of India’s 2024 heatwave days, worsening health and economic losses.\n2 days ago\n2 days ago\nK-pop group NewJeans loses legal battle against agency\nA South Korean court rules that the act's contract with the label, which runs until 2029, is valid.\n2 days ago\n2 days ago\nShould K-beauty products have to come from South Korea?\nSales of Korean skincare treatments continue to soar, but some are now made by overseas companies.\n2 days ago\n...",
    "keywords": null
  },
  {
    "url": "https://www.bbc.com/news/world/australia",
    "domain": "www.bbc.com",
    "publish_date": "2025-11-01T11:15:07.969Z",
    "language": "en-GB",
    "title": "Australia | Latest News & Updates | BBC News",
    "description": "Get all the latest news, live updates and content about Australia from across the BBC.",
    "text": "Australia | Latest News & Updates\nSkip to content\nAdvertisement\nWatch Live\nAdvertisement\nCruise cancelled following death of woman left behind on island\nThe Coral Adventurer was just two days into a 60-day voyage at the time of Suzanne Rees' death.\n6 hrs ago\nAustralia\nAustralian influencer family move to UK to avoid social media ban\nBeck and Bec Lea say the move will allow their teenage daughter to keep making content.\n1 day ago\nAustralia\nTeenage cricketer dies in Melbourne after being hit by ball \nThe 17-year-old was rushed to hospital on Tuesday and placed on life support but died on Thursday.\n2 days ago\nAustralia\nAustralian girls being 'hunted' by online crime gangs to commit violent acts\nGroups of young men are coercing and exploiting vulnerable girls \"for fun\", Australian police say. \n3 days ago\nTechnology\nMessages in a bottle from WWI soldiers found on Australian coast\nThe notes were thrown overboard just a few days into a voyage to join the battlefields of France more than a century ago.\n3 days ago\nAustralia\nAustralian influencer family move to UK to avoid social media ban\nBeck and Bec Lea say the move will allow their teenage daughter to keep making content.\n1 day ago\nAustralia\nFormer Australian politician jailed for more than five years for sex crimes\nGareth Ward, a former independent member for Kiama in NSW, sexually assaulted two men between 2013 and 2015.\n1 day ago\nAustralia\nCruise operator 'failed' woman who was left on island and died, family says\nKatherine Rees said her mum, 80, had fallen ill during a hike on a remote Australian island and was told to return to the ship by herself.\n2 days ago\nAustralia\nTeenage cricketer dies in Melbourne after being hit by ball \nThe 17-year-old was rushed to hospital on Tuesday and placed on life support but died on Thursday.\n2 days ago\nAustralia\nFeatures & Analysis\nAustralia deports first foreign detainees to Nauru in controversial deal\nThe first transfer of the so-called NZYQ cohort to the tiny Pacific island marks the start of a A$2.5bn agreement between Australia and Nauru.\nSurfboard lost in Tasmania drifts more than 2,400km to New Zealand\nA kitesurfer who found the barnacle-covered board tracked down its owner in Australia.\nFriendly Albanese-Trump meeting masks Australia's creeping doubts about US\nThe talks in Washington were a win for Australia, but at home many are nervous about the relationship.\n'Being gay in men's football is a very toxic place'\nAustralian Josh Cavallo, who moved to England in July to join non-league Peterborough Sports, says football has got \"mountains to do\" to tackle homophobia.\nThe sunscreen scandal shocking Australia - the world's skin cancer hotspot\nIt has shaken consumer trust and raised questions about global sunscreen regulation.\nWatch/Listen\nSlow-motion footage reveals secrets of snake bites\nScientists working out of a venom laboratory in Paris studied which snakes strike their prey fastest.\nTrump to Australian ambassador: 'I don't like you either'\nIn 2020, Kevin Rudd wrote on social media that he believed Trump was the 'most destructive' president in US history. \nWatch: Millions of red crabs begin annual migration on Christmas Island\nThe island off mainland Australia experiences the event every summer, when around 50 million crabs scuttle down from their homes to the beach to lay eggs.\nWatch: Brits row from Peru to Australia in tiny boat\nJess Rowe and Miriam Payne told the BBC how they made the six-month journey unsupported, catching fish and growing their own vegetables.\nWatch: Dolphin calf rescued from fishing line entanglement\nThe mother and calf were spotted in late September, with the young dolphin’s swimming ability noticeably impeded by a fishing line caught around its tail.\nLatest updates\n6 hrs ago\nCruise cancelled following death of woman left behind on island\nThe Coral Adventurer was just two days into a 60-day voyage at the time of Suzanne Rees' death.\n6 hrs ago\n1 day ago\nFormer Australian politician jailed for more than five years for sex crimes\nGareth Ward, a former independent member for Kiama in NSW, sexually assaulted two men between 2013 and 2015.\n1 day ago\n1 day ago\nAustralian influencer family move to UK to avoid social media ban\nBeck and Bec Lea say the move will allow their teenage daughter to keep making content.\n1 day ago\n2 days ago\nTeenage cricketer dies in Melbourne after being hit by ball \nThe 17-year-old was rushed to hospital on Tuesday and placed on life support but died on Thursday.\n2 days ago\n2 days ago\nCruise operator 'failed' woman who was left on island and died, family says\nKatherine Rees said her mum, 80, had fallen ill during a hike on a remote Australian island and was told to return to the ship by herself.\n2 days ago\n3 days ago\nInvestigation after woman left behind by cruise ship dies on island\nCrew of Coral Adventurer only realised the 80-year-old Australian was missing hours after they left Lizard Island on the Great Barrier Reef.\n3 days ago\n3 days ago\nMessages in a bottle from WWI soldiers found on Australian coast\nThe notes were thrown overboard just a few days into a voyage to join the battlefields of France more than a century ago.\n3 days ago\n4 days ago\nAustralia deports first foreign detainees to Nauru in controversial deal\nThe first transfer of the so-called NZYQ cohort to the tiny Pacific island marks the start of a A$2.5bn agreement between Australia and Nauru.\n4 days ago\n4 days ago\nFirst deadly mine explosion in Australia since 2015 kills man and woman\nAnother woman was being treated in hospital for hearing damage and shock \n4 days ago\n...",
    "keywords": null
  },
  {
    "url": "https://www.bbc.com/news/world/europe",
    "domain": "www.bbc.com",
    "publish_date": "2025-11-01T11:15:16.994Z",
    "language": "en-GB",
    "title": "Europe | Latest News & Updates | BBC News",
    "description": "Get all the latest news, live updates and content about Europe from across the BBC.",
    "text": "Europe | Latest News & Updates\nSkip to content\nAdvertisement\nWatch Live\nAdvertisement\nHand of Moscow? The men jailed for vandalism in French hybrid warfare case\nThree Bulgarians are jailed for painting red hands on France's Holocaust Memorial in a suspected case of Russian \"destabilisation\".\n11 hrs ago\nEurope\nDutch centrist Rob Jetten claims victory in neck-and-neck election race\nJetten said his D66 liberal party had achieved a historic result after vote analysis indicated it could not be beaten.\n18 hrs ago\nEurope\nFrance hit by second major heist as thieves target gold refinery\nThieves used explosives to break into a precious metals refinery before making off with a €12m loot. \n14 hrs ago\nEurope\nThousands witness climax of Europe's biggest Halloween carnival\nIt is thought more than 100,000 people have taken part in Derry's Halloween festivities this year.\n15 hrs ago\nNorthern Ireland\nTchéky Karyo, star of Nikita and The Missing, dies at 72\nThe French actor was known for supporting roles in films that spanned nearly 40 years. \n13 hrs ago\nEurope\nDutch centrist Rob Jetten claims victory in neck-and-neck election race\nJetten said his D66 liberal party had achieved a historic result after vote analysis indicated it could not be beaten.\n18 hrs ago\nEurope\nChina to loosen chip export ban to Europe after Netherlands row\nEU-China chip disputes alarmed carmakers amid concerns it could halt global car productions\n6 hrs ago\nEurope\nHotel owner and 10 others jailed for life over deadly Turkish fire\nThe deadliest fire in the country's history killed 78 people, including many children on holiday.\n14 hrs ago\nWorld\nFrance hit by second major heist as thieves target gold refinery\nThieves used explosives to break into a precious metals refinery before making off with a €12m loot. \n14 hrs ago\nEurope\nHow teenager gave a street concert and was caught up in Russia's repressive past\nDiana Loginova sang songs critical of the Kremlin. The 18-year-old and her bandmate are now in court.\nRussia's new nuclear weapons - real threat or Putin bluster?\nThis week alone, the Russian president unveiled two nuclear-capable weapons - but their value may be more symbolic than military.\nLatvian vote to pull out of treaty on protecting women from violence prompts outcry\nSeveral thousand people protested against the vote, and it is now up to the president to decide the next step.\nSixty years after tourist stole skull from cathedral, he sends it back\n\"It's not something you expect,\" says Franz Zehetner, who opened the parcel addressed to Vienna's St Stephen's Cathedral.\nBarcelona's Sagrada Família becomes world's tallest church\nThe Gaudí-designed architectural marvel now stands at an impressive 162.91 metres.\nFeatures & Analysis\nWho is Rob Jetten, tipped to become youngest Dutch prime minister?\nRob Jetten's electoral success has come as a surprise, but politically, all the stars were aligned for him to achieve it.\nIn Russia's 'blitz' of Ukraine, the question of appeasement is back\nA large gulf remains between the US and European view of how to end the Ukraine war.\n​​Women welcome arrest of charity boss identified in BBC sex-for-aid investigation\nSyrian refugees in Turkey allege they were taken advantage of when they were desperate for help.\nThe striking Swedish workers taking on carmaker Tesla\nThe industrial action against the company's operation in Sweden has reached its second anniversary.\nThe 'Heroes of Kharkiv' who saved 48 children from kindergarten hit by Russian drone\nThe story of a dramatic and heroic rescue that has captured the public imagination in Ukraine.\nWatch/Listen\nWatch: Train smashes into truck at Dutch level crossing\nFive people sustained minor injuries but nobody was seriously hurt in the incident in Meteren.\nWatch: Moment nuclear plant towers collapse during demolition\nTwo nuclear cooling towers in the town of Gundremmingen, Germany, collapse into large swirls of thick, white dust during demolition.\n'Heist made it more exciting to go to the Louvre': Tourists react as museum reopens\nThe famous Paris museum reopened on Wednesday, three days after millions of euros worth of jewellery stolen in broad daylight.\nWatch: A 'big moment' for France as Sarkozy jailed\nThe BBC's Paris Correspondent Hugh Scofield says the former French president will reside in a small cell.\nTornado hits Paris suburbs leaving one dead\nA 23-year-old construction worked has been killed after a tornado tore through Val-d'Ois, north of Paris, on Monday, toppling three construction cranes.\nLatest updates\n24 mins ago\nChildren hospitalised after fireworks thrown at asylum accommodation\nIreland's justice minister said fireworks were thrown into a building accommodating people applying for international protection.\n24 mins ago\n1 hr ago\nPolice seize €1.3bn from Campari owner over alleged tax evasion\nThe spirit manufacturer's parent firm is accused of failing to declare a similar amount in tax during a merger.\n1 hr ago\n6 hrs ago\nChina to loosen chip export ban to Europe after Netherlands row\nEU-China chip disputes alarmed carmakers amid concerns it could halt global car productions\n6 hrs ago\n11 hrs ago\nHand of Moscow? The men jailed for vandalism in French hybrid warfare case\nThree Bulgarians are jailed for painting red hands on France's Holocaust Memorial in a suspected case of Russian \"destabilisation\".\n11 hrs ago\n13 hrs ago\nTchéky Karyo, star of Nikita and The Missing, dies at 72\nThe French actor was known for supporting roles in films that spanned nearly 40 years. \n13 hrs ago\n14 hrs ago\nFrance hit by second major heist as thieves target gold refinery\nThieves used explosives to break into a precious metals refinery before making off with a €12m loot. \n14 hrs ago\n18 hrs ago\nDutch centrist Rob Jetten claims victory in neck-and-neck election race\nJetten said his D66 liberal party had achieved a historic result after vote analysis indicated it could not be beaten.\n18 hrs ago\n19 hrs ago\nLatvian vote to pull out of treaty on protecting women from violence prompts outcry\nSeveral thousand people protested against the vote, and it is now up to the president to decide the next step.\n19 hrs ago\n21 hrs ago\nLawyers to lodge legal action over Stardust survivors' compensation\nPhoenix Law plan to lodge an application for judicial review if they do not receive a response that \"meaningful engagement\" had begun on phase two of a redress scheme.\n21 hrs ago\n...",
    "keywords": null
  },
  {
    "url": "https://www.bbc.com/news/world/latin_america",
    "domain": "www.bbc.com",
    "publish_date": "2025-11-01T11:15:24.759Z",
    "language": "en-GB",
    "title": "Latin America | Latest News & Updates | BBC News",
    "description": "Get all the latest news, live updates and content about Latin America from across the BBC.",
    "text": "Latin America | Latest News & Updates\nSkip to content\nAdvertisement\nWatch Live\nAdvertisement\n'We need food, we have no food' - desperation takes hold in Jamaica after hurricane\nPeople in Black River have not seen any aid, telling the BBC that they are fighting to survive.\n9 hrs ago\nWorld\nUS strikes on alleged drug boats violate law, UN human rights chief says\nVolker Türk said the strikes were \"unacceptable\" and urged Washington to halt them immediately.\n22 hrs ago\nUS & Canada\n'The bodies just kept coming' - photographer at deadly Rio police raid\nA witness says residents brought down body after body - some mutilated - after the massive police raid which has left at least 120 dead.\n2 days ago\nLatin America\nAt least 132 killed in Rio police raid, officials say\nThe police operation targeting a criminal gang in a densely-populated area of Rio is the deadliest in the city.\n3 days ago\nLatin America\nUS kills 14 in strikes on four alleged drug boats in Pacific\nMexico's navy is searching for the sole survivor of the latest attack on boats the US says were carrying drugs in both the Pacific and Caribbean.\n4 days ago\nWorld\nUS strikes on alleged drug boats violate law, UN human rights chief says\nVolker Türk said the strikes were \"unacceptable\" and urged Washington to halt them immediately.\n22 hrs ago\nUS & Canada\nThe US bet big with Argentina bailout - is it paying off?\nUS Treasury Secretary Scott Bessent has called the Argentine peso \"undervalued\". But not many people agree. \n1 day ago\nWorld\nHurricane death toll rises as Jamaica aid effort struggles\nThe devastating storm claimed nearly 50 lives when it swept Haiti and Jamaica this week. \n20 hrs ago\nLatin America\n'The bodies just kept coming' - photographer at deadly Rio police raid\nA witness says residents brought down body after body - some mutilated - after the massive police raid which has left at least 120 dead.\n2 days ago\nLatin America\nFeatures & Analysis\nJamaicans take stock after hurricane causes damage, flooding and power cuts\nWith communication networks in Jamaica crippled, the true scale of the disaster remains unknown.\nWhat makes Melissa such a dangerous storm?\nMelissa's 185 mph winds at landfall means it could eclipse all storms the island has experienced before.\n'Brothers in the forest' - the fight to protect an isolated Amazon tribe\nPeru's Mashco Piro face a struggle to survive in the 21st Century, but locals want to help them.\nWarships, fighter jets and the CIA - what is Trump's endgame in Venezuela?\nPresident Trump says he wants to tackle the drugs trade but many believe he is trying to dislodge President Nicolas Maduro.\nWhat's at stake as Trump boat strikes strain US-Colombia alliance\nA major rift threatens to upend an alliance that has been targeting drug traffickers for years. \nWatch/Listen\n'No inch here was spared': Hurricane Melissa destroys Jamaica town\nThe BBC’s Nada Tawfik reports from Black River, where the strongest storm to hit the country in modern history has left scenes of desperation.\nJamaica's 'ground zero' - Assessing hurricane damage in Black River\nThe southwest of the island bore the full force Hurricane Melissa's 185 mph (295km/h) winds on Tuesday.\n'Everything's gone' - BBC finally able to access one of Jamaica's worst-hit areas\nBuildings, power lines, and a church once visited by King Charles are down in the tourism hub of Falmouth.\nWhat we know about US strikes targeting alleged drug boats\nThe BBC's Bernd Debusmann looks at video clips of the strikes that have killed at least 57 people in the Caribbean and Pacific.\nHurricane Melissa floods and destroys towns across Caribbean\nAt least four people in Jamaica are confirmed dead and at least 20 people have died in Haiti flooding.\nLatest updates\n20 hrs ago\nWatch: BBC is on the ground in hard hit Santa Cruz, Jamaica\nThe BBC's Nada Tawfik reports on how the Jamaican Red Cross plans to aid recovery efforts in the wake of Hurricane Melissa.\n20 hrs ago\n20 hrs ago\nHurricane death toll rises as Jamaica aid effort struggles\nThe devastating storm claimed nearly 50 lives when it swept Haiti and Jamaica this week. \n20 hrs ago\n1 day ago\nJamaica's 'ground zero' - Assessing hurricane damage in Black River\nThe southwest of the island bore the full force Hurricane Melissa's 185 mph (295km/h) winds on Tuesday.\n1 day ago\n2 days ago\nBefore and after: Satellite images reveal hurricane devastation in Jamaica\nThe images reveal how the Category 5 hurricane caused devastation in some of Jamaica's communities. \n2 days ago\n2 days ago\n'Everything's gone' - BBC finally able to access one of Jamaica's worst-hit areas\nBuildings, power lines, and a church once visited by King Charles are down in the tourism hub of Falmouth.\n2 days ago\n2 days ago\n'The bodies just kept coming' - photographer at deadly Rio police raid\nA witness says residents brought down body after body - some mutilated - after the massive police raid which has left at least 120 dead.\n2 days ago\n2 days ago\nUK charters flights to get Britons out of Jamaica\nForeign Secretary Yvette Cooper says \"many British nationals were there\" during the hurrican's devastation.\n2 days ago\n2 days ago\nHurricane leaves trail of destruction across Caribbean \nThe storm has been downgraded from a Category 5 to a Category 2 storm but is gathering speed. \n2 days ago\n3 days ago\nJamaicans take stock after hurricane causes damage, flooding and power cuts\nWith communication networks in Jamaica crippled, the true scale of the disaster remains unknown.\n3 days ago\n...",
    "keywords": null
  },
  {
    "url": "https://www.bbc.com/news/world/middle_east",
    "domain": "www.bbc.com",
    "publish_date": "2025-11-01T11:15:27.775Z",
    "language": "en-GB",
    "title": "Middle East | Latest News & Updates | BBC News",
    "description": "Get all the latest news, live updates and content about the Middle East from across the BBC.",
    "text": "Middle East | Latest News & Updates\nSkip to content\nAdvertisement\nWatch Live\nAdvertisement\nIsraeli military's top lawyer resigns over leak of video allegedly showing abuse of Palestinian detainee\nMaj Gen Yifat Tomer-Yerushalmi was facing an investigation into how the video at a detention facility holding detainees from Gaza was leaked last year.\n22 hrs ago\nMiddle East\nEgypt's Grand Museum opens, displaying Tutankhamun tomb in full for first time\nThe launch of the billion-dollar site sees fresh calls for the return of antiquities held in museums overseas.\n10 hrs ago\nWorld\nIsraeli troops kill municipal worker in south Lebanon raid\nThe operation, which Israel says was aimed at Hezbollah, draws a furious response from the Lebanese government.\n2 days ago\nMiddle East\nCan the Gaza ceasefire deal survive?\nIts prospects depend heavily on the continuing engagement of the Trump White House, writes Frank Gardner.\n3 days ago\nWorld\nIsraeli strikes in Gaza kill 104, health ministry says, after Hamas accused of killing soldier\nUS President Trump says \"nothing\" will jeopardise the two-week-old ceasefire despite the flare-up of violence. \n3 days ago\nMiddle East\nEgypt's Grand Museum opens, displaying Tutankhamun tomb in full for first time\nThe launch of the billion-dollar site sees fresh calls for the return of antiquities held in museums overseas.\n10 hrs ago\nWorld\nIsrael confirms identities of hostages' bodies returned by Hamas\nThe bodies were identified as those of Amiram Cooper and Sahar Baruch, the Israeli prime minister's office said.\n1 day ago\nMiddle East\nHundreds of thousands of ultra-Orthodox Israelis protest against conscription\nDemonstrators take to the streets over changes to an exemption from military service in one of the biggest protests of its kind for years.\n2 days ago\nMiddle East\nIsraeli troops kill municipal worker in south Lebanon raid\nThe operation, which Israel says was aimed at Hezbollah, draws a furious response from the Lebanese government.\n2 days ago\nMiddle East\nIsrael says coffin from Hamas did not contain another hostage's body\nIsrael accuses Hamas of a \"clear violation\" of the ceasefire deal after tests showed the remains belonged to a person whose body was previously returned.\nBrother of journalist killed in occupied West Bank says new report reveals cover-up\nShireen Abu Akleh died after she was fired on during a raid at Jenin refugee camp in May 2022.\nFreed Israeli hostage forced to dig own grave is 'growing back to his old self', father says\nEvyatar David's health is \"improving every day\", his father says as his son and two other hostages freed by Hamas are discharged from hospital.\nInternational troops won't want to enforce Gaza peace, says King of Jordan\nKing Abdullah tells the BBC there would need to be peace in Gaza before any international forces were deployed.\nInside Syria's jail for IS suspects as officials say attacks by group are rising\nKurdish counter-terrorism officials tell the BBC so-called Islamic State cells in Syria are regrouping and increasing attacks.\nFeatures\nGaza doctors struggle to investigate 'signs of torture' on unnamed dead returned by Israel\nPhotographs show bodies with multiple signs of injury and wrists tied behind their backs.\nNew images show Israeli control line deeper into Gaza than expected\nIsrael has placed boundary markers up to 520m deeper inside Gaza than expected under the ceasefire deal with Hamas.\nIsrael's 'yellow line' in Gaza gives Netanyahu room for manoeuvre\nIsraeli forces have pulled back to a boundary which leaves Israel in control of most of Gaza - keeping far-right ministers on Netanyahu's side, for now.\n'I'm 89 and I saw my homeland rebuilt before - but now I don't believe Gaza has a future'\nOne Palestinian family shares their story of life coming full circle - and what they believe lies ahead as talk turns to rebuilding Gaza\nA lucky cat, a tattered football: The things Gazans kept close during two years of war\nThe BBC speaks to Palestinians about the keepsakes and essentials they have held on to.\nWatch/Listen\nWatch: UN official says Gaza ruins 'like Hiroshima' \nHumanitarian chief Tom Fletcher talk to the BBC about scenes of despair he witnessed on a recent trip to the costal enclave. \n'We're turning the tide on Gaza starvation crisis' - UN aid chief\nTom Fletcher told the BBC more aid trucks were entering Gaza, but that it was a \"huge job\" to get vital supplies to those in need.\nWatch: Freed detainee finds family alive after thinking they had been killed\nShadi Abu Sido told the BBC an Israeli prison officer said his family had been killed.\n'We want to raise our children': Life in Gaza after hostages and prisoners released\nThe United Nations Development Programme (UNDP) says over 80% of all buildings in the territory are destroyed or damaged.\nWatch: Netanyahu responds to Trump remark that he's not 'the easiest' to work with\nCBS News, the BBC's US partner, conducted an exclusive interview with the Israeli prime minister in a hospital tending to freed hostages.\nLatest updates\n22 hrs ago\nIsraeli military's top lawyer resigns over leak of video allegedly showing abuse of Palestinian detainee\nMaj Gen Yifat Tomer-Yerushalmi was facing an investigation into how the video at a detention facility holding detainees from Gaza was leaked last year.\n22 hrs ago\n1 day ago\nIsrael confirms identities of hostages' bodies returned by Hamas\nThe bodies were identified as those of Amiram Cooper and Sahar Baruch, the Israeli prime minister's office said.\n1 day ago\n1 day ago\nWho are the released hostages?\nThe Israeli military says 20 living hostages have been released by Hamas and have returned to Israel.\n1 day ago\n2 days ago\nOlympics and Saudi Arabia abandon esports Games deal\nThe event, planned for 2027, has been cancelled by mutual agreement, according to a statement.\n2 days ago\n2 days ago\nUK pledges £4m to clear land mines to help flow of aid in Gaza\nIt will allow a UN body to clear land mines and allow the safe passage of aid to Palestinians.\n2 days ago\n2 days ago\nHundreds of thousands of ultra-Orthodox Israelis protest against conscription\nDemonstrators take to the streets over changes to an exemption from military service in one of the biggest protests of its kind for years.\n2 days ago\n2 days ago\nIsraeli troops kill municipal worker in south Lebanon raid\nThe operation, which Israel says was aimed at Hezbollah, draws a furious response from the Lebanese government.\n2 days ago\n2 days ago\nDependants of some Gazan students can join them in UK, government says\nThe decision is a reversal of the original policy which only supported the evacuation of the students themselves.\n2 days ago\n3 days ago\nIsraeli strikes in Gaza kill 104, health ministry says, after Hamas accused of killing soldier\nUS President Trump says \"nothing\" will jeopardise the two-week-old ceasefire despite the flare-up of violence. \n3 days ago\n...",
    "keywords": null
  },
  {
    "url": "https://www.bbc.com/news/in_pictures",
    "domain": "www.bbc.com",
    "publish_date": "2025-11-01T11:15:37.861Z",
    "language": "en-GB",
    "title": "In Pictures | Latest News & Updates | BBC News",
    "description": "Get all the latest news, live updates and content about In Pictures from across the BBC.",
    "text": "In Pictures | Latest News & Updates\nSkip to content\nAdvertisement\nWatch Live\nAdvertisement\nWinning entries for Wildlife Photographer of the Year 2025\nSouth African photographer Wim van den Heever takes the main prize for his shot\n14 Oct 2025\nIn Pictures\nUrban Wildlife: Autumn in Cardiff and the Vale of Glamorgan\nPhotographer Gildas Griffiths captures the wildlife in his local area as he goes for a walk.\n10 Oct 2025\nTrump and Melania meet royals at Windsor\nPresident Trump greeted by the King and Queen and other senior royals at Windsor Castle.\n18 Sep 2025\nUK\nShots of Chappell Roan, Charli XCX and Doja Cat up for music photo award\nAbbey Road studios' nominees for its Music Photography Awards had 20,000 submissions from 30 countries. \n9 Sep 2025\nBlood Moon captivates sky-gazers around the world\nDuring a total lunar eclipse the Moon passes through the Earth's shadow, taking on a deep red hue. \n7 Sep 2025\nScience & Environment\nUrban Wildlife: Autumn in Cardiff and the Vale of Glamorgan\nPhotographer Gildas Griffiths captures the wildlife in his local area as he goes for a walk.\n10 Oct 2025\nHow the Manchester synagogue attack unfolded\nPolice say a car was driven at members of the public during an incident in the Crumpsall area.\n2 Oct 2025\nManchester\nChequers, scout groups and a dolls' house - day two of Trump's state visit\nDay two of US President Donald Trump's second state visit\n18 Sep 2025\nUK\nTrump and Melania meet royals at Windsor\nPresident Trump greeted by the King and Queen and other senior royals at Windsor Castle.\n18 Sep 2025\nUK\nFeatures\nDocumentary photographer's unseen work on display\nA gallery tracks down the portrait subjects of Chris Killip's Askam-in-Furness series.\nMcCartney bedroom selfie in Beatles photo exhibit\nBehind the scenes photos taken by Paul Mccartney during the rise of Beatlemania are going on show.\nPhotographer showcases her work at French Celtic Festival\nJoann Randles' photography will be at display at the world's largest Celtic gathering.\nLegendary photographer Sebastião Salgado dies at 81\nHe was known for dramatic and unflinching black-and-white images of hardship, conflict and natural beauty.\nPhotographer spends decade capturing back garden wildlife\nAndrew Fusek Peters has spent a decade capturing the images in a celebration of Britain's wildife.\nYour pictures\nYour pictures on the theme of 'my best photo'\nImages from our readers on the theme of \"my best photo\".\nYour pictures on the theme of 'monochrome' \nImages on the theme of \"monochrome\" sent in by our readers.\nWe set the theme, you take the pictures\nEach week, we ask you to send in your pictures on a set theme and a selection of these are then published each Thursday on our In pictures page\nYour pictures on the theme of 'glass'\nImages on the theme of \"glass\" sent in by our readers.\nYour pictures on the theme of 'winter walks'\nImages from our readers on the theme of \"winter walks\".\nLatest updates\n14 Oct 2025\nPictured: Winning entries for Wildlife Photographer of the Year 2025\nSouth African photographer Wim van den Heever takes the main prize for his shot\n14 Oct 2025\n7 Oct 2025\nDazzling supermoon illuminates skylines around the world\nFrom Paris to Taipei, this week's supermoon - also known as the Harvest and Hunter's moon - captured in photos. \n7 Oct 2025\n2 Aug 2025\nLiverpool Street photo exhibit showcases railway\nThe Lens on the Line exhibit features 17 images of the railway from across the country. \n2 Aug 2025\n19 Apr 2025\n2025 Sony World Photography Awards: Winners revealed\nSony Photography Awards winner explores the tension between artificial spaces and environmental destruction.\n19 Apr 2025\n22 Mar 2025\nYour pictures on the theme of 'my best photo'\nImages from our readers on the theme of \"my best photo\".\n22 Mar 2025\n8 Mar 2025\nYour pictures on the theme of 'monochrome' \nImages on the theme of \"monochrome\" sent in by our readers.\n8 Mar 2025\n28 Feb 2025\nPoplar trees, the Pope and paddling: Photos of the week\nA selection of news photographs from around the world.\n28 Feb 2025\n25 Feb 2025\nYour pictures on the theme of 'glass'\nImages on the theme of \"glass\" sent in by our readers.\n25 Feb 2025\n21 Feb 2025\nCarts, catwalk and carnival: Photos of the week\nA selection of news photographs from around the world. \n21 Feb 2025\n...",
    "keywords": null
  },
  {
    "url": "https://www.bbc.com/news/bbcindepth",
    "domain": "www.bbc.com",
    "publish_date": "2025-11-01T11:15:41.062Z",
    "language": "en-GB",
    "title": "BBC InDepth - In depth and expert analysis from BBC News",
    "description": "Thought-provoking analysis from our top journalists that informs, feeds your curiosity, and helps you make sense of a complex world.",
    "text": "BBC InDepth - In depth and expert analysis from BBC News\nMartha Kearney: I'm worried about Britain’s wildflowers - so I planted a meadow\nThe decline in UK wildflower meadows not only threatens wildlife, say experts, but could drive up certain food prices\n1 day ago\nBBC InDepth\nHow China really spies on the UK\nThe national security threats China poses today go beyond traditional notions of espionage - in this new world, threats are far more complex\n2 days ago\nBBC InDepth\nAre facial recognition cameras in Sainsbury's a step too far?\nThe £5.30 orange juice that tells the story of why supermarket prices are sky high\nButter, chocolate, coffee and milk have all seen prices rocket. Tracing back through the story of one particular supermarket staple begins to explain why\n22 Oct 2025\nBBC InDepth\nHamas ruled Gaza with an iron rod - will it really give up control?\nHamas is diminished but far from spent - Israel may have to deal with it for some time to come\n20 Oct 2025\nBBC InDepth\nHow China really spies on the UK\nThe national security threats China poses today go beyond traditional notions of espionage - in this new world, threats are far more complex\n2 days ago\nBBC InDepth\nThese robots can clean, exercise - and care for you in old age. Would you trust them to?\nIt sounds like something from a sci-fi film - but some scientists believe this clever new tech could help alleviate strains on the UK care system\n4 days ago\nBBC InDepth\nWhy so many UK homes are still dangerously mouldy - years after this toddler died\nDespite outcry over a British toddler’s death, mould remains a problem in many homes - so are new law changes enough?\n5 days ago\nBBC InDepth\nAre facial recognition cameras in Sainsbury's a step too far?",
    "keywords": null
  },
  {
    "url": "https://www.bbc.com/news/bbcverify",
    "domain": "www.bbc.com",
    "publish_date": "2025-11-01T11:15:41.268Z",
    "language": "en-GB",
    "title": "BBC Verify | Latest News & Updates | BBC News",
    "description": "Get all the latest news, live updates and content about BBC Verify from across the BBC.",
    "text": "BBC Verify | Latest News & Updates\nInvestigations\nBBC Verify Live\nUS politics\nDisinformation\nRos Atkins on...\nUS news\nUK politics\nLatest updates",
    "keywords": null
  },
  {
    "url": "https://www.bbc.com/news/articles/c3dnnpvjkjvo",
    "domain": "www.bbc.com",
    "publish_date": "2025-11-01T08:27:52.369Z",
    "language": "en-GB",
    "title": "Andrew should answer Jeffrey Epstein questions in US, Democrats say",
    "description": "Members of a panel investigating late sex offender Jeffrey Epstein say the former prince should \"come clean\".",
    "text": "Andrew should answer Jeffrey Epstein questions in US, Democrats say\nGetty Images\nAndrew was stripped of his title as a prince on Thursday\nMembers of a US congressional committee investigating the Jeffrey Epstein case have intensified their calls for Andrew Mountbatten Windsor to answer questions about his links to the late sex offender.\nKing Charles stripped his brother of his \"prince\" title on Thursday, following months of pressure over Andrew's ties to Epstein. Andrew has always denied wrongdoing.\nAt least four Democrat members of the House Oversight Committee have since renewed their calls for Andrew to testify - although the panel is controlled by Republicans, who have not indicated they would support the move.\nCongressman Suhas Subramanyam told the BBC: \"If he wants to clear his name, if he wants to do right by the victims, he will come forward\".\nAndrew could appear remotely, have a lawyer present and could speak to the panel privately, Subramanyam said.\n\"Frankly, Andrew's name has come up many times from the victims,\" he told Radio 4's Today programme on Saturday. \n\"So he clearly has knowledge of what happened and we just want him to come forward and tell us what he knows.\"\nHe added: \"No matter who it is - American or not - everyone should be looked at.\"\nFellow committee member Raja Krishnamoorthi told BBC Newsnight he would be willing to formally summon Andrew with a subpoena - although he conceded this would be difficult to enforce while he was outside of the US. \nEverything we know about Andrew losing titles and Windsor mansion\nVirginia Giuffre's family speak to BBC: \"She'd be so proud\"\nRead the King's statement in full\nWatch: Question Time audience reacts to news\nIs this finally rock bottom for Andrew Mountbatten Windsor?\nWhy Sarah Ferguson, Beatrice and Eugenie can't escape the taint of family scandal\nWhere does the King get his money?\nHe said on Friday: \"However, if Andrew wishes to come to the United States or he's here, then he's subject to the jurisdiction of the US Congress, and I would expect him to testify.\"\nHe added: \"At the end of the day, we want to know exactly what happened, not just to give justice to the survivors, but to prevent this from ever happening again.\"\n\"Come clean. Come before the US Congress, voluntarily testify. Don't wait for a subpoena. Come and testify and tell us what you know.\"\nCongressman Stephen Lynch also told the BBC hearing from Andrew \"might be helpful in getting justice for these survivors\" but said the committee would be unable to subpoena him \"as the situation stands\".\nMeanwhile, Liz Stein - one of Epstein's accusers - said Andrew should \"take some initiative\" and help US investigators.\nShe told BBC Breakfast on Saturday: \"A lot of us are curious as to why he's unwilling to cooperate and be questioned about his involvement with Epstein.\"\n\"If he has nothing to hide, then why is he hiding?\"\n\"We know he had a longstanding friendship with Epstein and that he was in his social circle - so he may have seen things during his involvement with Epstein that he could speak to.\"\nAnother of Epstein's accusers, Anouska De Georgiou, likewise told Newsnight Andrew should appear before Congress, saying \"it would be appropriate for him to be treated the same as anybody else would be treated\".\nGetty Images\nLiz Stein said Andrew should step in and help investigators \nIt comes after UK trade minister Chris Bryant told the BBC Andrew should go to the US to answer questions about Epstein's crimes if invited, \"just as with any ordinary member of the public\".\nMeanwhile, the police watchdog said it had approached the Metropolitan Police to ask whether there are matters it should be looking into, in light of media reports about Andrew.\nThe Independent Office for Police Conduct said it had contacted Scotland Yard's Directorate of Professional Standards last week - which oversees internal investigations into misconduct - and had not yet received any referrals.\nReports emerged in mid-October that Andrew sought to obtain personal information about his accuser Virginia Giuffre through his police protection in 2011. He has not commented on the allegation.\nSeparately, new court documents published in the US on Friday showed that Andrew wrote in an email in 2010 that it would be \"good to catch up in person\" with Epstein, after he was released from prison for soliciting prostitution from a minor.\nThe pair were then pictured together in Central Park in New York in December 2010, in a meeting that Andrew later told the BBC was to break off their friendship.\nAndrew's ties to Epstein were at the centre of Thursday's decision, with the Palace announcement stating: \"These censures are deemed necessary, notwithstanding the fact that he continues to deny the allegations against him.\"\n\"Their Majesties wish to make clear that their thoughts and utmost sympathies have been, and will remain with, the victims and survivors of any and all forms of abuse.\"\nIn recent weeks, pressure had increased on the monarchy to resolve the issue of Charles's brother.\nIn early October, emails which re-emerged from 2011 showed Andrew in contact with Epstein months after he claimed their friendship had ended.\nA posthumous memoir by Virginia Giuffre was also released - repeating allegations that, as a teenager, she was forced to have sex with Andrew on three separate occasions, claims he has always denied.\nAnd earlier this week, the King was heckled about the matter.\n1999/2000\nMs Giuffre starts working at the spa in Donald Trump’s Mar-a-Lago resort in Florida\nSummer 2000\nUnder the guise of training to be a massage therapist, Ghislaine Maxwell takes the 16-year-old Ms Giuffre to meet Jeffrey Epstein at his home near the resort, where she says she was raped\n2000\nStill 16, Ms Giuffre leaves Mar-a-Lago under pressure from Epstein, who hires her as a massage therapist. He allegedly subjects her to regular abuse and trafficks her to other men\nMarch 2001\nEpstein and Maxwell take Ms Giuffre to London to meet Andrew. Ms Giuffre later says Maxwell pressures her into sex with the prince. Andrew has always denied the claims\n2001 – 2002\nMs Giuffre is forced to have sex with Andrew two more times, she later claims, at Epstein’s New York mansion and private Caribbean island, allegations the prince again denies\nFebruary 2011\nThe Mail on Sunday publishes a photo of Ms Giuffre’s first meeting with Andrew. He later says he has no recollection of it being taken\nDecember 2014\nIn a Florida court filing, Ms Giuffre describes being trafficked by Epstein to Andrew and forced to have sex with him and other men. The judge later throws the claims out as “immaterial and impertinent” to the case against Epstein\nNovember 2019\nAndrew denies having sexual contact with Ms Giuffre in a now-infamous interview on BBC Newsnight\n9 August 2021\nMs Giuffre files a civil lawsuit in New York accusing Andrew of sexual abuse when she was 16 and 17\n8 March 2022\nAndrew pays a financial settlement to Ms Giuffre to end the civil court case, denying any wrongdoing\n25 April 2025\nMs Giuffre dies by suicide in Neergabby, Western Australia\nOctober 2025\nMs Giuffre’s memoir details her experiences with Epstein, Maxwell, and the then-Prince Andrew, who is subsequently stripped of his titles and privileges to become Andrew Mountbatten Windsor\nAlthough Andrew denies the accusations, the Royal Family considers there have been \"serious lapses of judgement\" in his behaviour.\nAs well as losing his titles and honours, he was ordered to move out of his Windsor mansion - Royal Lodge - and into a property on the King's Norfolk estate, paid for by the monarch.\nThe BBC understands that he will not have to move out immediately, and could move to Sandringham as late as the new year.\nOn Saturday, a black Land Rover with a number plate ending DOY was seen leaving Bishops Gate near Royal Lodge just before 08:00 GMT.\nOnly a driver was in the vehicle as it left the grounds of Windsor Great Park. Andrew has previously been pictured driving a vehicle with the same private number plate.",
    "keywords": null
  },
  {
    "url": "https://www.bbc.com/news/articles/cy8vrzpgxnro",
    "domain": "www.bbc.com",
    "publish_date": "2025-10-31T19:21:48.330Z",
    "language": "en-GB",
    "title": "Andrew: Why Sarah Ferguson, Beatrice and Eugenie can't escape the taint of family scandal",
    "description": "The scandal engulfing Andrew is of his own making but has had a profound impact on his immediate family.",
    "text": "Why Sarah Ferguson, Beatrice and Eugenie can't escape the taint of family scandal\nNoor NanjiCulture reporter\nGetty Images\nThe scandal that has engulfed Andrew is of his own making, but it has had a profound impact on his immediate family: his ex-wife Sarah Ferguson, and their two daughters.\nMs Ferguson, 66, has been haunted by her own links with convicted sex offender Jeffrey Epstein.\nShe will now move out of Royal Lodge and will make her own living arrangements, although it's believed she won't be moving to Sandringham in Norfolk with Andrew.\nPrincesses Beatrice, 37, and Eugenie, 35, will retain their titles, as they are the daughters of the son of a Sovereign.\nBut questions have also been raised about whether they can disentangle themselves from their parents' mess.\nGetty Images\nSarah Ferguson and Andrew were divorced in 1996 but live together at Royal Lodge\nMs Ferguson, who lost her duchess title when Andrew gave up his Duke of York title a few weeks ago, had, until recently, sidestepped the firing line of the controversy around Epstein.\nBut in September, several charities dropped her as patron or ambassador after the emergence of an email from 2011 in which she called Epstein her \"supreme friend\" and seemed to apologise for her public criticism of him.\nThe only charity she is still linked with is her own foundation, Sarah's Trust.\nIt used to have a \"duchess collection\" - a range of products including tea and biscuit sets to raise funds for the charity - but the website for that is no longer active.\nIts causes include supporting vulnerable communities, including \"forgotten women\" globally.\nBBC News has made multiple attempts to contact the charity to ask if such a cause is appropriate given Ms Ferguson's ties to Epstein. But the phone number listed is not recognised, and emails bounced back.\nWe raised this with the Charity Commission, who said one of its team has been in touch with the charity reminding it to keep their contact details up to date.\nFollow live updates on this story\nEverything we know about Andrew losing titles and Windsor mansion\nVirginia Giuffre's family speak to BBC: \"She'd be so proud\"\nWatch: Question Time audience reacts to news\nIs this finally rock bottom for Andrew Mountbatten Windsor?\nAway from her philanthropy, Ms Ferguson has various business ventures, and has written several children's books, non-fiction about Queen Victoria, and her own memoirs.\nHer latest children's book, which was due to be published on 9 October according to a press release in Bookseller, is now showing as available from 28 November on Amazon.\nWaterstones bookstores told BBC News that the publication date for Flora And Fern: Kindness Along The Way, had \"moved\" and that they didn't have a new publication date.\nHer publisher, New Frontier Publishing, has not responded to a request for comment.\nHowever, one industry source told the BBC that \"it would be an entirely sensible decision\" to delay publication.\nMs Ferguson's other publishers have remained tight-lipped when asked whether they plan to sever links with her.\nHarper Collins, which has published two of her titles, the most recent being A Most Intriguing Lady which came out in 2023, declined to comment but pointed to the fact that both her books remain in print and available.\n\"Publishers don't tend to drop authors, they just quietly don't renew contracts,\" said Neill Denny, editor of the book trade news website Book Brunch.\nHe said that while there has been speculation that Ms Ferguson, or indeed Andrew, could write a tell-all memoir, \"I think the publishers would be wary of taking on the ex Duchess of York's story.\"\nNoor Nanji explains what will happen to Andrew's family now he's no longer a prince.\nAs for Beatrice and Eugenie, they have kept their princess title - which will be a small victory for Andrew, who will have wanted to protect his daughters, even at his own expense.\nBoth appear to have escaped the UK this week.\nBeatrice was pictured at an investment summit in Saudi Arabia. Her family have long-held links to the Middle East and she also recently appeared in a promotional picture for a UAE bank.\nMeanwhile, Eugenie was pictured in Paris with friends.\nAnd while there has been some sympathy for the princesses, they also haven't been able to completely avoid the scandals around their parents.\nEarlier this week, a picture resurfaced showing Epstein, Ghislaine Maxwell and Harvey Weinstein at Beatrice's 18th birthday party in Windsor.\nThe Telegraph also reported a leaked email from Epstein to his UK-based lawyer that suggested Ms Ferguson and the princesses visited Epstein in New York after he was released from prison in 2009.\nA source close to Ms Ferguson insisted that neither she nor her daughters had any recollection of such a visit, according to the newspaper.\nX/@SunilSharmaUK\nPrincess Beatrice was spotted in attendance at the Future Investment Initiative in Riyadh this week\nIn 2018, Beatrice told British Vogue in a joint interview with her sister: \"We are young women trying to build careers and have personal lives, and we're also princesses and doing all of this in the public eye.\"\nThe princesses are not working royals, and both have jobs - Beatrice founded advisory firm BY-Eq, while Eugenie works at the gallery Hauser & Wirth.\nBoth are married with children, with Beatrice splitting her time between her Cotswolds property and an apartment in St James' Palace. Eugenie lives between Portugal and a property in the grounds of Kensington Palace.\nOn Friday night, royal sources said the late Queen's corgis are still going to be looked after by Andrew, Sarah and their daughters - although it's uncertain whose home they will reside in.\nBoth princesses also have their philanthropic endeavours. Eugenie set up the anti-slavery collective, a charity whose focus includes victims of sex trafficking. According to the most recently available accounts, it has raised £1.5m in donations last year but has so far distributed very little, with £1.3m carried forward.\nBBC News approached the charity to ask for a comment in light of the latest controversy surrounding Andrew and Epstein, but it has not responded.\nGetty Images\nThe princesses pictured with their father at the wedding of Harry and Meghan in 2018\nAt the end of this tumultuous week, there are still many unanswered questions.\nFamily time will clearly be harder now. Andrew is moving to Norfolk, which means he is no longer close by to his daughters and grandchildren. \nMs Ferguson - who maintained a close relationship with Andrew and lived at Royal Lodge with him, despite their divorce in 1996 - will also now move home.\nOn Saturday, The Times reported that Andrew \"finally\" agreed to leave his Windsor mansion, after it became apparent his ex-wife was going to move out.\nMs Ferguson's representatives declined to comment when asked by BBC News.\nFor now, it is unclear where she will move to. She recently sold her Belgravia flat, which she purchased for £4.2m. It is still listed in her name on Land Registry records, but her spokesperson confirmed to BBC News that the sale has gone through.\nAnd then there's a question mark over Christmas.\nIt's been previously announced that Andrew would be excluded from the traditional royal family gathering which takes place in Sandringham at Christmas.\nWhere Ms Ferguson will be is also not clear.\nBut either way, the princesses will face a choice, whether to spend it with their parents, their in-laws, or the wider Royal Family.\nWhat they decide may be telling. With the York brand now tainted beyond repair, who they choose to celebrate with may be a sign of who they will align with in future.",
    "keywords": null
  },
  {
    "url": "https://www.bbc.com/news/articles/c4gpwn5v072o",
    "domain": "www.bbc.com",
    "publish_date": "2025-10-31T14:07:53.393Z",
    "language": "en-GB",
    "title": "Halloween 2025 party: Heidi Klum's party, Demi Lovato and Megan Thee Stallion",
    "description": "Stars showed out in their Halloween best at Heidi Klum's annual party.",
    "text": "Heidi Klum's party, Demi Lovato and Megan Thee Stallion\nHalloween 2025: All the celebrity costumes at Heidi Klum's party\nRishma Dosani and \nAnnabel Rackham,culture reporter\nWatch: Heidi Klum slithers into Halloween as Medusa\nIt is officially the scariest night of the year and, while everyone in Hollywood and beyond has been showing off their elaborate costumes, there is one party we're all watching. \nHeidi Klum has cemented her place as the official Queen of spooky season thanks to her wild, weird and wonderful costumes and her annual bash that attracts celebrities across the globe. \nShe had kept fans on their toes all day, dropping snippets of her costume on Instagram in the lead up to her party - despite being one of the last arrivals of the night - and she did not disappoint.\nFollowing her notorious worm and peacock costumes in recent years, the Project Runway star took her animal theme to new levels as a bright green, and pretty hideous, Medusa. \nShe slithered up the carpet with several moving snakes protruding from her intricate headpiece, sticking her vile tongue out at the waiting photographers.\nAlthough she warned fans that her costume would be \"very ugly\", this probably isn't what anyone expected.\nGetty Images\nHeidi Klum's Medusa turned her husband Tom Kaulitz to stone \nHeidi collaborated with Oscar-nominated make-up artist Mike Marino once again to pull off her costume, with a team of more than 35 people working hard to ensure she had all eyes on her.\nAs the festivities continue, here is a look at some of the most impressive outfits at Heidiween 2025 and beyond.\nBut it's not all about Hollywood (or Heidiwood). Even politicians are getting in on the action, including President Trump, who is hosting a party at his Florida home.\nLike Heidi, her husband Tom Kaulitz, is never one to shy away from playing dress up. \nHe was by her side arriving to the party as a man who was unfortunately turned to stone after looking directly at Medusa. \nThe Tokio Hotel musician committed to the bit by posing with his weapon and shield raised, suggesting Medusa's appearance caught him by surprise moments before his demise.\nGetty Images\nRapper Ice-T and his wife and model Coco arrived at Heidi's party looking terrifying\nIce-T and Coco Austin have never shied away from going all out for Halloween, and are regulars at Heidi's annual bash. This year was no different as the rapper looked menacing in a red hooded jumpsuit, hiding his face with a blood-splattered white mask. He had a selection of weapons on hand to make his costume truly terrifying.\nModel Coco also got the horror memo in a bright red wig and denim bodysuit, with Chucky's tagline: \"Wanna play?\" scrawled across the front, layered on top of a striped, long-sleeved turtleneck top. \nGetty Images\nYouTuber James Charles carried his head on the carpet \nYouTuber James Charles carried his own head as he made his way into the party, reminiscent of Jared Leto's red carpet arrival at the 2019 Met Gala.\nThe beauty vlogger put his own spin on things as a \"headless horseman\" and even filmed a make-up tutorial on Instagram for his unique accessory.\nGetty Images\nGlee star Darren Criss and his wife Mia Swier went for a Shrek theme\nDarren Criss may have taken some inspiration from his host as he donned a Shrek costume, including bright green face paint, a prosthetic nose and huge stomach, which he patted in front of the cameras.\nNot quite as epic as when Heidi did the same in 2018, the Glee star switched his efforts up with tartan red trousers alongside wife Mia Swier - who chose not to be his Princess Fiona, but instead Puss in Boots, complete with a black cape and a hair thong.\nGetty Images\nOlympian Ilona Maher stunned on the carpet as a real-life Barbie \nOlympian Ilona Maher was a real-life vintage Barbie at Klum's Halloween party, modelling a strapless sparkly custom black Undone by Kate gown. She accessorized simply with black opera gloves and a chunky gold necklace.\nUnveiling her outfit on Instagram, the rugby player proudly posed with her very own Barbie doll, as well as a handkerchief emblazoned with the phrase: \"Beast. Beauty. Brains. Barbie.\"\nGetty Images\nUS actress La La Anthony (pictured with Damson Idris) was among the other stars attending early Halloween parties this week\nNot every costume has gone down well, with some saying that US model Julia Fox's costume as a blood-soaked Jackie Kennedy was in poor taste.\nOthers have been more popular. \nSinger Demi Lovato recreated her \"Poot Lovato\" meme which went viral on Tumblr in 2015 - a reference to her alter-ego who has been locked in a basement.\nOther highlights on social media include Kim Kardashian and Kanye West's daughter North West and her friends dressing up as Japanese kawaii-metal band BABYMETAL.\nGetty Images\nActress Teyana Taylor referenced her role in recent Oscar-tipped movie One Battle After Another\nGetty Images\nUS model Julia Fox attracted criticism for dressing as a blood-soaked Jackie Kennedy at a party in New York on Thursday\nGetty Images\nComedian Amelia Dimoldenberg depicted herself as the divorce of Lily Allen and David Harbour\nContent creator and media personality Amelia Dimoldenberg never takes the easy option when it comes to dressing up for Halloween and this devilish costume certainly looks like it required some effort.\nThe night earlier, on the eve of Halloween, she went to a party in New York as the divorce of singer Lily Allen and Stranger Things actor David Harbour. Dressed as Harbour's sheriff character, she listened to the latest Allen album, which references their breakup. \nAnd singer Ed Sheeran dressed up as Pennywise the clown, Stephen King's character from It.\nMeanwhile, US Vice-President JD Vance wore a wig as he became the bizarre meme-version of himself. That same meme is alleged to have gotten a Norwegian tourist banned from the US earlier this year.\nX/@JDVance\nUS Vice President JD Vance poked fun at memes that depict him in his Halloween costume",
    "keywords": null
  },
  {
    "url": "https://www.bbc.com/news/articles/cn09r01k9yqo",
    "domain": "www.bbc.com",
    "publish_date": "2025-11-01T01:04:19.402Z",
    "language": "en-GB",
    "title": "Why Katy Perry and Justin Trudeau just might work",
    "description": "Both the former Canadian prime minister and the California Girl singer have been through high and lows of public opinion. ",
    "text": "Why Katy Perry and Justin Trudeau just might work\nShe's a pop star, he's a former PM - why Katy Perry and Justin Trudeau just might work\nNadine Yousif,senior Canada reporter, and \nNardine Saad,in Los Angeles\nGetty Images / PA\nIt is a pairing that few could have predicted: a former Canadian prime minister and an American pop star who has toured the world and reached the edge of space.\nJustin Trudeau and Katy Perry have made it official. The couple were spotted holding hands in Paris last weekend as they left the Crazy Horse cabaret, where they had been celebrating Perry's 41st birthday.\nWhile they may seem an unlikely duo, Trudeau and Perry – who have both been in the spotlight for the better part of the last decade – have more in common than some might think. And their budding romance is not entirely unprecedented in Canadian political history.\nThe pairing also allows them to change the conversation after a year in which both have faced hits to their reputations.\nThe relationship is a \"rebranding for both of them in a very interesting and unexpected way\", says Jose Rodriguez, a professor of communication studies at California State University Long Beach.\nPartnering with a statesman creates a credible bridge for Perry into civic and philanthropic endeavours, he adds. It expands her audience and access to a politically engaged public, and global organisations outside the music industry.\nFor Trudeau, 53, the California Girls singer helps his new persona because she is in \"a softer arena\", Mr Rodriguez says, rather than the tough world of politics.\nAt the core of it is simple human connection, too, observers note. Both are newly single - Trudeau and his wife separated in 2023 - and this is the first post-split high-profile romance for both.\nChanging the conversation\nThe romance rumours between them began swirling in late July, when the two were spotted having dinner together at Le Violon, a swanky restaurant in the heart of Montreal. \nTwo days later, Trudeau was spotted attending Perry's show in the city, singing along to her hits Firework and Teenage Dream.\nThen, in mid-October, images of them kissing aboard Perry's yacht off the coast of Santa Barbara, California, went viral.\nNeither Trudeau nor Perry have publicly spoken about their romance. Their representatives did not respond to the BBC's requests for comments. But before the weekend photos landed, the singer appeared to hint at the relationship during a London tour stop last month.\nA fan in the audience proposed to her shortly after photos of her and Trudeau canoodling surfaced.\n\"You know, you really should have asked me about 48 hours ago,\" Perry responded.\nEven though many may not have seen it coming, observers say their getting together helps serve their individual public images.\nGetty Images\nTrudeau resigned in January after nearly a decade in power due to his plummeting popularity in Canada\nAfter becoming a global progressive icon when he was catapulted into Canada's highest office in 2015, Trudeau was forced to resign earlier this year after his popularity plummeted.\nDespite winning a sweeping majority a decade ago - promising \"sunny ways\" domestically while being admired for his youthful charm abroad - it did not take long for scandals to tarnish his image.\nA series of luxury vacations drew criticism for being tone-deaf - including one trip to the private island of the Aga Khan in the Bahamas, which was found to have violated federal conflict-of-interest laws. Trudeau then faced another controversy in 2019 after old photos of him in blackface surfaced, forcing him to issue a public apology.\nBy the end of his tenure, Canadians had grown frustrated with his leadership and were ready to move on.\nPerry has similarly faced a crop of undesirable headlines after riding high for years.\nThe singer was enjoying the height of pop stardom in the 2010s, churning out consistent hits, and her bold, colourful style helped define pop culture. In 2018, Billboard magazine named her one of the greatest popstars of the 21st Century. \nBut scandal found her, too. Her newest album, 143, was panned by critics as her worst artistic effort to date. The Guardian called it \"some way short of a total catastrophe\", while the Telegraph called it \"disastrous\".\nAnd earlier this year, she was mocked for taking part in an all-woman Blue Origin space flight with billionaire Jeff Bezos' wife Lauren Sanchez and CBS anchor Gayle King. Perry acknowledged the criticism in April, saying \"I'm not perfect\" but that \"the internet is very much a dumping ground for the unhinged and unhealed\".\nGetty Images\nJustin Trudeau and Sophie Grégoire Trudeau announced their split after 18 years of marriage in 2023\nThen came the split between her and Bloom, who she was with after her marriage to comedian Russell Brand fell apart in 2011.\n\"When you're in the middle of an unfortunate storyline, the best thing you can do is move onto a different storyline,\" notes Los Angeles Times pop music critic Mikael Wood.\nThe relationship with Trudeau \"changes the subject from a flop album and from a tour that seemed a little thirsty and misguided, and makes us talk about something else\".\nThe measured roll-out of the relationship also seemed to ease observers into the romance. \nProf Rodriguez notes that the optics of them appearing together in Paris was \"a high signal, low speech confirmation\" of their affection that allowed the visuals to do the work. \n\"Each has weathered scrutiny, so a carefully staged relationship narrative can re-index attention around vitality, optimism and cross-domain relevance.\"\nA match made in heaven?\nThe pair do have things in common.\nPerry and Trudeau are ideologically aligned, LA-based music writer Gerrick Kennedy observes, being \"anti-establishment\" disruptors in their respective fields.\nPerry herself is no stranger to activism and politics, having performed at multiple campaign events in 2016 for Democratic US presidential candidate Hillary Clinton, and publicly endorsed Kamala Harris in the 2024 election. \nShe is a vocal advocate for LGBTQ rights and has supported various feminist charities and causes - issues that Trudeau had also publicly backed (he famously made gender-parity in cabinet central to his policy).\nThey also each appear to be dedicated parents to their young children. Perry's four-year-old daughter, Daisy, features frequently on her Instagram. Trudeau's Instagram shows he spent the summer taking each of his three children on separate holidays.\nGetty Images\nKaty Perry recently ended a nine-year relationship with actor Orlando Bloom, with whom she shares a daughter\nBy dating Perry, Trudeau is charting a different path post-politics than his predecessors, who often assume high-level consulting gigs or join law firms. \nIt is, however, on-brand for a prime minister who was always unusual, says Michael Mulvey, a marketing professor at the University of Ottawa.\nAs the son of another former prime minister, Pierre Eliott Trudeau, he grew up in the spotlight. One of the earliest photos of him is of an infant Justin being held by former US First Lady Pat Nixon.\nAfter the separation from his wife, the youngest Trudeau could not escape the inevitable comparisons to his father, who also separated from his first wife and the mother of his children, Margaret, while in office.\nThe senior Trudeau had his own famous flings, namely with American singer Barbra Streisand and Canadian actress Kim Cattrall, of Sex and the City fame.\n\"There's no question that we see history repeating itself,\" says Jonathan Malloy, a professor of political science at Carleton University in Ottawa.\nBut Prof Mulvey notes that there are others who connect with his human experience of being a newly single dad.\nNot long after his exit from politics, Trudeau posted a photo of himself buying kitchenware, which commentators took as him signalling the start of his \"divorced dad era\".\n\"There are probably some people that hope he gets it together, has a cooling off period from the post-divorce trauma and gets on with his life,\" Prof Mulvey says.",
    "keywords": null
  },
  {
    "url": "https://www.bbc.com/news/articles/c0jdd186l0go",
    "domain": "www.bbc.com",
    "publish_date": "2025-10-31T23:55:33.508Z",
    "language": "en-GB",
    "title": "Desperation in Black River, Jamaica, after Hurricane Melissa",
    "description": "People in Black River have not seen any aid, telling the BBC that they are fighting to survive.",
    "text": "Desperation in Black River, Jamaica, after Hurricane Melissa\n'We need food, we have no food' - desperation takes hold in Jamaica after hurricane\nBrandon Drenonin Black River, Jamaica \nWatch: BBC reports from \"ground zero\" of Hurricane Melissa's destruction\nPeople walk along muddied roads scavenging the wreckage for food. Others jump into damaged stores in the hope of finding bottled water or other supplies. \nAs the death toll rises, residents of Black River are still searching for loved ones while they also battle to survive, days after Hurricane Melissa made this Jamaican port city ground zero of the devastation seen across the Caribbean. \nResidents here say they have been living in a state of chaos the last three days since Melissa slammed into them as one of the most powerful category five storms ever recorded in the region.\nThe fierce winds and storm surge that barrelled through here have decimated nearly everything, leaving roads unusable and a trail of destruction that has them increasingly desperate and isolated with no electricity or running water.\nCapsized boats lie kerbside. Brick buildings are split in half. Giant sheets of metal are twisted between tree branches. Vehicles sit in crumbled pieces. \nResidents who spoke to the BBC said they have seen no aid trucks in the area so far and described having to eat what food they can find in debris by the roads in the coastal town, nearly 150km (93 miles) west of the capital, Kingston. \nOthers made their way inside battered supermarkets, taking what they could for themselves. Some, who climbed on top of one partially destroyed market, tossed food and bottles of water down below, where people gathered with arms outstretched.\nBrandon Drenon / BBC\n\"We have to use whatever we see here, on the street and also in the supermarket,\" Demar Walker explained, sitting in a shaded area down the street from the store to escape the heat and 80% humidity.\nHe said he and others had to climb into the market due to its roof caving in and took what they could. They tossed water and items to others also in need.\n\"We didn't be selfish, we had to throw food to other people.\"\nNearby, others told the BBC of a local pharmacy being looted in Black River, describing anarchy as people ran in and out carrying armfuls of drugs and alcohol.\n\"I saw items covered in mud being hauled out,\" Aldwayne Tomlinson told the BBC. \"At first, I thought the place was still open, but then I really got a second glance.\n\"I heard a lady say: 'Mi need go get some alcohol.' That's when I knew they were looting the pharmacy as well.\"\nBrandon Drenon / BBC\nDemar Walker was one of many looking for resources at a damaged store \n'We need food' \nA short walk from the market, Jimmy Esson leaned against a massive metal beam that had been knocked to the ground.\n\"I lost everything, all my things,\" he said. \"We need food. We have no food.\"\nSurvival is the primary concern on most people's minds here. The other is the rising death toll. Officials in Jamaica said on Thursday that at least 19 people had died in the country, a big jump from the five that had been counted the day before. Another 30 have died in neighbouring Haiti due to the storm.\nBrandon Drenon / BBC\nJimmy Esson says he lost everything in the storm \n\"My community, we have dead bodies there,\" Mr Walker said.\nHe said he, like many others in the area, still has not heard from family and doesn't know if they made it out of the storm alive. Mr Walker is stuck in Black River, sleeping in whoever's house is still standing that will accept him, he says, while his eight-year-old son is in Westmoreland, the next parish over.\nWestmoreland shares Jamaica's western coast, along with Black River in the St Elizabeth parish, and was also severely damaged by Melissa.\n\"There's no way of getting to my family to find out if they're OK,\" he said as his eyes began to swell. Along with the unusable roads making travel difficult, there is little to no cell phone service and no electricity or running water in many hard-hit spots.\nBrandon Drenon / BBC\nDemar Walker has not been able to contact his eight-year-old son since the storm\n\"The entire town of Black River is devastated,\" the town's Mayor Richard Solomon has said. \nHe noted to local media the desperation of residents who are looting and - while not condoning it - said he understood why it was happening.\n\"It is a delicate balance,\" Solomon said of the response to it. \"Persons are seizing the opportunity to pick up what they can off the ground [from damaged stores]. However, you have others being a little bit more forceful, where they are trying to get into people's properties to get all sorts of supplies.\"\nLocal officials estimate that 90% of the houses here were destroyed. Much of the town's vital infrastructure has been destroyed too, including the local hospital, police station and fire station.\n\"There are entire communities that seem to be marooned and areas that seem to be flattened,\" Information Minister Dana Morris Dixon said.\nAid supplies are starting to arrive more rapidly to the main airport in Kingston, but smaller regional airports - some of which are located near where humanitarian assistance is most needed - remain only partly operational.\nAid agencies and the military are bringing in the urgently needed supplies from Kingston by land but many roads remain unpassable in places, including in places like Black River.\nThe town is about a two-hour drive from Kingston but the main road in is - at various points - flooded, damaged and clogged with cars.\nMichael Tharkurdeen, a local medic, was in the town's fire station when the storm hit.\n\"We were upstairs, the entire bottom floor was flooded. The water was around maybe four feet going five feet. When the water came in, the seas came in, flooded everywhere,\" he said.\n\"Nobody could be on the bottom floor. Trust me, there were waves there about this high,\" he added, pointing to his shoulder.\nPeople who did make it to him from the flooded-out buildings nearby arrived in bad condition. They had \"lacerations on their hands, their feet\", he says. \"Kids, elders, everybody.\"\nMr Tharkurdee also found a man \"lifeless\" and with \"no pulse\" once the flood waters receded.\nBrandon Drenon / BBC\n\"I'm not a doctor, I'm a medic, so I couldn't pronounce him dead,\" he said. \"All we could have done was document that and cover his body.\"\nBy mid-afternoon on Friday, a fleet of military helicopters flew into Black River - with many hoping they came with desperately needed supplies.\nArmed officials carrying machine guns descended onto the streets and soon the crowds rummaging the looted pharmacy and grocery store had cleared. A line of cars that had jammed the sole road in the area had been cleared.\nA relative quiet replaced the noise and chaos of hundreds of people fighting for their survival.\n\"St Elizabeth, we want it to come back again,\" Shawn Morris said of the area's future and his hopes to get aid here.\n\"It's not about the money,\" he said. \"We need food and water.\"",
    "keywords": null
  },
  {
    "url": "https://www.bbc.com/news/articles/cm2ww0e0jewo",
    "domain": "www.bbc.com",
    "publish_date": "2025-11-01T06:47:50.488Z",
    "language": "en-GB",
    "title": "Tanzania election: Samia Suluhu Hassan wins vote as hundreds feared dead in unrest",
    "description": "Demonstrations continued on Friday as young protesters denounced the election as unfair. ",
    "text": "Samia Suluhu Hassan wins vote as hundreds feared dead in unrest\nPresident Samia Suluhu Hassan has been declared the winner of Tanzania's presidential election, securing another term in office amid days of unrest across the country.\nAccording to the electoral commission, Samia won 98% of the votes, nearly sweeping the 32 million ballots cast in Wednesday's election.\nInternational observers have expressed concern over the lack of transparency and widespread turmoil that has reportedly left hundreds people dead and hundreds injured.\nThe nationwide internet shutdown is making it difficult to verify the death toll. The government has sought to play down the scale of the violence - and authorities have extended a curfew in a bid to quell the unrest.\n\"I hereby announce Samia Suluhu Hassan as the winner of the presidential election under the Chama Cha Mapinduzi (CCM) party,\" Jacobs Mwambegele, the electoral chief, said while announcing the results on Saturday morning.\nSamia secured about 31.9 million votes, or 97.66% of the total, with turnout nearing 87% of the country's 37.6 million registered voters, the electoral chief said. \nIn Tanzania's semi-autonomous archipelago of Zanzibar - which elects its own government and leader - CCM's Hussein Mwinyi, who is the incumbent president, won with nearly 80% of the vote.\nThe opposition in Zanzibar said there had been \"massive fraud\", the AP news agency reported.\nMwinyi's swearing-in ceremony is under way at Amaan Complex stadium in Zanzibar. \nTanzania's first female president faces little opposition\nWhy elections are a time of fear for albino Tanzanians\nHow Samia's hesitant reforms are fuelling Tanzanian political anger\nProtests continued on Friday, as demonstrators in the port city of Dar es Salaam and other cities took to the streets, tearing down Samia's posters and attacking police and polling stations despite warnings from the army chief to end the unrest.\nNo protests were reported on Saturday morning, but tension remained high in Dar es Salaam, where security forces manned roadblocks across the city.\nThe demonstrations are mostly led by young protesters, who have denounced the election as unfair.\nThey accuse the government of undermining democracy by suppressing the main opposition leaders - one is in jail and another was excluded on technical grounds.\nA spokesperson from the opposition Chadema party on Friday told AFP news agency that \"around 700\" people had been killed in clashes with security forces, while a diplomatic source in Tanzania told the BBC there was credible evidence that at least 500 people had died.\nForeign Minister Mahmoud Kombo Thabit has described the violence as a \"few isolated pockets of incidents here and there\" and said \"security forces acted very swiftly and decisively to address the situation\".\nIn a statement, the UN chief Antonio Guterres said he was \"deeply concerned\" about the situation in Tanzania, \"including reports of deaths and injuries during the demonstrations\". He urged all parties involved to \"prevent further escalation\".\nThe UK, Canada and Norway have expressed similar concerns, citing \"credible reports of a large number of fatalities and significant injuries, as a result of the security response to protests\".\nThere were two main opposition contenders - Tundu Lissu, who is being held on treason charges, which he denies, and Luhaga Mpina of the ACT-Wazalendo party - but he was excluded on legal technicalities.\nSixteen fringe parties, none of whom have historically had significant public support, were allowed to run.\nSamia's ruling party, CCM, and its predecessor Tanu, have dominated the country's politics and have never lost an election since independence.\nAhead of the election, rights groups condemned government repression, with Amnesty International citing a \"wave of terror\" involving enforced disappearances, torture, and extrajudicial killings of opposition figures.\nThe government rejected the claims, and officials said the election would be free and fair.\nSamia came into office in 2021 as Tanzania's first female president following the death of President John Magufuli.",
    "keywords": null
  },
  {
    "url": "https://www.bbc.com/news/articles/cly44qwgnx0o",
    "domain": "www.bbc.com",
    "publish_date": "2025-11-01T05:31:42.696Z",
    "language": "en-GB",
    "title": "China to loosen chip export ban to Europe following Netherlands row",
    "description": "EU-China chip disputes alarmed carmakers amid concerns it could halt global car productions",
    "text": "China to loosen chip export ban to Europe following Netherlands row\nReuters\nBeijing has said it will loosen a chip export ban it imposed after Dutch authorities took over Nexperia - a Chinese-owned chipmaker based in the Netherlands.\nIn September, the Netherlands used a Cold War-era law to take over the company and prevent the chips from becoming unavailable in an emergency, citing \"serious governance shortcomings\".\nChina said in response that it would not re-export completed Nexperia chips to Europe, raising concern among carmakers. One association had described the move as \"alarming\". \nAround 70% of chips made in the Netherlands are sent to China to be completed and re-exported to other countries. \nChina said in a statement on Saturday that it would \"comprehensively consider the actual situation of enterprises and grant exemptions to exports that meet the criteria\". However, it has not specified what that could entail. \nIt also went on to criticise the Hague for what it called \"improper interference in the internal affairs of enterprises\" and blamed it for \"the current disruption of global production and supply chains\".\nThe Dutch-controlled firm told customers it would stop sending chips back to China to be processed, according to a letter this week seen by the Reuters news agency.\nLast month, the European Automobile Manufacturers' Association (ACEA) had warned Nexperia chip supplies would only last a few weeks unless the Chinese ban was lifted.\n\"Without these chips, European automotive suppliers cannot build the parts and components needed to supply vehicle manufacturers and this therefore threatens production stoppages,\" the group said.\nThe latest plans by Beijing to relax its export controls have emerged after US President Donald Trump and Chinese counterpart Xi Jinping met in South Korea earlier this week.\nTrump later said the leaders discussed chips, while Beijing's post-meeting readout did not explicitly mention any area of trade.\nThe White House is expected to release a fact sheet later on Saturday detailing its new trade agreement with China. Reuters reports that it will also announce the resumption of Nexperia exports.\nIn December 2024, the US government placed Chinese chip manufacturer Wingtech on its so-called \"entity list\", identifying the company as a national security concern.\nIn the UK, Nexperia was forced to sell its silicon chip plant in Newport after MPs and ministers expressed national security concerns. It currently owns a UK facility in Stockport.",
    "keywords": null
  },
  {
    "url": "https://www.bbc.com/news/articles/ckg4q403rpzo",
    "domain": "www.bbc.com",
    "publish_date": "2025-11-01T01:19:28.608Z",
    "language": "en-GB",
    "title": "Egypt's Grand Museum opens, displaying Tutankhamun tomb in full for first time",
    "description": "The launch of the billion-dollar site sees fresh calls for the return of antiquities held in museums overseas.",
    "text": "Egypt's Grand Museum opens, displaying Tutankhamun tomb in full for first time\nYolande Knell,Middle East correspondent, in Cairo, and \nWael Hussein,in Cairo\nGetty Images\nThe new museum will show all of the artefacts discovered by Howard Carter and his team in the tomb of Tutankhamun \nNear one of the Seven Wonders of the Ancient World - the Great Pyramid of Khufu at Giza - Egypt is officially opening what it intends as a cultural highlight of the modern age.\nThe Grand Egyptian Museum (GEM), described as the world's largest archaeological museum, is packed with some 100,000 artefacts covering some seven millennia of the country's history from pre-dynastic times to the Greek and Roman eras.\nProminent Egyptologists argue that its establishment strengthens their demand for key Egyptian antiquities held in other countries to be returned – including the famed Rosetta Stone displayed at the British Museum.\nA main draw of the GEM will be the entire contents of the intact tomb of the boy king Tutankhamun, displayed together for the first time since it was found by British Egyptologist Howard Carter. They include Tutankhamun's spectacular gold mask, throne and chariots.\nReuters\nThe museum is packed with some 100,000 artefacts, including a statue of King Ramses II\n\"I had to think, how can we show him in a different way, because since the discovery of the tomb in 1922, about 1,800 pieces from a total of over 5,500 that were inside the tomb were on display,\" says Dr Tarek Tawfik, president of the International Association of Egyptologists and former head of the GEM.\n\"I had the idea of displaying the complete tomb, which means nothing remains in storage, nothing remains in other museums, and you get to have the complete experience, the way Howard Carter had it over a hundred years ago.\"\nCosting some $1.2bn (£910m; €1.1bn), the vast museum complex is expected to attract up to 8m visitors a year, giving a huge boost to Egyptian tourism which has been hit by regional crises.\n\"We hope the Grand Egyptian Museum will usher in a new golden age of Egyptology and cultural tourism,\" says Ahmed Seddik, a guide and aspiring Egyptologist by the pyramids on the Giza Plateau.\nApart from the Tutankhamun exhibit and a new display of the spectacular, 4,500-year-old funerary boat of Khufu - one of the oldest and best-preserved vessels from antiquity - most of the galleries at the site have been opened to the public since last year.\n\"I've been organising so many tours to the museum even though it was partially open,\" Ahmed continues. \"Now it will be at the pinnacle of its glory. When the Tutankhamun collection opens, then you can imagine the whole world will come back, because this is an iconic Pharoah, the most famous king of all antiquity.\"\n\"It's an absolute must-see,\" says Spanish tourist, Raúl, who is awaiting the full public opening on 4 November. \n\"We're just waiting to go and check out all of the Egyptian artefacts,\" says Sam from London, who is on an Egypt tour. \"It's a once in a lifetime opportunity.\"\nGetty Images\nThe majority of the museum, including the Grand Staircase, has been open to the public since last year\nAnother British tourist says she previously saw the Tutankhamun exhibits on display at the neoclassical Egyptian Museum in bustling Tahrir Square. \n\"The old museum was pretty chaotic, and it was a bit confusing,\" she comments. \"Hopefully the Grand Museum will be a lot easier to take in and I think you will just get more out of it.\"\nThe new museum is colossal, spanning 500,000 square metres (5.4m sq ft) – about the size of 70 football pitches. The exterior is covered in hieroglyphs and translucent alabaster cut into triangles with a pyramid shaped entrance.\nAmong the GEM showstoppers are a 3,200-year-old, 16m-long suspended obelisk of the powerful pharaoh, Ramesses II, and his massive 11m-high statue. The imposing statue was moved from close to the Cairo railway station in 2006, in a complex operation in preparation for the new institution.\nA giant staircase is lined with the statues of other ancient kings and queens and on an upper floor a huge window offers a perfectly framed view of the Giza pyramids.\nThe museum was first proposed in 1992, during the rule of President Hosni Mubarak, and construction began in 2005. It has now taken nearly as long to complete as the Great Pyramid, according to estimates.\nReuters\nThe vast complex is expected to attract up to eight million visitors a year\nThe project was hit by financial crises, the 2011 Arab Spring – which deposed Mubarak and led to years of turmoil - the Covid-19 pandemic, and regional wars.\n\"It was my dream. I'm really happy to see this museum is finally opened!\" Dr Zahi Hawass, Egypt's former long-time minister of tourism and antiquities, tells the BBC. The veteran archaeologist says it shows that Egyptians are equals of foreign Egyptologists when it comes to excavations, preservation of monuments and curating museums.\n\"Now I want two things: number one, museums to stop buying stolen artefacts and number two, I need three objects to come back: the Rosetta Stone from the British Museum, the Zodiac from the Louvre and the Bust of Nefertiti from Berlin.\"\nDr Hawass has set up online petitions – attracting hundreds of thousands of signatures – calling for all three items to be repatriated.\nThe Rosetta Stone, found in 1799, provided the key to deciphering hieroglyphics. It was discovered by the French army and was seized by the British as war booty. A French team cut the Dendera Zodiac, an ancient Egyptian celestial map, from the Temple of Hathor in Upper Egypt in 1821. Egypt accuses German archaeologists of smuggling the colourfully painted bust of Nefertiti, wife of Egyptian pharaoh Akhenaten, out of the country more than a century ago.\n\"We need the three objects to come as a good feeling from these three countries, as a gift, as Egypt gave the world many gifts,\" Dr Hawass says.\nGetty Images\nThe Dendera Zodiac is currently in the Louvre but the opening of the Grand Egyptian Museum has renewed calls for it to be returned\nAnother leading Egyptologist, Dr Monica Hanna, names the same objects, \"taken under a colonialist pretext\", as ones which must be repatriated. She adds: \"The GEM gives this message that Egypt has done its homework very well to officially ask for the objects.\"\nThe British Museum told the BBC that it had received \"no formal requests for either the return or the loan of the Rosetta Stone from the Egyptian Government\".\nEgyptian Egyptologists voice their excitement about the new museum becoming a centre for academic research, driving new discoveries.\nAlready, Egyptian conservators based there have painstakingly restored items belonging to Tutankhamun, including his impressive armour made of textiles and leather. According to Egyptian law, such restorations can only be done by Egyptians.\n\"Colleagues from around the world have been in awe of the fantastic conservation work that has been done,\" says Dr Tawfik, adding that the entire project is a source of great national pride. \"As well as ancient Egyptian history, we are also showcasing modern Egypt because it's Egypt that built this museum.\"",
    "keywords": null
  },
  {
    "url": "https://www.bbc.com/news/articles/c5y44ly3vg2o",
    "domain": "www.bbc.com",
    "publish_date": "2025-11-01T05:29:58.808Z",
    "language": "en-GB",
    "title": "Cruise cancelled following death of woman left behind on island",
    "description": "The Coral Adventurer was just two days into a 60-day voyage at the time of Suzanne Rees' death.",
    "text": "Cruise cancelled following death of woman left behind on island\nAFP via Getty Images\nLizard Island is about 250km (155 miles) north of Cairns\nA 60-day cruise around Australia has been cancelled days after the death of an elderly female passenger who was left behind by the ship on a remote island.\nSuzanne Rees had been hiking on Lizard Island with fellow passengers from the Coral Adventurer, but broke off from the group for a rest. The ship left without her and returned several hours later after the crew realised the woman was missing.\nA major search operation found her body the following day.\nThe Australian Maritime Safety Authority (Amsa) is investigating the incident, alongside Queensland Police and the state coroner.\nThe CEO of the cruise operator Coral Expeditions, Mark Fifield, said on Saturday that passengers and crew on the Coral Adventurer were told on Wednesday that the remainder of the voyage had been cancelled due to the \"tragic passing of Suzanne Rees and previous mechanical issues\".\nHe added in a statement that passengers would be issued a full refund, and said Coral Expeditions was working \"to co-ordinate the return journeys of the passengers via chartered flights\".\nAmsa also released an updated statement on Saturday, saying it had \"issued a notice to the Master of Coral Adventurer\" prohibiting any new passengers from boarding the ship.\nThe spokesperson said that officials would attend the vessel in Cairns upon its return.\nThe ship initially left the north-western city on 24 October, and was just two days into the voyage at the time of the 80-year-old's death. Lizard Island was the first stop on the journey.\nPassengers aboard - who typically pay tens of thousands of dollars to join the cruise - were transported there for a day trip with the option of hiking or snorkelling.\nSuzanne Rees' daughter, Katherine Rees, said on Thursday that her family was \"shocked and saddened that the Coral Adventurer left Lizard Island after an organised excursion without my mum\".\nShe described her mother as an \"active 80-year-old\" who was a member of a bushwalking group.\n\"From the little we have been told, it seems that there was a failure of care and common sense.\"\nMs Rees added that she hoped the coroner's inquiry would be able to pinpoint what \"the company should have done that might have saved mum's life\".\n\"We understand from the police that it was a very hot day, and mum fell ill on the hill climb,\" she said.\n\"She was asked to head down, unescorted. Then the ship left, apparently without doing a passenger count.\n\"At some stage in that sequence, or shortly after, mum died, alone.\"\nEarlier this week, Mr Fifield confirmed that Coral Expeditions was \"working closely with Queensland Police and other authorities to support their investigation\".\nHe said that the company was \"deeply sorry that this has occurred\" and had offered its full support to the Rees family.\nThe Coral Adventurer caters for up to 120 guests with 46 crew, according to the company's website. It was purpose-built to access remote areas of Australia's coast and is equipped with \"tenders\" - small boats used to take passengers on day excursions.\nIncidents like this are rare, and cruise ships have systems to record which passengers are embarking or disembarking, Harriet Mallinson, cruise editor of travel website Sailawaze, told the BBC.\n\"Sneaking ashore or [back] on board just isn't an option,\" she said.\nCruise lines take these procedures very seriously and have \"clever tech in place to prevent such incidents from happening\", Ms Mallinson added. \n\"This is most likely a shocking - and tragic - one-off.\"",
    "keywords": null
  },
  {
    "url": "https://www.bbc.com/news/articles/cx2dd7yyly9o",
    "domain": "www.bbc.com",
    "publish_date": "2025-10-31T20:50:43.997Z",
    "language": "en-GB",
    "title": "Tchéky Karyo, star of Nikita and The Missing, dies at 72",
    "description": "The French actor was known for supporting roles in films that spanned nearly 40 years. ",
    "text": "Tchéky Karyo, star of Nikita and The Missing, dies at 72\nAFP via Getty Images\nFrench actor Tchéky Karyo, who had a starring role in the film Nikita and the TV series The Missing, has died aged 72.\nKaryo, who was born in Turkey but grew up in Paris, died of a cancer on Friday, AFP news agency reported. \nKnown largely for supporting roles, Karyo acted in films for nearly four decades, finding a second career in TV series in his final years.\nKaryo's wife, actress Valérie Keruzoré, and their children announced his death in a statement to the news agency. \nKaryo first made his mark in crime thriller La Balance (1982) and he played the handler Bob in Luc Besson's assassin film Nikita (1990).\nBBC audiences might best remember him for his role in The Missing (2014).\nThe first eight-part series, about the search for a missing boy in France, starred Karyo as French detective Julien Baptiste. James Nesbitt and Frances O'Connor played the boy's parents.\nThe second eight-part series, about a missing girl in Germany, was brodcast in 2016. Karyo returned as Baptiste, with David Morrissey and Keeley Hawes as the girl's parents.\nBoth series received positive reviews, with critics praising the cast, especially Karyo's performance. \nIn February 2019, a spin-off series titled Baptiste was broadcast on BBC One. \nLindsay Salt, Director of BBC Drama, said: \"We are so sad to learn of the passing of Tchéky Karyo. He was a truly brilliant and much loved actor and he will be fondly remembered by BBC viewers for his roles in The Missing, Baptiste and most recently Boat Story. Our thoughts are with his family and loved ones at this time.\"\nKaryo was born on 4 October 1953 in Istanbul, the son of a Turkish lorry driver of Spanish-Jewish origin and a Greek mother, Le Monde newspaper writes.\nAfter several years as a theatrical actor, he saw his role in La Balance earn him a nomination for the César Award for Best Male Revelation.\nWith his strong jaw and penetrating stare, he went on to star in dozens of films of all kinds. \nOther French films included Besson's Joan of Arc (1993) and the anti-war epic A Very Long Engagement (2004). He was also cast in Ridley Scott's 1492: Conquest of Paradise (1992) and in the James Bond film GoldenEye (1995).\nOne of his starring roles was as the medieval prophet Nostradamus in the 1994 film of the same name, while his tiniest role was undoubtedly in Amélie (2001) where he only appeared as a face on an ID photograph in an album.",
    "keywords": null
  },
  {
    "url": "https://www.bbc.com/news/articles/c0qppe4vdevo",
    "domain": "www.bbc.com",
    "publish_date": "2025-10-31T18:01:15.015Z",
    "language": "en-GB",
    "title": "Sudan war: More than 60,000 flee el-Fasher after its capture by RSF militia, UN says",
    "description": "El-Fasher is under the control of paramilitaries accused of mass executions and crimes against humanity.",
    "text": "More than 60,000 flee el-Fasher after its capture by RSF militia, UN says\nAnbarasan Ethirajan,Global affairs reporter and \nNatasha Booty\nMore than 60,000 people have fled the Sudanese city of el-Fasher, which was captured by the paramilitary Rapid Support Forces (RSF) over the weekend, according the UN refugee agency. \nThere have been reports of mass executions and crimes against humanity as the RSF fighters stormed the city after an 18-month siege marked by starvation and heavy bombardment.\nThe flow of those fleeing the violence towards the town of Tawila, about 80km (50 miles) west of el-Fasher, had increased in the past few days, the UNHCR's Eujin Byun told the BBC.\nThey were narrating horrendous stories of atrocities, including rape, and the agency was struggling to find enough shelter and food for them, she said.\nBut the RSF has detained one of its militiamen, Abu Lulu, who has been accused of summary executions.\nThe group shared footage showing the fighter's arrest after BBC Verify identified him as being responsible for the execution of multiple unarmed men near el-Fasher.\nTikTok has confirmed to the BBC that it has banned the account associated with Lulu. It is not clear whether he had controlled the account in his name.\nSudan was plunged into a civil war in April 2023 after a vicious struggle for power broke out between its army and the RSF.\nIt has led to a famine and claims of a genocide in the western Darfur region.\nMore than 150,000 people have died in the conflict across the country, and about 12 million have fled their homes in what the UN has called the world's largest humanitarian crisis.\nThe takeover of el-Fasher reinforces the geographic split in the country, with the RSF now in control of western Sudan and much of neighbouring Kordofan to the south, and the army holding the capital, Khartoum, central and eastern regions along the Red Sea.\nThe two warring rivals had been allies - coming to power together in a coup in 2021 - but fell out over an internationally backed plan to move towards civilian rule.\nAdditional reporting by Merlyn Thomas",
    "keywords": null
  },
  {
    "url": "https://www.bbc.com/news/articles/cq6z5e5y55eo",
    "domain": "www.bbc.com",
    "publish_date": "2025-10-31T12:21:55.220Z",
    "language": "en-GB",
    "title": "Dutch centrist Rob Jetten claims victory over Wilders in neck-and-neck election race",
    "description": "Jetten said his D66 liberal party had achieved a historic result after vote analysis indicated it could not be beaten.",
    "text": "Dutch centrist Rob Jetten claims victory over Wilders in neck-and-neck election race\nPaul KirbyEurope digital editor\nPierre Crom/Getty Images\nRob Jetten, 38, is now tipped to become the youngest prime minister in modern Dutch history\nCentrist liberal leader Rob Jetten has claimed victory in Wednesday's nail-biting Dutch election, after vote analysis indicated his party could not be beaten by anti-Islam populist Geert Wilders.\nJetten's D66 party currently has a narrow lead of 15,000 votes over Wilders' Freedom Party, and Dutch news agency ANP says even though the vote count is not complete, Wilders can no longer win.\n\"We are the biggest party in the Netherlands! Now we'll get to work for all Dutch people,\" Jetten posted on X. \nWilders said it was the electoral council not a news agency that decided the result: \"What arrogance not to wait for that.\"\nProjections from about 99% of the vote put both parties on 26 seats in the 150-seat parliament - but ANP says Jetten's centrists could win a 27th seat.\nJetten, 38, told reporters he was \"very proud of this historic result\" and now felt a great responsibility to form a stable and ambitious government.\nWilders had led opinion polls going into Wednesday's election, but Rob Jetten succeeded in winning in some of the main Dutch cities including Rotterdam, The Hague and Utrecht with a positive campaign using a catchphrase of \"Yes, we can\". \nNo Dutch election race has ever been so close, and if Jetten does become prime minister he will be the youngest in Dutch history.\nUntil now Jetten was careful not to declare victory until all votes were in, but ANP said based on figures from postal voters abroad he could now be declared the winner.\nWilders said even if D66 did go on to become the biggest party, his Freedom Party (PVV) would \"not let the Netherlands be broken up by Jetten and his people\".\nJetten told reporters that his party had \"shown to the rest of Europe and the world that it is possible to beat the populist movements if you campaign with a positive message\".\nThe Dutch electoral system is based on proportional representation in one nationwide constituency, so whichever party secures most votes wins most seats. \nJetten's liberals have so far won 16.9% of the vote, while Wilders' Freedom Party is on 16.7%. As results came in on Thursday, the race was so close that the lead flipped between the two parties.\nIn a sign that he was not ready to concede victory, Wilders dubbed the Dutch news agency \"ANP66\" and shared unfounded claims from social media of vote-rigging. One local authority, in Zaanstad outside Amsterdam, rejected the allegation as \"fabricated\".\nAlthough the D66 leader's path to forming a coalition is not straightforward, Jetten has said he wants to make a quick start.\nJetten said after the vote that never before had a party won a Dutch election with fewer than 30 seats. \nHe will need the support of at least three other parties to gather the 76 seats needed to form a coalition. The most obvious candidates would be the conservative-liberal VVD, the left-wing Labour (PvdA)-GreenLeft alliance and the Christian Democrats, but it could take months if that is to happen.\nVVD leader Dilan Yesilgöz has so far ruled out working with the left, but Jetten said he favoured a broad-based government from the centre of Dutch politics.\nThe weekend would be a good chance for all the parties to reflect, before a \"scout\" is given the task next Tuesday of sounding them out. \nJetten said he wanted to construct a coalition that represented best the millions of voters who had backed other parties to tackle the main issues, including the housing shortage and asylum and migration.\nHis path to victory has stunned observers. Less than two years ago he led D66 - a party formed by democratic reformers in 1966 - to fifth place and just nine seats. \nOnly a few weeks ago they were still languishing in the opinion polls, but gradually improved as Jetten put in several polished performances in TV debates and even competed in the final of a TV quiz show 11 days before the election.\nOutgoing Prime Minister Dick Schoof predicted on Friday that Jetten's task of forming a coalition would prove complicated. \"I reckon I'll still be prime minister at Christmas - I'd be surprised if it happened [by then]\".\nSchoof, a former chief of Dutch intelligence, was picked for the top job by Geert Wilders, who abandoned his bid to lead the country last year because his prospective coalition partners would not support having a far-right prime minister.\nWilders won the last election in November 2023, and a government was only formed in July 2024. Eleven months later, he brought his own government down, in a row with his coalition partners over asylum and migration policy.",
    "keywords": null
  },
  {
    "url": "https://www.reuters.com/world/asia-pacific/south-koreas-lee-hopes-keep-cooperating-with-indonesia-military-security-2025-11-01/",
    "domain": "www.reuters.com",
    "publish_date": "2025-11-01T07:07:19.77Z",
    "language": "en",
    "title": "South Korea's Lee hopes to keep cooperating with Indonesia in military security | Reuters",
    "description": "South Korean President Lee Jae Myung told Indonesian President Prabowo Subianto on Saturday that he hopes the two countries will continue to cooperate in military security, building on existing collaboration such as the joint development of fighter jets, Lee's office said.",
    "text": "South Korea's Lee hopes to keep cooperating with Indonesia in military security\nMisleading The ad contains deceptive or false claims. \nOffensive The ad includes hateful, violent, or discriminatory content. \nAdult Content Sexually explicit or age-inappropriate material. \nUnwanted Product or Service Spammy or irrelevant content. \nSecurity Concern The ad appears unsafe, malicious, or a scam. \nOther Something else not listed above.",
    "keywords": "DIP,ECO,GEN,MCE,POL,EASIA,KR,ASEAN,SEASIA,ASXPAC,ID,EMRG,ASIA,APEC,CWP,DEF,INTAG,SECUR,RULES:WORLD-SOUTH-KOREA,DEST:SEATP,DEST:OUSWDM,PACKAGE:WORLD-NEWS"
  },
  {
    "url": "https://www.reuters.com/world/americas/",
    "domain": "www.reuters.com",
    "publish_date": "2025-11-01T11:18:44.761Z",
    "language": "en",
    "title": "Americas | Latest News in Central & Latin America | Reuters",
    "description": "Reuters.com is your online source for the latest Americas news stories and current events, ensuring our readers up to date with any breaking news developments",
    "text": "Americas | Latest News in Central & Latin America\nMisleading The ad contains deceptive or false claims. \nOffensive The ad includes hateful, violent, or discriminatory content. \nAdult Content Sexually explicit or age-inappropriate material. \nUnwanted Product or Service Spammy or irrelevant content. \nSecurity Concern The ad appears unsafe, malicious, or a scam. \nOther Something else not listed above.",
    "keywords": ""
  },
  {
    "url": "https://www.reuters.com/world/china/",
    "domain": "www.reuters.com",
    "publish_date": "2025-11-01T11:19:56.270Z",
    "language": "en",
    "title": "China News | Today's Breaking Stories | Reuters",
    "description": "Reuters.com is your online source for the latest China news stories and current events, ensuring our readers up to date with any breaking news developments",
    "text": "China News | Today's Breaking Stories\nMisleading The ad contains deceptive or false claims. \nOffensive The ad includes hateful, violent, or discriminatory content. \nAdult Content Sexually explicit or age-inappropriate material. \nUnwanted Product or Service Spammy or irrelevant content. \nSecurity Concern The ad appears unsafe, malicious, or a scam. \nOther Something else not listed above.",
    "keywords": ""
  }
]